{"1":{"Title":".22 Pistols","Author":"Brandon Naramore","Submitted":20020708,"Updated":20020616,"Category":"Weapon","Model Format":"Fan Skin","Description":"Just a simple .22 pistol model.","Rating":6,"Awards":[]},"2":{"Title":".22 Pistol","Author":"Squeeself","Submitted":20030103,"Updated":20030104,"Category":"Weapon","Model Format":"Fan Skin","Description":"Modern .22 Pistol model for Pistol hak here.","Rating":6,"Awards":[]},"3":{"Title":".223 Commando M4A1 & .30 Kalashnikov AKM Assault Rifles","Author":"Alexeyev Stanislav","Submitted":20040710,"Updated":20040710,"Category":"Weapon","Model Format":"MDL","Polycounts":"2*400","Description":"Models of russian AKM avtomat and american M4A1 assault carbine. All anim/shells/muzzle flare/bullets. For more go to HakPacks gallery of this site. Enjoy.","Rating":10,"Awards":[]},"4":{"Title":"1-Handed Small Crossbow","Author":"Jupp","Submitted":20020708,"Updated":20020609,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"345","Description":"1-Handed Small 'Arms Crossbow ' =============================== First invented by the weaponsmith Jonathan Arms, about 20 years ago, who was inspired by the small crossbows that are used by the Drow. So he went on and totally reengineered and refined the design until he got this weapon. He made a total of 15 1-handed crossbows which he sold to various people from all over the country. It is said that a famous assassin was one of the buyers but this has never been proven. But the overall opinion by everyone that got a hand on those weapons was absolute positive. It seems that Jonathan Arms made a masterpiece of craftmanship with those weapons.","Rating":8.75,"Votes":2,"Awards":[]},"5":{"Title":"2hander Holy Advenger(angel figure on the guard)","Author":"BattleRaptor","Submitted":20040611,"Updated":20040611,"Category":"Weapon","Model Format":"Fan Skin","Polycounts":"2180","Description":"Well its pretty straight forward... Runed blade, angel relic on the guard. dont have any paint programs installed so I used window paint to texture it, sorry in advance :P Angel(2 one on each side) takes up about 2k of the entire polies the actual sword is about 200. I however have maya and couldnt find any programs to turn it into useable format for NWN so here is the model in OBJ format with a texture in PNP hopefully if someone with Max likes it enough they will add it? was going to have the angel holding a cystal ball but it was starting to get to high polies so I cut it. In RAR ziped format","Rating":10,"Awards":[]},"6":{"Title":"3Some Tileset Hak.","Author":"Arcanius","Submitted":20020708,"Updated":20020705,"Category":"Tileset","Description":"I have taken the 3 tilesets Desert, Winter, Egyptian and combined them into 1 hak file can you pls make it available for your folk? The tilesets are NOT my creation I have just combined them into 1 hakfile The Desert tileset was created by Xahlt. The Winter tileset V.06 was created by Labtek and Kenbok (aka Loremaster Q). The Eqyptian Tileset by Runemaker.","Rating":1,"Awards":[]},"7":{"Title":"4in1 Tileset Hak.","Author":"Arcanius","Submitted":20020708,"Updated":20020705,"Category":"Tileset","Description":"I have combined 4 tilesets into 1 : Desert, Drylands, Eqyptian and Winter The Desert tileset was created by Xahlt. The Winter tileset was created by Labtek and Kenbok (aka Loremaster Q). The Egyptian tileset was created by Runemaker and the Drylands by Baronrage. i have just combined them. all are the lastest versions that i could get my hands on.","Rating":8,"Awards":[]},"8":{"Title":"7 tavern placeables","Author":"Lafferty","Submitted":20020714,"Updated":20020723,"Category":"Other","Model Format":"BioWare Standard","Description":"7 placeables you all know well... they are cut out from the city interior tileset. They should work well except the chair :( I was sick of walking through rooms and always ignoring the chairs and tables and such because i knew they are static... Now it's time for a change and the players have to examine their surroundings more. All objects should now be correctly sitable/usable Had to remove the chair... it was buggy, sirry guys. Updated Now with ERF and a test module","Rating":7,"Awards":[]},"9":{"Title":"AK-103","Author":"Alexeyev Stanislav","Submitted":20040228,"Updated":20040228,"Category":"Weapon","Model Format":"MFX","Description":"New version of AK kal 5.56 (without texture). Important : to show the model USE _t_ and _b_ models from my Mauser Rifle !","Rating":"N/A","Awards":[]},"10":{"Title":"Air Elemental","Author":"BioWare","Submitted":20020708,"Updated":20020424,"Category":"Monsters","Model Format":"BioWare Standard","Description":"As intangible as the very air, and swifter then any beast known, this creature is both the whispering wind and a howling hurricane capable destroying the thickest of castle walls. Good for cooling off hot soup in a pinch.","Rating":7,"Awards":[]},"11":{"Title":"Altered Long swords","Author":"GarlandZeromus","Submitted":20030914,"Updated":20030914,"Category":"Weapon","Model Format":"Other","Polycounts":"16-74","Description":"Altered original longswords to have a more Final Fantasy 7 flavor. There are .mdl files to put into the override folder if you want to use them in your single player original game.. or any single player mod. There is also a hak for mod makers. These mdls have 16 to 74 polys. Only the Blades of longswords are altered, everything else the same. Files are designed to override original longswords from bioware.","Rating":8.5,"Votes":0,"Awards":[]},"12":{"Title":"Alternate Combat Animations Beta v0.3","Author":"ragnarok_mr4","Submitted":20030821,"Updated":20030902,"Category":"Animation","Model Format":"BioWare Standard","Description":"Update v03. (Setp 02,2003): What's new: 1) Fixed some wierd animation bugs where the torso would separate from the hips during some animation sequences. 2) Added roundhouse kick/spinning back kick combo (replaces uppercut animation) 3) Added hakpak version for those who don't want to fudge with the override folder. Update v0.2 (Sept 02, 2003): What's new: 1) Modified the Shaolin open stance to make it more elegant 2) Modified unarmed close-in attack from elbow/forearm smash to flurry of punches Older features: 1) cat's paw stance for unarmed combat 2) alternate stances for 2-weapon fighting 3) whilwind-strike for 2-weapon 'reach' animation To install: unzip file and copy to the override folder. This file is not compatible with anything that modifies the a_ba_med_weap.mdl file. Please send me your comments or suggestions.","Rating":9.69,"Votes":4,"Awards":[]},"13":{"Title":"Alternate Combat Animations v2.0","Author":"ragnarok_mr4","Submitted":20031214,"Updated":20040212,"Category":"Animation","Model Format":"BioWare Standard","Description":"Here is version 2.0 of the Alternate Combat Animations pack! All the animations have been redone and there are too many new things to spell out here. Just check the readme in the zip file for details and installation instructions. Please leave your comments on this board. I only use a hotmail account with limited space, so please only send bug reports or serious requests to my email. Enjoy!","Rating":9.6,"Votes":3,"Awards":["Hall of Fame"]},"14":{"Title":"Ankheg","Author":"Taern","Submitted":20050304,"Updated":20050313,"Category":"Monsters","Model Format":"3DS","Polycounts":"1000","Description":"This is a model I made a while ago. I thought Ankhegs were really neat creatures in BG, and so I tried to make one in 3DS for NWN. The model and texture turned out well, but unfortunately I was unable to animate it properly :( I hope someone will be able to finish the job. The model is taken from 3rd Ed. so that's why it doesn't look much like in BG. --- INCLUDED : c_ankheg.3DS, c_ankheg.TGA (texture), c_ankheg.PSD (texture in photoshop format) --- UPDATE : Uploaded the correct file in 3DS format","Rating":9.95,"Votes":7,"Awards":[]},"15":{"Title":"Another nude package","Author":"d3myz3","Submitted":20040314,"Updated":20040314,"Category":"PC Parts","Model Format":"MDL","Description":"Nude body parts for all races and phenotypes. All models use danglymesh. This package is intended to be used by mod makers. The model groups are seperated by folders and include hak paks for easy viewing of different content. Feel free to rip, rebuild, rename, or use as is.","Rating":7.92,"Votes":8,"Awards":[]},"16":{"Title":"Ant","Author":"Joe Wiedeman","Submitted":20020716,"Updated":20020716,"Category":"Monsters","Model Format":"3DS","Polycounts":"681(1041 triangulated)","Description":"This the first model I've done completely on my own. I could cut a lot of poly's if i could figure out how to join part of teh eye sphere to the head... The scale is likely way off since I don't know what scale the NWN models are... I intend to refine it when I learn more. I also intend to skin it when I learn to do that....","Rating":5,"Awards":[]},"17":{"Title":"Arcane Space 1.5 Placeables","Author":"Dartagnon","Submitted":20040215,"Updated":20040215,"Category":"Placeables","Model Format":"MDL","Description":"Arcane Space Placeables This erf includes a number of placeables for use with the Arcane Space 1.5 Tileset package. I take absolutely no credit for anything other than being a fan of the team and just wanted to assist in some small way. There are 68 placeables(that I found) that were difficult to get at without an erf... Here it is! All I did was to figure out how to get these placeables into the toolset in the first place, sort them into the custom list and package it into an easy to install erf file. Beyond that, all of this wonderful work was created by the Arcane Space Tileset Team. Whom I've found at http://www.crimsonstars.com This file has been compressed using winrar compress/decompress software. A free evaluation copy of this software can be obtained at: http://www.rarlab.com/download.htm Thanks Guys!!!","Rating":10,"Awards":[]},"18":{"Title":"Armor of NGRU barbarian","Author":"NGRU_IRBIS","Submitted":20020708,"Updated":20020607,"Category":"Armor","Model Format":"Fan Skin","Rating":8,"Awards":[]},"19":{"Title":"Arquer","Author":"Djinn","Submitted":20020708,"Updated":20020515,"Category":"Other","Model Format":"3DS","Polycounts":"20.000","Description":"A render of an archer made in 3DStudio MAX with hight polycounts (because meshsmooth).","Rating":9,"Awards":[]},"20":{"Title":"Automaton, Hammerer","Author":"Dunad","Submitted":20030221,"Updated":20030309,"Category":"Monsters","Model Format":"BioWare Standard","Description":"This is the first version of my Automaton, Hammerer class, for those who are interested this creature is described in Monster Manual 2 from wizard of the coast. This model is a mainly a minogon with a new head (taken from the shield guardian), a blade on his back (from the minogon's axe) and a hammer hand (at the very beginning it was a barrel). Well, it looks pretty good now. If someone can do better for the textures, don't hesitate. It is about 6 hours of work, hope you'll enjoy it.","Rating":7,"Awards":[]},"21":{"Title":"Badger","Author":"BioWare","Submitted":20020708,"Updated":20020327,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Small, fuzzy and quick to tear big, important pieces from you as you laugh at it?s funny waddlesque gate. Some say the badger is on par with the Wolverine as far as more kidney?rippin? anger per square inch. Don?t mess with the badger! Exclusive to NWStratics","Rating":6,"Awards":[]},"22":{"Title":"Band of the Red Hand BugBear","Author":"Dhoom","Submitted":20020708,"Updated":20020319,"Category":"Monsters","Model Format":"Fan Skin","Description":"Re-skinned Bugbear model.","Rating":5,"Awards":[]},"23":{"Title":"Bard-Jester","Author":"Kinarr Greycloak","Submitted":20020708,"Updated":20020429,"Category":"NPC","Model Format":"Fan Skin","Description":"Here is a Bard / Jester with some custom animations I worked on. He is juggling some fireballs, has a clapping emote and I changed Bioware's laugh emote to point and hold his belly while laughing.","Rating":6,"Awards":[]},"24":{"Title":"Barghest","Author":"Jack the Ripper","Submitted":20040216,"Updated":20040216,"Category":"Monsters","Model Format":"MDL","Description":"I was using Zoligato's model viewer and I found this in the bifs. I didn't look for the portrait, though.","Rating":"N/A","Awards":[]},"25":{"Title":"Battle Axe--'Fire Thrower'","Author":"B.B. Roth","Submitted":20020708,"Updated":20020612,"Category":"Weapon","Model Format":"Other","Rating":4,"Awards":[]},"26":{"Title":"Battle Axe","Author":"Barks","Submitted":20020708,"Updated":20020323,"Category":"Weapon","Model Format":"MFX","Description":"This I made from another axe I had.","Rating":2,"Awards":[]},"27":{"Title":"Battle Javelin","Author":"John Bruce","Submitted":20020708,"Updated":20020604,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"348","Rating":4,"Awards":[]},"28":{"Title":"Bat","Author":"BioWare","Submitted":20020708,"Updated":20020411,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Bat- Beady-eyed flying mice that can really ruin a camping trip. The common bat, or Myotis lucifugus, can move like the wind and has been freaking out hikers for untold eons. Natural habitat is any boarded up old house on a hill or dark caves where they will fly out in swarms immediately after a tense musical build up.","Rating":8,"Awards":[]},"29":{"Title":"Beetles - Fire and Giant","Author":"BioWare","Submitted":20020708,"Updated":20020411,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Giant Beetle- Seeking revenge for every one of its tiny brethren who were crushed under an uncaring shoe heel these multi-legged horrors don?t nibble on leafy greens anymore. They are single-minded in defending their lair or removing important brain-filled sections of your heroic adventurer self as you explore the dark underbelly of caverns. Fire Beetle- How do you make a 3 foot, fast moving giant cockroach with a taste for human blood even scarier? Add flame. Stay home.","Rating":6,"Awards":[]},"30":{"Title":"Beholder","Author":"Anthony Spruyt","Submitted":20020708,"Updated":20020317,"Category":"Monsters","Model Format":"MFX","Polycounts":"40042","Description":"Beholder with custom texture","Rating":2.5,"Votes":0,"Awards":[]},"32":{"Title":"Belker","Author":"Bioware, brought to you by Mantrid","Submitted":20030223,"Updated":20030225,"Category":"Monsters","Model Format":"BioWare Standard","Description":"I didn't make this, but I did dig it up using NWN Viewer. I was searching throuhg the BIF files, and low-and-behold, a belker turned up. So here ya go.","Rating":6,"Awards":[]},"33":{"Title":"Big one hand Sword","Author":"Vinzent","Submitted":20020708,"Updated":20020417,"Category":"Weapon","Model Format":"MFX","Description":"I got tired of the lessons and desided to make this it's not the best i've ever seen but I think it's ok.","Rating":4,"Awards":[]},"34":{"Title":"Black_Widow","Author":"Sieth","Submitted":20020708,"Updated":20020320,"Category":"Monsters","Model Format":"Fan Skin","Rating":6,"Awards":[]},"35":{"Title":"Boar","Author":"BioWare","Submitted":20020708,"Updated":20020327,"Category":"Monsters","Model Format":"BioWare Standard","Description":"If you thought that badgers were creatures to fear while going on picturesque forest picnics, the Wild Boar, or Sus scrofa, can be a 500 pound grunting, charging, pointy teeth jabbing nightmare. While they normally eat crops, roots, tubers, insects, snakes, offal and carrion they can be encouraged to partake in uncooked adventurer with little or no provocation. That'll do pig.","Rating":5,"Awards":[]},"36":{"Title":"Broad Sword Of the Warriors Code","Author":"Trix","Submitted":20030319,"Updated":20030321,"Category":"Weapon","Model Format":"3DS","Polycounts":"80","Description":"Allright I updated it... it's now an MDL but it still needs work before it can be used. I included 3 512x512 .tga textures too. If you can do something with this please email me: Rthomas@email.com THNX =p","Rating":7.38,"Votes":2,"Awards":[]},"37":{"Title":"Broad Sword","Author":"Barks","Submitted":20020708,"Updated":20020323,"Category":"Weapon","Model Format":"MFX","Description":"This is the first model I made. It is made completely of primitives.","Rating":3,"Awards":[]},"38":{"Title":"Broken Beast","Author":"Enthas","Submitted":20020708,"Updated":20020321,"Category":"Monsters","Model Format":"Fan Skin","Rating":9.17,"Votes":3,"Awards":[]},"39":{"Title":"Broken Bridge","Author":"Discmaster","Submitted":20030506,"Updated":20030609,"Category":"Other","Model Format":"Other","Description":"This is my first atempt at 3d modeliing so its not very good i started to make this for a friends moduale but he stoped makeing it so i decided to post what i had done of it here. the textures came with 3ds max. feel free to do whatever you want with this. 05/13/03 I have made some changes to the file it isnt a tile or hak yet but the model is almost done. 05/15/03 attached to cliff. 05/20/03 I cant get this to work right. i can get it into the game but the textures dont show up and the walk mesh is not right can someone help me? id like to know what im doing wrong. Ive been out of town for the last few weeks and im getting ready to leave for a few more so i wont be working on this for a while if anyone wants to finnish it email me and ill give you the update info.","Rating":8,"Awards":[]},"40":{"Title":"BugBear Priest","Author":"Merle","Submitted":20020708,"Updated":20020315,"Category":"Monsters","Model Format":"Fan Skin","Description":"BioWare's Bugbear with new animations, casting, praying, etc..","Rating":7,"Awards":[]},"41":{"Title":"Bugbear_Undead","Author":"Sieth","Submitted":20020708,"Updated":20020320,"Category":"Monsters","Model Format":"Fan Skin","Rating":8,"Awards":[]},"42":{"Title":"Bugbear","Author":"BioWare","Submitted":20020708,"Updated":20020313,"Category":"Monsters","Model Format":"BioWare Standard","Description":"The bugbear is the largest and most fearsome of the goblinoid races, dwarfing over its smaller cousins at a height of over 7 feet and possessing incredible strength and savagery. Roughly humanoid, the bugbear's yellowish hide, coarse hair and rows of sharp teeth give it a more monstrous appearance. Its keen nose looks almost like that of a bear's -hence the name- but the bugbear is no animal. It is a cunning and merciless opponent that will use whatever crude weapons and armor it can bring to bear and will work in tandem with others of its kind to hunt those weaker than itself.","Rating":7,"Awards":[]},"43":{"Title":"Calico Panther Overrides","Author":"PaleCommander2004","Submitted":20041230,"Updated":20041230,"Category":"Monsters","Model Format":"Fan Skin","Description":"This is a reskin of the standard Bioware panther which is both an animal companion and familiar. This new version has a different portrait and has calico coloring, perfect for anyone bored with their animal companion. To use just unzip into your override directory. Enjoy!","Rating":10,"Awards":[]},"44":{"Title":"Camel","Author":"M.G.Skaggs","Submitted":20030513,"Updated":20030514,"Category":"Other","Model Format":"3DS","Description":"Here is a rough Camel if someone wants to try to animate it for NWN (like Submers or someone). I am not up on animating in GMax, so here is an exported .3ds of the rough Camel I came up with. Probably needs polys reduced too. (Not sure what the character limit is on NWN). Its winrared.","Rating":7,"Awards":[]},"45":{"Title":"Carrion Crawler","Author":"Chaeolwyn","Submitted":20030427,"Updated":20030428,"Category":"Monsters","Model Format":"Other","Polycounts":"1300","Description":"Model is in .mdl format for now. This is my first attempt at creating anything for NWN and it could use some work. I've included a hakpack, all textures, and the basic .mdl file as well if someone wishes to make any improvements.","Rating":7,"Awards":[]},"46":{"Title":"Celtic Short Sword","Author":"Fenmarel","Submitted":20020708,"Updated":20020411,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"106","Description":"Leaf-bladed short sword with Celtic style hilt and pommel. The sword is a single mesh for now until the community comes up with a proper .mdl format export tool. The texture is overly large for weapons at this stage. Bioware seem to be using generic universal textures for their weapon in order to keep the memory hit as low as possible. The sword can easily be remapped to use their textures at a later date if this is a big issue.","Rating":7,"Awards":[]},"47":{"Title":"Centaur","Author":"inselaffe","Submitted":20020708,"Updated":20020315,"Category":"Monsters","Model Format":"Fan Skin","Description":"Modified Deer with human torso and sword","Rating":4,"Awards":[]},"48":{"Title":"Chain Whip","Author":"bobdamonkey","Submitted":20020708,"Updated":20020708,"Category":"Weapon","Model Format":"MFX","Polycounts":"3203","Description":"Second model, this one was made by request for Ken Ken.","Rating":6,"Awards":[]},"49":{"Title":"Chaos Knight","Author":"whalebones-othar","Submitted":20020708,"Updated":20020317,"Category":"NPC","Model Format":"Fan Skin","Description":"based on the human model for nwn bioware viewer - with realistic sword","Rating":7,"Awards":[]},"50":{"Title":"Chenge Katana Models�@Override pack PTLight for Override","Author":"Dsss","Submitted":20041027,"Updated":20041027,"Category":"Weapon","Model Format":"MDL","Description":"Chenge NWN defoult Katana Models & SFX models to PTLight-HAK ver.0.17's models","Rating":"N/A","Awards":[]},"51":{"Title":"Chocobo","Author":"GES","Submitted":20041019,"Updated":20041019,"Category":"Monsters","Model Format":"Other","Description":"A Picture can be found here http://usera.imagecave.com/FFECHOES/Chocobo.JPG Please note that i have never before used the modeler and 99.99% of the work on the original model was done by Hydromancerx (Diatryma Model). I only tried my best to make it look like a chocobo. if anyone can make it look better, skin it appropriatly, animate, and I really hope they can make it a rideable chocobo it'd be greatly appreciated. I need one for my mod.","Rating":"N/A","Awards":[]},"52":{"Title":"Clawed Horror","Author":"DMcF","Submitted":20020818,"Updated":20020818,"Category":"Other","Model Format":"3DS","Description":"Here is a Clawed Horror that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model.","Rating":4,"Awards":[]},"53":{"Title":"Claymore","Author":"Tek0","Submitted":20031216,"Updated":20031216,"Category":"Weapon","Model Format":"Other","Description":"This is a claymore I wanted to make, because I thought that NWN lacked this weapon. Now, I know that this model has far too many polygons, but the purpose of submitting this file is simply to see what you guys think about this model. Later on - if I am encouraged to - I will turn it into a model useable in-game.","Rating":9.5,"Votes":0,"Awards":[]},"54":{"Title":"Cleric_female","Author":"Colorsmith&Inselaffe","Submitted":20020708,"Updated":20020430,"Category":"NPC","Model Format":"Fan Skin","Description":"Another skin variation of Inselaffe's female model, this one also uses the sorceress animation by Kinaar Greycloak","Rating":6,"Awards":[]},"55":{"Title":"Conan's Sword","Author":"volition","Submitted":20020821,"Updated":20020821,"Category":"Animation","Model Format":"3DS","Description":"Conan the Barbarian's Sword, my first model made from a real picture.","Rating":6,"Awards":[]},"56":{"Title":"Couati","Author":"DMcF","Submitted":20020820,"Updated":20020820,"Category":"Other","Model Format":"3DS","Description":"Here is a Couati that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model","Rating":3,"Awards":[]},"57":{"Title":"Cruiser (ship) (Version 2 - now works !)","Author":"Alexeyev Stanislav","Submitted":20040525,"Updated":20040525,"Category":"Placeables","Model Format":"MDL","Polycounts":">1000 but <2000","Description":"Now the Cruiser model works. There are 2 more models - LineShip and CivilianShip in this zip.rar.","Rating":8,"Awards":[]},"58":{"Title":"Cruiser (ship)","Author":"Alexeyev Stanislav","Submitted":20040523,"Updated":20040523,"Category":"Placeables","Model Format":"MDL","Description":"Simple german WW2 cruiser. To be used in modern ports locations or smth. else. If you want, Ill publish Galion, Frigath and Galera.","Rating":"N/A","Awards":[]},"59":{"Title":"Cyclops","Author":"DMcF","Submitted":20020822,"Updated":20020823,"Category":"Other","Model Format":"3DS","Description":"Here is a Cyclops that needs skins and animations. It is in 3DS and mdl format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model. With this model I have also added basic textures.","Rating":3,"Awards":[]},"61":{"Title":"Deer","Author":"BioWare","Submitted":20020708,"Updated":20020313,"Category":"Monsters","Model Format":"BioWare Standard","Description":"This docile animal is certainly no threat to any adventurer within the forest, concerning itself mainly with eating plants and escaping at incredible speed at the slightest hint of danger. The deer would feel no threat by the presence of a ranger or druid, but it would treat any other humanoid as it would a dangerous predator...and of those there are plenty within the forest.","Rating":7,"Awards":[]},"62":{"Title":"Demon_Fairy_9L","Author":"NinthLetter","Submitted":20020708,"Updated":20020329,"Category":"Monsters","Model Format":"Fan Skin","Description":"This is what happens when Pixies get up on the wrong side of the leaf in the morning.","Rating":7,"Awards":[]},"63":{"Title":"Desert Tileset","Author":"Xahlt","Submitted":20020708,"Updated":20020627,"Category":"Tileset","Description":"This is a duplicated tileset (7MB) for use in NWN. To use the tileset you must add this hak pak to your module. You can then create a new area using a tileset called 'Grains of Sand'. Any user of a module created with this tileset will need this hak pak installed on their system to play the module. Please note that this tileset is a simple reskinning and has no custom geometry (with some extremely small exceptions). As of this version the tools to create custom geometry are not extant, so eventually this desert won't be quite so barren :) This version has severely dimensionally compressed images to make it close to a reasonable download size, *MAKING THE VISUAL QUALITY NOT AS HIGH AS IT COULD BE*. Hopefully in the future these textures will be dds files which will make it even smaller, but with more detail.","Rating":8.5,"Votes":0,"Awards":[]},"64":{"Title":"Diatryma Model","Author":"Hydromancerx","Submitted":20021104,"Updated":20021105,"Category":"Monsters","Model Format":"3DS","Description":"This is a 3DS model of a Diatryma I made. I am use to working in Bryce so bear with my primative model. The color picture of the birds is what I have done in Bryce and hope someone can make this look like that, and skin it and aniamte it. Just someone please try! Diatryma is also know as a chocobo in Final Fantasy.","Rating":7,"Awards":[]},"65":{"Title":"Dire Boar","Author":"BioWare","Submitted":20020708,"Updated":20020327,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Take the Wild Boar make it 16 feet long and 2,000 pounds and you know that somebody is having a bad day. Tenacious, relentless, and very, very pointy they are a fearsome creature indeed.","Rating":7,"Awards":[]},"66":{"Title":"Dire Rat","Author":"Erendril","Submitted":20020822,"Updated":20020822,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Dire rat for The Sunless Citadel. Also posting a Twig Blight as well.","Rating":"N/A","Awards":[]},"67":{"Title":"DireCat","Author":"BioWare","Submitted":20020708,"Updated":20020313,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Any jungle cat is an animal to fear... the dire cat is a nightmare in comparison. Standing twice as tall as a man at the shoulder and over 35 feet in length, its body rippling muscle, the dire cat is terrifying to behold. Even though it is massive in size, it is as well-versed as its cousin in moving secretly through the tall jungle grasses and heavy undergrowth, stalking its prey before pouncing upon it in a deadly assault. Its huge teeth can tear apart a man-sized opponent easily...and should it get ahold of its target in its powerful jaws, it can use its long claws to rake for deadly damage. The dire cat is a vicious predator that can overpower even well-prepared groups of men and is not to be underestimated.","Rating":8,"Awards":[]},"68":{"Title":"Doomknight","Author":"BioWare","Submitted":20020708,"Updated":20020612,"Category":"Animation","Model Format":"BioWare Standard","Description":"Once glorious beacons of all that is good, right and recently bleached to rash-raising cleanliness, the Doomknight is a fallen undead Paladin of puppy-kicking evil. Skilled fighters, able spell-casters and sporting the latest in Evil-Wear, Doomknights don't have a sensitive, crying-on-the-inside approach to life.","Rating":5,"Awards":[]},"69":{"Title":"Dracolich","Author":"Overdroid","Submitted":20020818,"Updated":20020826,"Category":"Monsters","Model Format":"BioWare Standard","Polycounts":"2020","Description":"This is the final update for the Dracolich. I've made some changes to the mesh and the skin and also added new Hakpak support. You can add it to the list of models or overwrite the penguin model. ENJOY!","Rating":7,"Awards":[]},"70":{"Title":"Draconian v.2 beta testing","Author":"Blackmoon","Submitted":20020820,"Updated":20020821,"Category":"Monsters","Model Format":"Other","Polycounts":"1397","Description":"This is version 2... now usable IN THE GAME! visit http://www.erithan.net/dereklo/models4.htm and scroll down to see the newest version and check out picture 8... those nasty beasts creep up on you at the worst times.. ;) **** note **** this is just a teaser. Clicking on the download will send you to my site. The models will be released with the completion of the mod ;)","Rating":6,"Awards":[]},"71":{"Title":"Draconians","Author":"Blackmoon","Submitted":20020808,"Updated":20020809,"Category":"Monsters","Model Format":"3DS","Polycounts":"1391","Description":"Here is a sampler of a work in progress for Dragonlance Adventures. http://www.dladventures.com/","Rating":3,"Awards":[]},"72":{"Title":"Dragon_Gem_Amethyst","Author":"psycomonkee","Submitted":20020726,"Updated":20020727,"Category":"Monsters","Model Format":"Fan Skin","Description":"v1.1 added some color","Rating":7,"Awards":[]},"73":{"Title":"Dragun Sword","Author":"-[WolF]-Nemo","Submitted":20020925,"Updated":20020926,"Category":"Weapon","Model Format":"MFX","Description":"A sword that slices thru anything because its made from the scales of a Dragun! Its blade is short so it can be easly used and lite.","Rating":5,"Awards":[]},"74":{"Title":"Drake","Author":"DMcF","Submitted":20020813,"Updated":20020813,"Category":"Other","Model Format":"3DS","Description":"Here is a Drake model that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model.","Rating":4,"Awards":[]},"75":{"Title":"Druid","Author":"Kinarr Greycloak","Submitted":20020708,"Updated":20020420,"Category":"NPC","Model Format":"Fan Skin","Description":"Druid with his dire cat companion. He is wearing animal textures from Bioware's animal models and a comfy pair of sahuagin skin boots. :-)","Rating":6,"Awards":[]},"77":{"Title":"Dual Ranger","Author":"gridghost","Submitted":20020708,"Updated":20020324,"Category":"NPC","Model Format":"Fan Skin","Description":"After seeing the dhoom_mummy with it's fitting animations I thought that it would be right to reskin it in the fashion of a skeleton knight. Added a sword to it.","Rating":6,"Awards":[]},"78":{"Title":"Dual wield drow","Author":"gridghost","Submitted":20020708,"Updated":20020320,"Category":"NPC","Model Format":"Fan Skin","Description":"Due to some sources on the net I stumbled over this dual wielding drow with the early swords, so I put on the new swords and made a reskin.","Rating":7,"Awards":[]},"79":{"Title":"Dual-weilding drow","Author":"Colorsmith&Inselaffe","Submitted":20020708,"Updated":20020321,"Category":"NPC","Model Format":"Fan Skin","Description":"This drow skin I made became Inselaffe's excellent experiment with dual weapons.","Rating":4,"Awards":[]},"80":{"Title":"Dungeon No Lava","Author":"Digital Ghost","Submitted":20020715,"Updated":20020715,"Category":"Tileset","Description":"Seen Alot of post around asking for the dungeon without lava. I also did a few other things check it out","Rating":5,"Awards":[]},"81":{"Title":"Dwarven Battlesword from Rune","Author":"zoome","Submitted":20030809,"Updated":20030809,"Category":"Weapon","Model Format":"BioWare Standard","Description":"The Dwarven Battlesword from the game Rune...","Rating":9.25,"Votes":2,"Awards":[]},"82":{"Title":"Dwarven WorkSword","Author":"Zoome","Submitted":20030719,"Updated":20030721,"Category":"Weapon","Model Format":"BioWare Standard","Description":"This is the Dwarfen Worksword from the game RUNE and my first try at modeling. I tried to make the sword to look as much like the original. It�s in .MDL format with two textures","Rating":9,"Awards":[]},"83":{"Title":"Egyptian Crypt Tile Set","Author":"Runemaker","Submitted":20020708,"Updated":20020702,"Category":"Tileset","Model Format":"Fan Skin","Description":"This is a reskined mod (5.38MB) of the Crypt Tile set including custom load images. The zip contains the Hak file as well as a readme with instructions and a selection of screen shots to browse before you decide to install the Hak.","Rating":8.67,"Votes":3,"Awards":[]},"84":{"Title":"Elemental set","Author":"Colorsmith","Submitted":20020708,"Updated":20020416,"Category":"Monsters","Model Format":"Fan Skin","Description":"This is a set of the 4 main elemental types, using particle systems to enhance their effect.","Rating":7,"Awards":[]},"85":{"Title":"Ettercap","Author":"BioWare","Submitted":20020708,"Updated":20020529,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Nobody likes an insect that can wear pants. Voted 'Least Likely to be Featured in a Petting Zoo', these cunning, organized hunters often keep monstrous spiders for pets and, as a result, don't have many friends and are terribly bitter. Bring a tuba-sized can of Raid.","Rating":8,"Awards":[]},"86":{"Title":"Everwinter","Author":"Kenbok","Submitted":20020708,"Updated":20020527,"Category":"Tileset","Model Format":"BioWare Standard","Description":"This is a tileset i created for the rural tileset. Put it on your override directory. It will not work like this in the game, the override directory belongs to bioware, but hakpaks will replace these files.","Rating":8,"Awards":[]},"87":{"Title":"Explosive","Author":"R0(V)AN","Submitted":20040312,"Updated":20040312,"Category":"Item","Model Format":"MDL","Description":"Includes 2 models, dynamite and hand grenade, and the explosion animation.","Rating":10,"Awards":[]},"89":{"Title":"FDheadpatch","Author":"'][' ][ '][' ][","Submitted":20041230,"Updated":20041230,"Category":"PC Parts","Model Format":"MDL","Description":"All heads of Forgotten Dimension, total optional patch for advanced players, over 100 megas of head models for all races, just extract the RAR file to your 'override' folder and overwrite if necessary, now you have tons of new heads to select building your character and everyone will see on line at less in Forgotten Dimension even if not downloading this.","Rating":7.88,"Votes":2,"Awards":[]},"90":{"Title":"Fairies of the Elements","Author":"Tatha","Submitted":20030413,"Updated":20030414,"Category":"Monsters","Model Format":"Fan Skin","Description":"Here's a fairy for each of the elements. Blue for water, green for earth, red for fire, white for air and yellow for spirit. Can be used for various things in a module. Enjoy!","Rating":6,"Awards":[]},"91":{"Title":"Falcata","Author":"DavidC","Submitted":20020920,"Updated":20020921,"Category":"Weapon","Model Format":"3DS","Polycounts":"2152","Description":"This is a sword called a Falcata. I actually have one of these. Check out http://swordforum.com/swords/deltin/dt-falcata.html to see what it's actually supposed to look like. I left the poly count very high, figuring that somebody can reduce them optimally. It'd be cool if somebody could make a texture for it that gives it a fuller (or 'blood groove' as some call it) like the real thing). I'd like to see some more varieties of realistic, historical weapons. The size should be able 25' overall - or it can be longer (that would be like an earlier version - a Greek 'kopis').","Rating":7,"Awards":[]},"92":{"Title":"Fantasy Greatsword","Author":"Tek0","Submitted":20031230,"Updated":20031230,"Category":"Other","Model Format":"Other","Description":"This is a model of a sword I drew, and as with my first model here at the Vault, I'd like your comments. I suppose, if used in Neverwinter Nights, this one is a greatsword or maybe a bastard sword..","Rating":6,"Awards":[]},"93":{"Title":"Feather Wings","Author":"Mystic_Nexus","Submitted":20020913,"Updated":20020913,"Category":"Other","Model Format":"3DS","Polycounts":"1394","Description":"Hi everyone, I know there have been a lot of requests for feather type angel wings. A friend of mine just happened to have some. I cannot take credit for modeling these wings, as I do not know how to model. The model is available in two formats: .3ds, and .obj . The poly count is 1394, and of course it is un-animated. I hope this helps give a modeler the raw tools needed to make a finished Neverwinter .mdl for the community. I think they would look great on a planetar.","Rating":8,"Awards":[]},"94":{"Title":"Female Horned Demons","Author":"Wraithchilde","Submitted":20040716,"Updated":20070706,"Category":"NPC","Model Format":"BioWare Standard","Polycounts":"1000","Description":"This is essentially the female horned demon model I made for use in my Assassin: Hand of the Zshi module. I made two (more explicit) versions for use in the override folder using the SetAppearance command. I don't have a picture or info on my site yet. A readme is included. WARNING: VERY ADULT ORIENTED! 17Sep04: Updated readme to fix errors.","Rating":9.9,"Votes":2,"Awards":[]},"95":{"Title":"Female Wemic Head","Author":"Unknown","Submitted":20050205,"Updated":20050205,"Category":"PC Parts","Model Format":"MDL","Description":"This is a fixed version of the Female Wemic Head that is in the JenX haks.","Rating":"N/A","Awards":[]},"96":{"Title":"Female jiggly armor torsos","Author":"ILmaTeR","Submitted":20020721,"Updated":20020721,"Category":"Armor","Model Format":"BioWare Standard","Description":"Only available on female humans... More to come soon :D","Rating":8.88,"Votes":2,"Awards":[]},"97":{"Title":"Fire Cat","Author":"Enthas","Submitted":20020708,"Updated":20020321,"Category":"Monsters","Model Format":"Fan Skin","Rating":6,"Awards":[]},"98":{"Title":"Fire Elemental","Author":"BioWare","Submitted":20020708,"Updated":20020424,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Exclusive model released at NWNStratics featuring the fire elemental. Here's a desc: A magical incarnation of one of the most feared forces in all creation, and whose merest touch burns flesh or melts armor. Wild, unpredictable living embodiment of fire is a terrifying creation of immense power and can turn a simple marshmellow roast into an epic tragedy.","Rating":8,"Awards":[]},"99":{"Title":"Fix to head from Linu in OC for HotU","Author":"Mordaedil","Submitted":20041206,"Updated":20041206,"Category":"PC Parts","Model Format":"MDL","Polycounts":"164","Description":"This small *.rar file fixes the female elven head which clips now after HotU due to the robe animations. This pissed me off as this is my favorite elven head from the default vault. This is also the first submission I am making as well as my first real creation using 3dsMax for a game. This was rather easy, any one 'could' do it, thing is, noone has. Installation is easy, just export to your override folder. Head 9 is changed.","Rating":"N/A","Awards":[]},"100":{"Title":"Flame Spider","Author":"Dhoom","Submitted":20020708,"Updated":20020319,"Category":"Monsters","Model Format":"Fan Skin","Description":"Just your typical spider, who scuttled his way into the Prime Material Plane from the Elemental plane of Fire. I tried to give him a lava/cooled lava rock look to his skin...","Rating":7,"Awards":[]},"101":{"Title":"Flesh Golem","Author":"BioWare","Submitted":20020708,"Updated":20020320,"Category":"Monsters","Model Format":"BioWare Standard","Description":"The flesh golem is a ghoulish construct, a patchwork of stolen and half-decayed body parts stitched together and animated with a wizard's powerful magic. Standing over 8 feet tall, this animated monstrosity reeks of rotted flesh and freshly-dug earth and walks in a stiff and awkward gait as if its various limbs were not meant to work together. Though the flesh golem is slow in combat, it possesses a fearsome strength and is immune to normal weaponry and most spells, so should only be approached with caution...or better yet avoided altogether.","Rating":7,"Awards":[]},"102":{"Title":"Flintlock Pistol","Author":"Jupp","Submitted":20020708,"Updated":20020609,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"310","Description":"Flintlock Pistol(1-handed) ======================= The small one handed musket is a weapon that is very rarely seen around the Forgotten Realms. But there is one place where the musket is quite common and that is in the hands of a Giff. Fear a Giff that points his musket at you for they know how they have to handle this weapon. Although the wizards of Thay and some obscure gnomish Engineers have 'invented' their own versions of the muskets they are far from being as effective as a Giffs' musket.","Rating":7,"Awards":[]},"103":{"Title":"Forest Spear","Author":"Enthas","Submitted":20020708,"Updated":20020411,"Category":"Item","Model Format":"BioWare Standard","Polycounts":"266","Description":"The model was made in Milkshape 3D, then I converted it to NWN model format. Its actually a 'creature type' model. I'm not quite sure how NWN weapons and items work. Feel free to add the geometry nodes to a player model if you like. It's just a spear, hope you like it. =)","Rating":7.25,"Votes":2,"Awards":[]},"104":{"Title":"Forgotten Realms Priests","Author":"Jon Matthews","Submitted":20020813,"Updated":20020813,"Category":"Armor","Model Format":"3DS","Description":"This is my first 'Priest Pack' of custom designed vestments for the various faiths in the Forgotten Realms. My inspiration came from the 'Forgotten Realms Adventures' rule book. I have included along with each priest, a magic weapon that you could use for a higher level cleric of that faith. I plan on releasing a second pack as soon as I finish it. I also plan some future releases of armor and outfits you can incorporate into your modules.","Rating":8,"Awards":[]},"105":{"Title":"Frost Worm","Author":"Firehazurd","Submitted":20020918,"Updated":20020919,"Category":"Monsters","Model Format":"MFX","Polycounts":"1700","Rating":7.5,"Votes":0,"Awards":[]},"107":{"Title":"Galeb Duhr","Author":"Artel S'riven","Submitted":20020821,"Updated":20020821,"Category":"Monsters","Model Format":"BioWare Standard","Polycounts":"1120","Description":"I have included both the .mdl and the .ms3d from Milkshape.","Rating":5,"Awards":[]},"108":{"Title":"Garland's Bastard Sword Pack","Author":"Garland Zeromus","Submitted":20031227,"Updated":20031227,"Category":"Weapon","Model Format":"BioWare Standard","Description":"Bunch of slightly high polycount bastard sword models. Models go in the override folder. Models were done by other people but resized and reskinned by me. Also, they were renamed to naming conventions proper to overriding bioware models in the official campaign. Check out the look of Aribeth in the prelude with one of these new swords... I think you'll like it.","Rating":9.67,"Votes":3,"Awards":[]},"109":{"Title":"Garland's Double Bladed Swords","Author":"Garland Zeromus","Submitted":20031025,"Updated":20031025,"Category":"Weapon","Model Format":"BioWare Standard","Description":"Big, nasty looking double bladed swords for use within the main game. They are modified versions of Zoome's valdris. Enjoy!","Rating":8.5,"Votes":0,"Awards":[]},"110":{"Title":"Garland's Scimitar Pack","Author":"GarlandZeromus&Zoome","Submitted":20031022,"Updated":20031022,"Category":"Weapon","Model Format":"BioWare Standard","Description":"I didn't like the scimitars included for my druid, so I changed (resized) Zoome's Dwarven worksword to go into the scimitar slots and gave em a couple new skins. These go into the override folder to play in the main game. These files don't change any aspect of damage or anything, they just look great.","Rating":9.17,"Votes":5,"Awards":[]},"111":{"Title":"Garland'sPackOfZoome'sGreatSwords","Author":"GarlandZeromus&Zoome","Submitted":20031019,"Updated":20031019,"Category":"Weapon","Model Format":"BioWare Standard","Description":"A bunch of High poly models. Could slow you down if you're on a slow CPU. Their almost all by Zoome, with the exception of a regular bioware one and a bioware one modified by me. These go into the override folder and replace all existing ones in the main game. I don't have SOU, so it's probably not compatible.","Rating":9,"Awards":[]},"112":{"Title":"Garlands Cool Short Sword","Author":"Garland Zeromus","Submitted":20031129,"Updated":20031129,"Category":"Weapon","Model Format":"BioWare Standard","Description":"Didn't make this, don't know who did... sorry for not crediting whoever did. I found it online and converted it over to NWN style. I think this is the coolest short sword available right now. have fun.","Rating":8.94,"Votes":4,"Awards":[]},"113":{"Title":"Gelatinous Cube","Author":"Galanon&Dhoom","Submitted":20020708,"Updated":20020319,"Category":"Monsters","Model Format":"Fan Skin","Description":"Gelatinous Cube... modeled by Galanon, skinned by me -- v1 of the skin. v2 will have Volume via multiple cubic meshes, and transparency.","Rating":3,"Awards":[]},"114":{"Title":"Giant Goblin","Author":"GarlandZeromus","Submitted":20031010,"Updated":20031010,"Category":"Monsters","Model Format":"BioWare Standard","Description":"I can't figure out the poly count, if anyone does - please post it.","Rating":6.38,"Votes":2,"Awards":[]},"115":{"Title":"Giant Lizard","Author":"DMcF","Submitted":20020813,"Updated":20020813,"Category":"Other","Model Format":"3DS","Description":"Here is a Giant Lizard model that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model.","Rating":6,"Awards":[]},"116":{"Title":"Giant Widow","Author":"Demona","Submitted":20020708,"Updated":20020322,"Category":"Monsters","Model Format":"Fan Skin","Description":"Copy of standard spider model with a new black widow skin. Large red hourglass on back.","Rating":6,"Awards":[]},"117":{"Title":"GiantSpider","Author":"BioWare","Submitted":20020708,"Updated":20020313,"Category":"Monsters","Model Format":"BioWare Standard","Description":"These giant arachnids are aggressive and terrifying versions of their much smaller cousins, and are capable of everything the smaller spider is. Giant spiders possess both strength and speed, delivering a lethal bite with its sharp mandibles that deliver a poison that can render even the strongest man immobile within seconds. Encountering one of these alien-looking creatures in a dank tomb or dark cavern is bad enough, but to be ambushed by a giant spider within its lair is far worse. Its huge webs are nearly as strong as iron and able to hold fast even man-sized prey for the spider to deal with at its leisure, and many spiders may even use their spinners to cast webbing at their opponents, immobilizing them where they stand. Many an adventurer has entered the lair of a giant spider, unaware...and never returned.","Rating":7,"Awards":[]},"118":{"Title":"Gith Heads","Author":"Coross","Submitted":20040703,"Updated":20040703,"Category":"PC Parts","Model Format":"BioWare Standard","Description":"Here is the revised pack of Gith heads. Ia added a hea with hair and a topknot, and touched up the textures and ears of the other two. Comments are welcome, as always, so tell me waht you think. If you want to use these models as part of a larger hakpack for your module, just tell me about it, and give me some credit. Have fun playing a Gith! -Coross","Rating":"N/A","Awards":[]},"119":{"Title":"Great Axe","Author":"Barks","Submitted":20020719,"Updated":20020719,"Category":"Weapon","Model Format":"3DS","Description":"If anyone has any comments, suggestions on what I should make next, or critizism, feel free to email me.","Rating":7,"Awards":[]},"120":{"Title":"Guard Shack","Author":"Ice-Child","Submitted":20020919,"Updated":20020921,"Category":"Buildings","Model Format":"Fan Skin","Description":"I saw something like this in the Bioware tilesets. But it doesnt have a working door. By the time I was done, I had completely reworked it. It will now have a working door. A placeable with a working door is different. I am going to uyse it as a guard shack in my mod. I will put it available as soon as I get it done. Heres a Pic of it in GMax.","Rating":9,"Awards":[]},"121":{"Title":"Guardian Sword","Author":"John Bruce","Submitted":20020708,"Updated":20020619,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"374","Rating":5,"Awards":[]},"122":{"Title":"Halberd","Author":"Barks","Submitted":20020708,"Updated":20020330,"Category":"Weapon","Model Format":"MFX","Description":"Yet another weapon. An upgraded version of the lesson halberd.","Rating":3,"Awards":[]},"123":{"Title":"Halfling with Animated Cloak","Author":"Nirijan","Submitted":20020708,"Updated":20020602,"Category":"NPC","Model Format":"BioWare Standard","Polycounts":"1480","Description":"He has a cloak, and it uses danglymeshes to animate! A must for all those cloak fanatics.","Rating":8,"Awards":[]},"124":{"Title":"Hands","Author":"KuraiRyu","Submitted":20040131,"Updated":20040217,"Category":"PC Parts","Model Format":"MDL","Description":"got sick of looking at the defalt bioware 'fists of doom' so here these are. hands with fingers for male and female, all species. females have modifyed bare feet with toes. updated again, glitches cused by extra nodes fixed, textures adjusted, weapon holding adjusted.","Rating":9.44,"Votes":43,"Awards":["Hall of Fame"]},"125":{"Title":"Helm Horror","Author":"BioWare","Submitted":20020708,"Updated":20020508,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Unnatural, relentless and immune to reason these constructs are more feared than a room of angry babies. Powered by magic, easy on carpets these unquestioning servants of evil are without thought and without mercy. Good for yard work and watching the kids.","Rating":7,"Awards":[]},"126":{"Title":"Hercules's Outfit","Author":"Davir","Submitted":20020722,"Updated":20020723,"Category":"Armor","Model Format":"BioWare Standard","Description":"can i say more","Rating":6,"Awards":[]},"127":{"Title":"Holy Avenger 2","Author":"Barks","Submitted":20020720,"Updated":20020721,"Category":"Weapon","Model Format":"3DS","Description":"I if anyone has an comments, suggestions on what I should build next, or critizism, feel free to email me.","Rating":8,"Awards":[]},"128":{"Title":"Horse Brown","Author":"Nirijan","Submitted":20020708,"Updated":20020515,"Category":"NPC","Model Format":"BioWare Standard","Polycounts":"1247","Description":"a previous game model of mine that I reformatted to fit in the NWN model viewer.","Rating":8.5,"Votes":0,"Awards":[]},"129":{"Title":"Horse","Author":"Belleal","Submitted":20040113,"Updated":20040113,"Category":"Monsters","Model Format":"MDL","Description":"I needed a Horse, so I made one. It's not bad model, I think.","Rating":"N/A","Awards":[]},"130":{"Title":"Huge bouncing breast","Author":"Herculo","Submitted":20040205,"Updated":20050427,"Category":"PC Parts","Model Format":"MDL","Description":"Huge bouncing breast for large phenotipe. Added new poligons to the original models. Unzip in Override folder to play these tits on all your Neverwinter adventures (also the main champaign). UPDATE: new cloths availables. All races supported.","Rating":6.95,"Votes":25,"Awards":[]},"131":{"Title":"Human Fighter-Thief","Author":"gridghost","Submitted":20020708,"Updated":20020320,"Category":"NPC","Model Format":"Fan Skin","Description":"New skin to the human model for the Bioware Modelviewer.","Rating":7,"Awards":[]},"132":{"Title":"Human Ranger","Author":"Nirijan","Submitted":20020708,"Updated":20020513,"Category":"Other","Model Format":"BioWare Standard","Polycounts":"1800","Description":"First model created for Neverwinter Nights, my page will be continually update with new models to view.","Rating":9,"Awards":[]},"133":{"Title":"Human_Light_Armor","Author":"gridghost","Submitted":20020708,"Updated":20020415,"Category":"NPC","Model Format":"Fan Skin","Description":"After seeing the mummy fammily I decided that it was perfect to take some of the parts and make humans with armor and extras from them.","Rating":6,"Awards":[]},"134":{"Title":"Human_Medium_Armor","Author":"gridghost","Submitted":20020708,"Updated":20020415,"Category":"NPC","Model Format":"Fan Skin","Description":"After playing around with the mummyfamily for a time I decided to make something out of them and here's the result.","Rating":8,"Awards":[]},"135":{"Title":"Human_Without_Weapon","Author":"gridghost","Submitted":20020708,"Updated":20020415,"Category":"NPC","Model Format":"Fan Skin","Description":"Another one of the 'Human_..' family that I'm making.","Rating":6,"Awards":[]},"136":{"Title":"Intellect Devourer","Author":"BioWare","Submitted":20020708,"Updated":20020529,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Despite being cuddly, they are difficult to have as house pets. They will definitely not play fetch or rescue little Timmy when he has fallen down the well. Furthermore, while regular pets show their dissatisfaction with loud yips or chewing on a favorite shoe, these frisky critters will shatter your meager mental defensives with their insidious psychic powers of enslavement; trapping you like a prisoner in your own body to scream in silent horror forever. Don't let the kids spray it with water guns.","Rating":8,"Awards":[]},"137":{"Title":"Iron Golem","Author":"BioWare","Submitted":20020708,"Updated":20020508,"Category":"Monsters","Model Format":"BioWare Standard","Description":"5000 pounds of hero-mashing metal that would make the wussy Tin Man and his heart problems go crying home to momma. Fearing only large fridge magnets or being left out in the rain these magically constructed automatons are nigh invulnerable to damage.","Rating":8,"Awards":[]},"138":{"Title":"Jade_NWN","Author":"Claude","Submitted":20040929,"Updated":20040929,"Category":"Armor","Model Format":"Fan Skin","Description":"This model is based on a drawing by Lorenzo found on a website on Heavy-Metal.","Rating":10,"Awards":[]},"139":{"Title":"Jaguar","Author":"BioWare","Submitted":20020708,"Updated":20020313,"Category":"Monsters","Model Format":"BioWare Standard","Description":"These large cats are the hunters of the mountains and the deep forest, distinguishable by the black rings and spots marking their yellow fur. Jaguars are muscular and lithe, able to produce short bursts of incredible speed before tearing into their prey with powerful claws and their strong bite. While jaguars do not normally attack humanoids, they might if cornered or hungry...and though a single one of these cats would be a difficult opponent, several of them hunting as a unit can be as fearsome as any dungeon monster.","Rating":8,"Awards":[]},"140":{"Title":"Japanese Model","Author":"ren4d","Submitted":20030506,"Updated":20030508,"Category":"NPC","Model Format":"3DS","Description":"1937 japan soldiers","Rating":4.33,"Votes":3,"Awards":[]},"141":{"Title":"Jeweled Katana","Author":"Barks","Submitted":20020708,"Updated":20020323,"Category":"Weapon","Model Format":"MFX","Description":"This is a weapon I made for a friend.","Rating":6,"Awards":[]},"142":{"Title":"Jiggly Torsos - Female Chest model w/ Aribeth Jiggles (tm) V1.1 - All Races","Author":"Zylch000","Submitted":20020717,"Updated":20020719,"Category":"Other","Description":"Use this hak pack in your modules to add the jiggly effect to female characters with no armor. V1.1 now includes torso replacement models for all 6 player races. To use these in the single player campaign, just use the nwhak.exe in the utils directory of your Neverwinter installation and 'export' all of the files to your override directory. To combine this or any hak pack with another, you just need to export all the files out of both hak packs to a directory and create a new hak pack with all the files included in it.","Rating":9.25,"Votes":3,"Awards":[]},"143":{"Title":"Katana","Author":"Fenmarel","Submitted":20020708,"Updated":20020404,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"115","Description":"Basic katana. I don't expect it to be useful once the game ships since Bioware already will have them. All the same I've made it available should anyone want a little variety. I'm guessing that it will need optimizing once compared to those that Bioware provide.","Rating":7,"Awards":[]},"144":{"Title":"Killer Door","Author":"Kinaar Greycloak","Submitted":20020708,"Updated":20020613,"Category":"Other","Model Format":"Fan Skin","Description":"Killer Door with custom ready, two attacks, walk and run animations. Inspired by Chris Priestly's heroic battle. Fear the door.","Rating":5,"Awards":[]},"145":{"Title":"Knight","Author":"gridghost","Submitted":20020708,"Updated":20020322,"Category":"NPC","Model Format":"Fan Skin","Description":"A little skin for the human model.","Rating":5,"Awards":[]},"146":{"Title":"Kobolds with modern firearms","Author":"Alexeyev Stanislav","Submitted":20040306,"Updated":20040306,"Category":"Other","Model Format":"Fan Skin","Polycounts":"Ve-e-ery MANY !","Description":"A combination of my own 3D, hacked NWN models and also hacked MaxPayne2 textures. This is a demo scene, and Ive got some problems with adding this charackters to NWN...In the ModelViewer and in NWN Toolset everything is OK, but not in the game.","Rating":10,"Awards":[]},"147":{"Title":"Kobold","Author":"Tom Scutt (using hacked Bioware models)","Submitted":20020714,"Updated":20020715,"Category":"Monsters","Model Format":"BioWare Standard","Polycounts":"700","Description":"Made by combining the Bioware Kobold and Goblin meshes by *hand-editing* ascii mdl files! The model uses the animations from GoblinA, so if you want to view it in the Bioware Model Viewer, you'll need to extract c_goblina.mdl from the NWN bif file and put it in the model viewer directory along with the files in this zip. To use it in the game at present is a tricky business. See snakeeyes excellent tutorial at: http://nwvault.ign.com/dm/modeling/tutorials/lllSnakeeyeslll/\nBlackBalorTutorial.shtml to see how to add new models.","Rating":8,"Awards":[]},"148":{"Title":"Kunai","Author":"Lennart D","Submitted":20041218,"Updated":20041218,"Category":"Weapon","Model Format":"Other","Polycounts":"1320","Description":"This is my first attempt at modeling a weapon. It's supposed to be a kunai, a (throwing) knife used by ninjas in stereotypical games, comics, and cartoons. I have no idea whatsoever on how to make it usable in NWN, so I guess that's up to one of you. ;) The format is .p3d","Rating":7.5,"Votes":0,"Awards":[]},"150":{"Title":"Lich","Author":"inselaffe","Submitted":20020708,"Updated":20020315,"Category":"Monsters","Model Format":"Fan Skin","Description":"Well detailed Undead Creature. Skin created by Colorsmith and model created by inselaffe","Rating":6,"Awards":[]},"151":{"Title":"Lion Head Sword","Author":"John Bruce","Submitted":20020708,"Updated":20020604,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"156","Description":"Chinese Martial Arts Weapon","Rating":5,"Awards":[]},"152":{"Title":"Longsword blade 1 replacement","Author":"Rogue_Wulf","Submitted":20031121,"Updated":20031125,"Category":"Weapon","Model Format":"BioWare Standard","Description":"a replacement for the longsword blade 1, only texture 1! I haven't textured it, if you want to, feel free. just put this mdl file in the ovveride folder in the NWN directory.","Rating":"N/A","Awards":[]},"153":{"Title":"Longsword","Author":"Barks","Submitted":20020715,"Updated":20020715,"Category":"Weapon","Model Format":"3DS","Description":"I made this in 2.5 hours. I basically just felt like building something, and this was the end result.","Rating":6.5,"Votes":0,"Awards":[]},"154":{"Title":"Low Res Desert and Winter TileSets","Author":"DarkSir","Submitted":20020708,"Updated":20020628,"Category":"Tileset","Description":"A lower resolution version of the Winter Tileset (LabTek, Xahlt, Kenbok, et al), as well as an early reproduction of the Desert Tileset (Kahlt, I think) - Just for those of us who don't want 50 meg tilesets, no matter how pretty they are. :)","Rating":7,"Awards":[]},"155":{"Title":"Luchador Masks","Author":"JustPlainJim","Submitted":20030822,"Updated":20030822,"Category":"Other","Model Format":"BioWare Standard","Description":"By request: Luchador (Mexican Wrestling) Masks. This isn't really a new model, it's a re-skin of the default male-human-normal head #50. The skin is terrible, and I made this just as a learning experience. A better version is on the way. Unzip to override folder, replaces head #25. The head changes color depending on the clothes/armor of the character.","Rating":7,"Awards":[]},"156":{"Title":"M3 - Black Dragun LCD","Author":"Brandon Naramore","Submitted":20020708,"Updated":20020616,"Category":"Weapon","Model Format":"Fan Skin","Description":"My Second Model I've made with OpenFX.","Rating":5,"Awards":[]},"157":{"Title":"MDL Weapon Archive","Author":"Felstorm","Submitted":20040112,"Updated":20040112,"Category":"Weapon","Model Format":"BioWare Standard","Description":"This is a sorted out and organised package of all the NWN bioware standard weapons model bits. Each is subdivided into seperate folders for top, bottom, middle, and effects groups. I got sick of hunting for the part I wanted to edit in 3DSMax, so I extracted all the *.mdls and compiled them into this Rar. Makes it much easier to make new stuff.","Rating":10,"Awards":[]},"158":{"Title":"Mace","Author":"Barks","Submitted":20020708,"Updated":20020323,"Category":"Weapon","Model Format":"MFX","Description":"I made this recently again out of primitives.","Rating":3,"Awards":[]},"159":{"Title":"Mahamoti","Author":"Djinn","Submitted":20020708,"Updated":20020517,"Category":"Other","Model Format":"3DS","Polycounts":"20.000","Description":"Another high policount model.This one has effects like lensflare (eyes) and blue fire. Djinns are one of my favorite cratures. by Djinn (nwnkingdom.com member staff).","Rating":9,"Awards":[]},"160":{"Title":"Marble/Ore/Signs Placeables","Author":"Dracop","Submitted":20020717,"Updated":20020717,"Category":"Other","Description":"Ok, basically this has several models and reskins: Marble Placeables Ore Textured PLaceables (good for mines) Signs on placeables (ie, a signpost with a mug of ale and a fish in the image that is a placeable) These are just examples and previews of what I am working towards creating; thought I would release them and see what people say. Just unzip and follow the directions ( I assume you know how to edit a .tlk file and how to reference a .2da file to find the .tlk values). Eventually I hope to use a simple exe file to unzip eveything to its correct spot.","Rating":8,"Awards":[]},"161":{"Title":"Master Sword from Zelda OoT","Author":"Cube","Submitted":20030928,"Updated":20030930,"Category":"Weapon","Model Format":"3DS","Polycounts":"263","Description":"OK, this is my first time making a model, so don't be too rude. It needs texturing, beacuse for some reason when I export it or save it as 3ds it losses the textures it had. Modelled in Rhinoceros 3, any feedback is welcome, if anyone wants to texture it, feel free to do it. Also, I still have the NURB model, if anyone wants it uploaded, feel free to ask and I'll upload it. P.S. I'm kinda new to this so I don't know if the polycount is too high, it can be reduced more, but I don't know how convenient it is. What's a good polycount?","Rating":8,"Awards":[]},"162":{"Title":"Mauser Rifle","Author":"Alexeyev Stanislav","Submitted":20040226,"Updated":20040226,"Category":"Weapon","Model Format":"MDL","Description":"Simple K98 rifle (from my WW2 mod)","Rating":"N/A","Awards":[]},"163":{"Title":"Mind Flayer","Author":"Polyhedral","Submitted":20020708,"Updated":20020315,"Category":"Monsters","Model Format":"Fan Skin","Description":"A very early experiment in modifying the mdl data. Has new animations including casting","Rating":2,"Awards":[]},"165":{"Title":"Minotaur","Author":"BioWare","Submitted":20021110,"Updated":20021110,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Package contains .max model file and .tga texture file for the Neverwinter Nights Minotaur creature.","Rating":8,"Awards":[]},"166":{"Title":"Misc. Forest Tiles","Author":"Haryon","Submitted":20050116,"Updated":20050116,"Category":"Tileset","Model Format":"MDL","Description":"Misc. tiles for the forest tileset (some requires Hills). - Tumulus entrance (underdark duergar building retextured and improved) - 3 Cave entrances retextured from Lodrezzon Grondol set (might come from Illmater Daggerdale, but not sure) No door included. No map icons. I'm no 3D artist, some sparks left, maybe some mistakes, and probably not that nicely drawn : feel free to improve. Tumulus entrance has a small Walkmesh problem that I fail to fix for now :( Includes a text file containing the [TILEnn] and [GROUPnn] for .set file.","Rating":"N/A","Awards":[]},"167":{"Title":"Monk","Author":"Colorsmith","Submitted":20020708,"Updated":20020323,"Category":"NPC","Model Format":"Fan Skin","Description":"A Monk with a quarterstaff. Thanks to Kinaar Greycloak for the help with the chest, back and the 9 attack animations.","Rating":6,"Awards":[]},"168":{"Title":"More Kids","Author":"Ice-Child","Submitted":20020919,"Updated":20020921,"Category":"NPC","Model Format":"Other","Description":"I have been asked again and again to make more kids. So I am working on eight of them in all. Here is a pic of six of them. Not done just yet. Let me finish up the two more girls and it will be ready. I have found that sometimes in the resize process they loose their animation. So I am working on that. When I get it done, I will post them here in the models directory for download.","Rating":8.25,"Votes":2,"Awards":[]},"169":{"Title":"Mountain Lion","Author":"Dalantriel","Submitted":20020708,"Updated":20020520,"Category":"Monsters","Model Format":"Fan Skin","Description":"You won't find this kitty nibbling on kibble. Fast and furious, these felines roam the wilder reaches of Faerun, stalking those cute fury little critters that didn't make it very far up the food chain. Although prized by many races for their luxurious pelts, the separation of the hide from the tooth and clawed regions can sometimes be tricky.","Rating":6,"Awards":[]},"170":{"Title":"Mummy Family","Author":"BioWare","Submitted":20020708,"Updated":20020410,"Category":"Monsters","Model Format":"BioWare Standard","Description":"They're old, they shamble, and need a bit of duct tape- they're Mummies. Ancient dead brought back to life to extract vengeance- or just out for a medicinal midnight stroll- they are most commonly found in abandoned temples and tombs lying in wait for the curious treasure hunter or inattentive adventurer. Mindless, merciless and poor dance partners the Mummy is a thing of dark, dusty places. There are four Mummies incl.: Common, Two Fighters, and a Priest","Rating":7,"Awards":[]},"171":{"Title":"Mummy","Author":"Colorsmith","Submitted":20020708,"Updated":20020321,"Category":"Monsters","Model Format":"Fan Skin","Description":"The original Mummy skin; shambling animations were set up by Inselaffe.","Rating":6,"Awards":[]},"172":{"Title":"Mummy","Author":"Inselaffe&Dhoom","Submitted":20020708,"Updated":20020319,"Category":"Monsters","Model Format":"Fan Skin","Description":"Inselaffe set up the model and excellent animimations, and I skinned the beast. Quite pleased with the results, and consider this my best skin job yet for the NWNViewer. Probably because I spent more than 15 minutes on it, unlike the others. ;>","Rating":7,"Awards":[]},"173":{"Title":"Musquet","Author":"Alexeyev Stanislav","Submitted":20040324,"Updated":20040324,"Category":"Weapon","Model Format":"MDL","Description":"Its a simple flintlock musquet (in Russia was called 'Fuzeja' or 'Rujio'). Estimate it's size !!! :)","Rating":"N/A","Awards":[]},"174":{"Title":"My PnP Stormbringer","Author":"Maj_Angel","Submitted":20031105,"Updated":20060411,"Category":"Weapon","Model Format":"MDL","Polycounts":"6,376","Description":"Ok finally! here is my 2nd attempt at this sword. This time it is how it should be except for the textures. For some reason I havn't learned that part yet. If anyone wants to texture it, feel free to do so, but it still looks good as is. Also this is my PnP holy avenger +6 greatsword. It is a relic. Although powerful for such a weapon, it is not 'Uber'. It was bestowed upon me while stuck in 'Ravenloft'.","Rating":9,"Awards":[]},"175":{"Title":"NWNDL Cabezas","Author":"Kurtulmak","Submitted":20031216,"Updated":20031216,"Category":"NPC","Model Format":"Other","Description":"Primero de todo, decir que yo no he hecho estas cabezas, agradecerselo a la comunidad del vault, pues es de aqui de donde las he ido sacando. (Gracias de mi parte a todos los autores) Rough Translation: First of all, to say that I have not done these heads, to thank it to him to the community of the vault, therefore is of aqui of where I have gone them removing. (Thanks of my part to all the authors)","Rating":6,"Awards":[]},"176":{"Title":"Nature Walker Scimitar","Author":"Iceman140","Submitted":20030205,"Updated":20030207,"Category":"Weapon","Model Format":"BioWare Standard","Rating":6,"Awards":[]},"178":{"Title":"Nimbus 2000 broom","Author":"Xenocy","Submitted":20030917,"Updated":20030917,"Category":"Item","Model Format":"MFX","Description":"I made this broom for the use in a server that i play alot. I only have one problem i can't get i converted into a hak pak. I have been looking for a way to do this for aproximitely 24 hours, and its driving me insane. If anyone can convert it into a hak pak, and send it to me.... you can figure the rest out.","Rating":8,"Awards":[]},"179":{"Title":"Nunchaku","Author":"Barks","Submitted":20020719,"Updated":20020720,"Category":"Weapon","Model Format":"3DS","Description":"If anyone has any comments, suggestions on what I should build next, or critizism, feel free to email me.","Rating":8,"Awards":[]},"180":{"Title":"Nunchuks","Author":"bobdamonkey","Submitted":20020708,"Updated":20020705,"Category":"Weapon","Model Format":"MFX","Polycounts":"2368","Description":"My very first 3D model, only a test really, so please hold back on the flames :)","Rating":7,"Awards":[]},"181":{"Title":"Old throne","Author":"LabelleRouge","Submitted":20021112,"Updated":20021212,"Category":"Placeables","Polycounts":"200","Description":"An old human throne V2.5... It made in wood with some runes. Some geometrics changes and adding the PWK and the ERF files AND the script to make PC siting on it. :)","Rating":8.67,"Votes":3,"Awards":[]},"182":{"Title":"Orc","Author":"Nirijan","Submitted":20020708,"Updated":20020531,"Category":"NPC","Model Format":"BioWare Standard","Polycounts":"1470","Description":"A warhammer/warcraft style orc.","Rating":9,"Awards":[]},"183":{"Title":"Override Heads Schattenwelt","Author":"A Lot of (only put together by Archangel_Luzifer)","Submitted":20041121,"Updated":20041121,"Category":"PC Parts","Model Format":"MDL","Rating":8,"Awards":[]},"184":{"Title":"Override Shields 3","Author":"Mintyx&Others","Submitted":20040309,"Updated":20040309,"Category":"Armor","Model Format":"MDL","Description":"This is an update of my previous collection, a much better, all rounder, this replaces all the large and tower shields in the game. Credits in Readme","Rating":"N/A","Awards":[]},"185":{"Title":"Override Shields 4","Author":"Mintyx&Others","Submitted":20040420,"Updated":20040420,"Category":"Armor","Model Format":"MDL","Description":"An updated version of my shield pack, mostly taken from Depheants Armoury 2 and the CEP. These shields will replace Bioware models and can be used in any online game.","Rating":9.31,"Votes":4,"Awards":[]},"186":{"Title":"OverrideArms+Shields","Author":"Mintyx&Others","Submitted":20040331,"Updated":20040331,"Category":"Weapon","Model Format":"MDL","Description":"A further collection of weapon and shield models taken from the CEP and SS Armoury. Primarily configured for the Shadowrealm PW. All hammer heads have been replaced and all large and tower shields. The shields enclosed are an updated version of my previous OverrideShields3, again, redone to better suit SRG. NOTE These files will replace current Bioware models and so can be used on any online game.","Rating":10,"Awards":[]},"187":{"Title":"OverrideCEPRobes","Author":"Mintyx&Others","Submitted":20040404,"Updated":20040404,"Category":"PC Parts","Model Format":"MDL","Description":"These are two of the excellent surcoats from the CEP (I think they're originally from the CODI robe pack) configured to work in the Override folder. NOTE These replace the monk robe and priest robe Bioware models. They can be used in any online game. Full credit to the original modellers, presumably CODI.","Rating":5.5,"Votes":0,"Awards":[]},"188":{"Title":"Pack de cabezas","Author":"Rage","Submitted":20040322,"Updated":20040701,"Category":"Other","Model Format":"MDL","Description":"En total son unas 1000 cabezas para elegir, tambi�n estan incluidas voces nuevas. Son m�s de 15 packs de cabezas que he ido recogiendo. Yo no soy el autor de las cabezas, solo las agrupo. Descomprimir en el directorio raiz del NwN, el solo ya se introducir� en el directorio override.","Rating":"N/A","Awards":[]},"189":{"Title":"Pack de t�tes Trya","Author":"Ayane","Submitted":20040827,"Updated":20040827,"Category":"PC Parts","Model Format":"Fan Skin","Description":"Pack de t�tes de Trya � mettre dans le dossier override, normalement dispo sur www.trya.net, mais vu que le site ne passe pas chez tout le monde ! Encore toutes mes excuses pour le desagr�ment.","Rating":"N/A","Awards":[]},"190":{"Title":"Penguin","Author":"BioWare","Submitted":20020708,"Updated":20020612,"Category":"Animation","Model Format":"BioWare Standard","Description":"The common penguin, or Vile Sea Panther, is forged by the merciless cold of the extreme north. These soulless birds are consumed with a frosty rage about looking pretty silly when they waddle around making that squeaky sound. The other birds laughed at them when they were younger, and often the penguin would stand on the corner watching all the other birds with working wings peel off in a stylish car with all the cutest she-birds and a bucket of fresh cod. Well the penguin is back... and the dead don?t laugh baby.","Rating":8,"Awards":[]},"191":{"Title":"Phase Spider","Author":"Dhoom","Submitted":20020708,"Updated":20020319,"Category":"Monsters","Model Format":"Fan Skin","Description":"Phase Spider -- if ya don't know what that is, go pick up the montrous manual and look. ;>","Rating":5,"Awards":[]},"192":{"Title":"Pink Troll","Author":"Assman","Submitted":20030925,"Updated":20030925,"Category":"Monsters","Model Format":"Fan Skin","Description":"Just put this little pink troll in your override directory and it should be alright.","Rating":6,"Awards":[]},"193":{"Title":"Pirate","Author":"Kinarr Greycloak","Submitted":20020708,"Updated":20020420,"Category":"NPC","Model Format":"Fan Skin","Description":"A pirate with wooden leg and a rapier. The chest and pants textures are copied/modified from Colorsmith.","Rating":5.5,"Votes":0,"Awards":[]},"194":{"Title":"Pixie","Author":"BioWare","Submitted":20020708,"Updated":20020328,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Pixie- Still recovering from the whole ?shake me for fairy dust? PR debacle with other unnamed Pixie representatives, Pixies are fighting for respect. Tiny, mischievous creatures of the deep forest flit and fly through the trees playing tricks on unwary travelers. Tastes like chicken.","Rating":8,"Awards":[]},"195":{"Title":"Placeable Housing","Author":"Ice-Child","Submitted":20020920,"Updated":20020921,"Category":"Placeables","Model Format":"Other","Description":"Placeable Housing. Well I can offer this. I pulled a one hex house out. Every peice of the tile that makes for a complete house. I can make it a placeable. But I cant get it to recognize the door mesh. So to use it you need to have the Custom Door hak installed. Other words you wont have a door on it. You can use that door and a OnUse script so that when the use it it teleports them to the interior of the house its for. WayPoints are a wonderful thing. I am posting a pic of three houses on a Toolset map. Just to show that it works. But I will keep working on the Doormesh so we can add working doors to them. Ill keep you all posted. And post it here as soon as I get it done. P.S.If anyone has an Idea that could save me time on the doormesh. Let me know. I just want to be able to add working doors to them is all.","Rating":9,"Awards":[]},"196":{"Title":"Pool Noodle Battle","Author":"Kinarr Greycloak","Submitted":20020708,"Updated":20020420,"Category":"Other","Model Format":"Fan Skin","Description":"A pool noodle battle between a barbarian and a bugbear. Started as an experiment and I decided to have fun with it.","Rating":4,"Awards":[]},"197":{"Title":"Prototype Dress","Author":"Vince","Submitted":20030429,"Updated":20030430,"Category":"NPC","Model Format":"BioWare Standard","Description":"After looking at the skinned monsters I tried to see how this could be applied to robes. Obviously this doesn't work for PC characters unless the PC model is replaced by an NPC model. Adding the mdl file to your override folder is the easiest way to give it a test run. The model replaces the human female model no. 9.","Rating":9,"Awards":[]},"198":{"Title":"PsySkies (Addon for NanoSkies)","Author":"Psyra Silverscale","Submitted":20040226,"Updated":20040302,"Category":"Other","Model Format":"Fan Skin","Description":"This is a padded add-on set of four skyboxes for Nanosphere's eight (well, currently eight as of the time I uploded these!) 'super awesome' Skyboxes! I've padded the skyboxes.2da file with 16 spots for any of Nanosphere's future additional skies. This adds Mountain Valley, Desert, Grasslands, and Ocean. ---- UPDATE 29-Feb-04: Padded 2DA for Bioware's future skies and added in entries for Nanosphere's NanoSkies III Pack. READ THE ENCLOSED README! *Especially* if you are using NanoSkies in your mod already and want to add these ones. ---- UPDATE 3-Mar-04: Fixed the 'deserttn_001.mdl' file typo. You should not have to rename this file manually now. ^_^","Rating":9.38,"Votes":4,"Awards":[]},"199":{"Title":"Purple Shield","Author":"Bob Da Monkey","Submitted":20020717,"Updated":20020717,"Category":"Armor","Description":"A simple reskin of one of the shields, and as opposed to overwriting an old shield it makes a completely new choice under the appearances tab. A bit pinker than I would have liked, but it still looks nice.","Rating":6,"Awards":[]},"200":{"Title":"Purple Worm","Author":"Firehazurd","Submitted":20020917,"Updated":20020917,"Category":"Monsters","Model Format":"MFX","Description":"This is a model for the purple worm 3rd edition d&d, it is just a model and I really want someone with the know how and the tools to take the model, skin it animate it and turn it into a usable creature. All I request is credit and dibbs on using it in a mod.","Rating":8,"Awards":[]},"201":{"Title":"Purple Wyrm","Author":"DMcF","Submitted":20020819,"Updated":20020819,"Category":"Other","Model Format":"3DS","Description":"Here is a Purple Wyrm that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model","Rating":1,"Awards":[]},"202":{"Title":"Reami Perduti Override Heads","Author":"Staff RP","Submitted":20050113,"Updated":20050113,"Category":"PC Parts","Model Format":"MDL","Description":"This is the pack containing a compilation of third part createad overriding heads needed to roll a new character on the Reami Perduti italian shard. Questo � il pacchetto di teste da inserire nella cartella override che serve per potere creare un nuovo personaggio sullo shard italiano Reami Perduti.","Rating":"N/A","Awards":[]},"203":{"Title":"Red bags Pack","Author":"NoHAZard","Submitted":20020708,"Updated":20020704,"Category":"Item","Description":"Tired of loosing your spoils of war? Tired of seing your players not notice the bag left by that dead spy? Paint it RED! Most bags and specially the bags that appear after death are now glowing red, you can't miss them even in full countryside!","Rating":6,"Awards":[]},"204":{"Title":"Redback Spider","Author":"Dalantriel","Submitted":20020708,"Updated":20020517,"Category":"Monsters","Model Format":"Fan Skin","Description":"Inspired by the infamous arachnid of my homeland, this one is well worth staying clear of. A well labeled predator that sends chills down anyone's spine. Aggressive and higly toxic. Don't touch!","Rating":6,"Awards":[]},"205":{"Title":"Repeating Crossbow (Cho-Ku-Nu)","Author":"Jupp","Submitted":20020708,"Updated":20020615,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"345","Description":"First sighted in the distant lands of Kara-Tur this truly exotic kind of crossbow can shoot 6 bolts in the same time when an ordinary crossbow shoots one arrow. Although it takes a special skill to handle this weapon one should not take this bow lightly. In the hand of a proven archer this bow can make a remarkable impact in a fight. P.s.: When viewing the model in the Model Viewer click on the bow and move the mouse up and down fast, then zoom in to the max. Then you can rotate it as you like. I dunno why it doesn't move correctly when zoomed out....","Rating":8.5,"Votes":0,"Awards":[]},"206":{"Title":"Robe update","Author":"Zarathustra217&Bioware","Submitted":20040418,"Updated":20040418,"Category":"Armor","Model Format":"MDL","Description":"Robe Update v1.0 by Zarathustra217 Use by adding files to the override folder of NwN or adding to a hak pak. If added in the overrride folder, it will work when playing online and OC as well. Original models by Bioware sligthly altered to make the robes appear more dress/woman/corset like and less hunchbacked ;) - Enjoy Zar.","Rating":9,"Awards":[]},"207":{"Title":"Robin Hood's Tunic","Author":"Davir","Submitted":20020722,"Updated":20020723,"Category":"Armor","Model Format":"Fan Skin","Description":"yes this is robin's tunic","Rating":4.5,"Votes":0,"Awards":[]},"208":{"Title":"Rogue Wulf's Model Pack","Author":"Rogue_Wulf","Submitted":20031121,"Updated":20031121,"Category":"Weapon","Model Format":"BioWare Standard","Description":"3 mdl's for your override folder :D Includes a readme. This is my second upload to date.","Rating":"N/A","Awards":[]},"209":{"Title":"Roman Pantheon","Author":"GrassMaster","Submitted":20040604,"Updated":20040604,"Category":"Buildings","Model Format":"Other","Polycounts":"1984","Description":"A model of the Pantheon in Rome. I used actual floor plans of the pantheon so it should very close to the real thing. Its in Gmax format so you will need to have that installed to view it. Feel free to use it for what ever you want.","Rating":10,"Awards":[]},"210":{"Title":"Roman Temple","Author":"GrassMaster","Submitted":20040413,"Updated":20040413,"Category":"Buildings","Model Format":"Other","Description":"I think neverwinter lacks roman/greekish architecture so as a small project I made a simple roman style temple. I tried to keep the polygon cound fairly low so I can work on importing it into nwn eventually. The file is in Gmax format so you need to get that to view it. Anways tell me what you guys think.","Rating":"N/A","Awards":[]},"211":{"Title":"Sahuagin (A.K.A. Sea-Devil)","Author":"Heed","Submitted":20020708,"Updated":20020419,"Category":"Monsters","Model Format":"BioWare Standard","Polycounts":"1246","Description":"This is a beta version-- there are some minor quirks (alignment issues) in the animation that need to be corrected. Also, the skin is not final as of now. Update : 4/14/2002 : slightly newer version replaced that fixes an alignment problem with the upper arms.","Rating":6.5,"Votes":0,"Awards":[]},"212":{"Title":"Samurai armor","Author":"Alpha Male","Submitted":20040103,"Updated":20040103,"Category":"Armor","Model Format":"DFX","Polycounts":"1250","Description":"Decided it was about time someone did a samurai armor model,Helmet texture needs more work,especially the face,but what the heck...would apreciate if anyone would would convert the textures to Plt and insert this into the game(if you do,please send me a non-hakpack version so i can drop it on the override folder,it should be in the Splint mail armor class.)....hope it does anyone any good.","Rating":8.21,"Votes":14,"Awards":[]},"213":{"Title":"Sapper's Shovel (�������� ������, � ������)","Author":"Alexeyev Stanislav","Submitted":20040320,"Updated":20040320,"Category":"Item","Model Format":"MDL","Description":"Usable Sapper's Shovel �� : � ������, �������� ������. ������� ������� �� ����� :). Copy to OVERRIDE and use like a one-hande axe (������, ���������� �����). ��, ����� ��������� ������ � ����� �� �����. 8)","Rating":"N/A","Awards":[]},"214":{"Title":"SciFi Energy Rifle","Author":"DeLay_LaMeR","Submitted":20040523,"Updated":20040527,"Category":"Weapon","Model Format":"3DS","Description":"This is my first attemp at modeling with 3ds Max. No textures or anything.","Rating":10,"Awards":[]},"215":{"Title":"Science Fiction Technologypac 1","Author":"SSJKamui","Submitted":20050312,"Updated":20050312,"Category":"Placeables","Model Format":"Other","Description":"Models from several Science Fiction Series like Babylon 5, Starblazers/Battleship Yamato, Raumpatroullie,Macross/Robotech, Battlestar Galactica, Mobile Suit Gundam, Lensman and other Sci Fi series. One ship ist the battleship of the villian of my fanfiction Star Trek Montgomery","Rating":"N/A","Awards":[]},"216":{"Title":"Science Fiction Technologypack2","Author":"SSJKamui","Submitted":20050323,"Updated":20050323,"Category":"Other","Model Format":"Other","Description":"The second model pack with new models from Science Fiction Stuff like Andromedar , Captain Harlock, Space Invaders, Starfox, Captain Future, Stargate and others.","Rating":"N/A","Awards":[]},"217":{"Title":"Scottish Claymore","Author":"Barks","Submitted":20020819,"Updated":20020820,"Category":"Weapon","Model Format":"3DS","Rating":8,"Awards":[]},"218":{"Title":"Scythe","Author":"Barks","Submitted":20020708,"Updated":20020330,"Category":"Weapon","Model Format":"MFX","Description":"I made this one night when I was bored.","Rating":6,"Awards":[]},"219":{"Title":"Seven Headed Hydra","Author":"Zonker","Submitted":20020921,"Updated":20020922,"Category":"Monsters","Model Format":"Fan Skin","Description":"This is a seven headed hydra using the greendragon supermodel as a base for its animation and texturing.","Rating":7,"Awards":[]},"220":{"Title":"Sharky the Shark","Author":"The Almighty Fish","Submitted":20030926,"Updated":20030926,"Category":"Monsters","Model Format":"MFX","Description":"This is the shark model that comes with OpenFX. Since there is no shark addition out right now, I figured someone might want to take it and animate it and make it into a nice creature.","Rating":5,"Awards":[]},"221":{"Title":"Shortsword","Author":"Barks","Submitted":20020718,"Updated":20020718,"Category":"Weapon","Model Format":"3DS","Description":"If anyone has any comments, suggestion on what I should build next, or critizism, feel free to email me.","Rating":8,"Awards":[]},"222":{"Title":"Skeleton Knight","Author":"gridghost","Submitted":20020708,"Updated":20020322,"Category":"Monsters","Model Format":"Fan Skin","Description":"After seeing the dhoom_mummy with it's fitting animations I thought that it would be right to reskin it in the fashion of a skeleton knight. Added a sword to it.","Rating":6,"Awards":[]},"223":{"Title":"Skeleton Warrior","Author":"gridghost","Submitted":20020708,"Updated":20020421,"Category":"NPC","Model Format":"Fan Skin","Description":"Just a reskin of one of the 'mummy' models","Rating":8,"Awards":[]},"224":{"Title":"Sleeping Drow Placeables","Author":"hmmm83","Submitted":20021116,"Updated":20021117,"Category":"Placeables","Model Format":"BioWare Standard","Description":"Here are three drow sleepers to add to the last package (Sleeping NPC Placeables). I discovered .dds, so the textures are a bit better. I included 2 scripts to make your NPC's go to bed at night and wake up in the morning. These are intended for use with the tileset beds. Salut","Rating":8.5,"Votes":0,"Awards":[]},"225":{"Title":"Sleeping NPC Placeables","Author":"hmmm83","Submitted":20021113,"Updated":20021113,"Category":"Placeables","Model Format":"BioWare Standard","Polycounts":"900","Description":"These are sleeping NPC models. There?s 8 models - male/female for black, white , dwarf , and kid. The polycounts are upto 900 each. If I figure out how to fix this, I'll update. Also included are extra textures (sleeping faces, etc.). If anyone can come up with better textures (esp. for black male/female), please comment. I added a .txt file with a placeables.2da line for each model, as well as Instructions.txt file explaining, in detail, how to combine these into an existing hakpaks, how to create a new hakpak, and scripts to make sleepers say 'zzzz' onUsed and disappear during the day. I did this so I could use all the beds in tileset. If you place these on placeable beds, don?t move them-just rotate. Enjoy! Suggestions are welcome - I only started Gmax 4 days ago. PS If anyone thinks they deserve credit for something I used or knows someone I should give credit to, can you please comment below? I used GMax, Gmax plug-in, NWNViewer, and many, tutorials.","Rating":9.83,"Votes":5,"Awards":[]},"226":{"Title":"Smoke Elemental Feline","Author":"Dhoom","Submitted":20020708,"Updated":20020319,"Category":"Monsters","Model Format":"Fan Skin","Description":"Cat manifestation of an Elemental from the plane of Smoke.","Rating":6,"Awards":[]},"228":{"Title":"Sorceress","Author":"Kinarr Greycloak","Submitted":20020708,"Updated":20020420,"Category":"NPC","Model Format":"Fan Skin","Description":"A sorceress showing some special effects through the particle emitters.","Rating":3,"Awards":[]},"229":{"Title":"Soul Reaver Greatsword","Author":"Zoome","Submitted":20030909,"Updated":20030909,"Category":"Weapon","Model Format":"BioWare Standard","Description":"this is the Soul Reaver from the game Soul Reaver, be sure to use one of the gswords*.hak since the sword uses the #18 or else it wont show up.","Rating":9.75,"Votes":4,"Awards":[]},"230":{"Title":"Sparkle Star Magic Wand","Author":"John Bruce","Submitted":20020708,"Updated":20020604,"Category":"Item","Model Format":"BioWare Standard","Polycounts":"102","Description":"Has particle effect","Rating":4,"Awards":[]},"231":{"Title":"Spell Effect 10","Author":"BioWare","Submitted":20020708,"Updated":20020619,"Category":"Monsters","Model Format":"BioWare Standard","Description":"What you're going to see when you are *finally* granted super-powers from an advanced alien race. This spell effect would be used in combination with other spell effects to create a full spell.","Rating":6,"Awards":[]},"232":{"Title":"Spell Effect 3","Author":"BioWare","Submitted":20020708,"Updated":20020424,"Category":"Animation","Model Format":"BioWare Standard","Description":"A big brick of glowylicious Uranium. Spell effects are combined to make a complete spell such as 'Big Brick of Uranium Upside Yo' Head' ...which will not be appearing in NWN.","Rating":8,"Awards":[]},"233":{"Title":"Spell Effect 4","Author":"BioWare","Submitted":20020708,"Updated":20020508,"Category":"Monsters","Model Format":"BioWare Standard","Description":"The unknowable horror of nuclear fallout never looked so gosh-darn pretty. This spell effect would be used in combination with other spell effects to create a full spell.","Rating":7,"Awards":[]},"234":{"Title":"Spell Effect 7","Author":"BioWare","Submitted":20020708,"Updated":20020612,"Category":"Animation","Model Format":"BioWare Standard","Description":"Did you ever want to make the perfect snowball that would, when it shattered against the head of your hated enemy, would cause them to burst into tears, which would then freeze to their cheeks requiring hospitalization and a stern talking-to by their mom? Well here it is.","Rating":6,"Awards":[]},"235":{"Title":"Spell Effect 8","Author":"BioWare","Submitted":20020708,"Updated":20020612,"Category":"Animation","Model Format":"BioWare Standard","Description":"You can simulate this spell effect at home by staying up until 3:30am eating hot peppers, gravy and Cheetos and then having a good friend throw open the curtains and expose you to direct sunlight. You should see this after regaining consciousness.","Rating":5,"Awards":[]},"236":{"Title":"Spell Effect 9","Author":"BioWare","Submitted":20020708,"Updated":20020612,"Category":"Animation","Model Format":"BioWare Standard","Description":"Disco of the Damned.","Rating":6,"Awards":[]},"237":{"Title":"Spell Effect II","Author":"BioWare","Submitted":20020708,"Updated":20020410,"Category":"Animation","Model Format":"BioWare Standard","Description":"Spell Effect II- Smoke/Steam/A Cartoon Getting Angry. The spell effects are components for the spells within NWN. This is a component that can be combined with other components to make the visuals for a specific spell.","Rating":5,"Awards":[]},"238":{"Title":"Spell Effect VI","Author":"BioWare","Submitted":20020708,"Updated":20020529,"Category":"Animation","Model Format":"BioWare Standard","Description":"Visual simulation of what a football player sees after enduring a 'highlight reel' tackle? Perhaps. Something you want to see outside your bedroom window late at night? Definitely not! This spell effect would be used in combination with other spell effects to create a full spell.","Rating":7,"Awards":[]},"239":{"Title":"Spell Effect V","Author":"BioWare","Submitted":20020708,"Updated":20020529,"Category":"Animation","Model Format":"BioWare Standard","Description":"Glow-O-Rama(tm) fireworks out of control! This spell effect would be used in combination with other spell effects to create a full spell.","Rating":7,"Awards":[]},"240":{"Title":"Spell Effects 1","Author":"BioWare","Submitted":20020708,"Updated":20020327,"Category":"Animation","Model Format":"BioWare Standard","Description":"This is a particular spell effect component and not a particular spell. In Neverwinter Nights we have over 200 spells and each spell will be represented with a specific combination of several of these spell effects mixed together for one heart-stopping fiesta of animated magic that would even make the mighty Elminster screech like an enraged howler monkey.","Rating":6,"Awards":[]},"241":{"Title":"Staff Mace","Author":"John Bruce","Submitted":20020708,"Updated":20020605,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"480","Description":"Would you believe most of the polys are in the spikes....8 each spike.","Rating":5,"Awards":[]},"242":{"Title":"Staff","Author":"Barks","Submitted":20020719,"Updated":20020719,"Category":"Weapon","Model Format":"3DS","Description":"If anyone has any comments, suggestions, or critizism, feel free to drop me and email.","Rating":6,"Awards":[]},"243":{"Title":"Star Magic Wand","Author":"John Bruce","Submitted":20020708,"Updated":20020603,"Category":"Item","Model Format":"BioWare Standard","Polycounts":"102","Rating":3,"Awards":[]},"244":{"Title":"Stone Beetle","Author":"Methcalcior","Submitted":20020708,"Updated":20020501,"Category":"Monsters","Model Format":"Fan Skin","Description":"Beetle with a stony exoskeleton and a bad disposition.","Rating":5,"Awards":[]},"245":{"Title":"Strider","Author":"DMcF","Submitted":20020812,"Updated":20020813,"Category":"Monsters","Model Format":"3DS","Description":"Here is a Strider model that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model.","Rating":2,"Awards":[]},"247":{"Title":"Swamp Fiend","Author":"DMcF","Submitted":20020819,"Updated":20020819,"Category":"Other","Model Format":"3DS","Description":"Here is a Swamp Fiend that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model","Rating":6,"Awards":[]},"248":{"Title":"Sword Of Wrath","Author":"Barks","Submitted":20020708,"Updated":20020518,"Category":"Weapon","Model Format":"MFX","Polycounts":"2375","Description":"I made this for the Beta contest. I spent about 3 days working on it. It was made almost entirely of primitives and bezier curves.","Rating":4,"Awards":[]},"249":{"Title":"Sword and Trident","Author":"Trix","Submitted":20030316,"Updated":20030317,"Category":"Weapon","Model Format":"Other","Description":"These are two models I created in bryce... *sigh* I wish I cud export in 3ds format but oh well. Both are under 200 polys. These are the obp bryce object files. I know they aren't really useful but I just wanted to know if I should recreate 'em using 3ds. Like em? let me know. See larger pic for Trident.","Rating":8,"Awards":[]},"250":{"Title":"Sword of Darkness 1/2","Author":"zoome","Submitted":20030809,"Updated":20030810,"Category":"Weapon","Model Format":"BioWare Standard","Description":"Theesa are the Sword Of Darkness 1 & 2. Be sure to use one of the gswords.hak files in your model or else you wont se the swords cause they use the #12&13","Rating":9,"Awards":[]},"251":{"Title":"Swordchucks","Author":"Sarev0k","Submitted":20020708,"Updated":20020521,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"634","Description":"Crafted by a master of the martial arts, this weapon was originally created to be a more lethal version of the historical nun chuck. As time passed it became apparent that one blade limited the once beneficial ability to wield it by either handle, so to compensate this a second blade was added. Although more demanding of respect from its wielder, in the proper hands, this weapon is a most lethal tool that often foes do not fully realize until it is too late.","Rating":9.33,"Votes":3,"Awards":[]},"252":{"Title":"Sword","Author":"Adalorn","Submitted":20020708,"Updated":20020321,"Category":"Other","Model Format":"Fan Skin","Description":"An animated sword","Rating":3,"Awards":[]},"253":{"Title":"Tauranik, Lord of Battle","Author":"Dekar Gates","Submitted":20020708,"Updated":20020515,"Category":"NPC","Model Format":"Fan Skin","Description":"Tauranik, Lord of Battle, is a god of the Draconian pantheon. Learn more at Project: Draconia's website.","Rating":9,"Awards":[]},"254":{"Title":"Texture Fix for Bioware Bebilith Model","Author":"Bioware (Fix by BigfootNZ)","Submitted":20040128,"Updated":20040128,"Category":"Monsters","Model Format":"MDL","Description":"A Small fix to remedy a texture problem that I noticed with the Original HotU Bebilith model by Bioware. The Bebilith was tinted black, which was caused by the ambient and diffuse settings within the model not being set to full white. This .mdl file fixs that problem and makes the Bebilith look as it should look, or at least I assume it should look. Place the .mdl file into your override directory to get it to show up, no 2da changes needed. I didnt include it as a hak since it doesnt realy warrent as a hak. Nothing special just a glitch i saw and decided to rectify :P","Rating":10,"Awards":[]},"255":{"Title":"Thanoptryx","Author":"Arenus_Obscurus","Submitted":20040130,"Updated":20040203,"Category":"Other","Model Format":"Other","Description":"This is my model of a walk bird I call the thanoptryx, It is based on Hydromancer x's model of a Diamytra and I would like it if someone would make a hak of this one and perhaps ad a version whit a rider. the model is in gmax format.Feel free to use it as you wish.... I have now provided a picture of this big blue carnivoric bird.","Rating":"N/A","Awards":[]},"256":{"Title":"The Black Sword","Author":"HariSeldon","Submitted":20040216,"Updated":20040216,"Category":"Weapon","Model Format":"MDL","Polycounts":"1635","Description":"This is the Black Sword, AKA the Shade Blade from Ultima VII & the Serpent Isle. A work in progress with textures needing to be optimized and edited, so please let me know how/if it works for you and any suggestions you may have for improvements towards it. This is my first NWN model so please treat it and any comments or suggestions you have accordingly. Also, the contents of this file need to be placed into the override directory at the moment. Thank you.","Rating":9,"Awards":[]},"257":{"Title":"The Silver Shaver","Author":"B.B. Roth","Submitted":20020708,"Updated":20020612,"Category":"Weapon","Model Format":"DFX","Description":"Used by the drunken dwarf Oxwane to shave the beard hair off a sleeping cave giant. A quest given to Oxwan by a passing elf mage in exchange for a barrel of fire wine. The sharpeness of the blade and Oxwane's drunken state left the giant missing more than a beard.","Rating":10,"Awards":[]},"258":{"Title":"The Tangled Trees Head Pack Version 2","Author":"Trickster","Submitted":20031008,"Updated":20040401,"Category":"Other","Model Format":"BioWare Standard","Description":"I did NOT Make these head the credit goes to Iron Spider for Warcraft Elf Heads (I used the replacing version with the two new heads from the non-replacing version), and X-Head pack, collected by Spurn. Remember to back up your Override Directories, as this is where the heads are extracted too. ***UPDATE!!Added some more appropriate d20 Modern Heads and a few new oriental ones. Enjoy!!***","Rating":9,"Awards":[]},"259":{"Title":"The Unicorn Blades","Author":"B.B.Roth","Submitted":20020708,"Updated":20020615,"Category":"Weapon","Model Format":"DFX","Description":"The dueling daggers used by Smynx the eleven fighter to win the 'Giants Chalice.'","Rating":6,"Awards":[]},"260":{"Title":"Throwing Knife","Author":"John Bruce","Submitted":20020708,"Updated":20020603,"Category":"Weapon","Model Format":"BioWare Standard","Polycounts":"204","Description":"Throwing Knife","Rating":7,"Awards":[]},"261":{"Title":"Tiamat, the true Chromatic Dragon","Author":"Zonker","Submitted":20021019,"Updated":20021019,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Here she is guys, the beautiful and terrible godess Tiamat the chromatic dragon.","Rating":8,"Awards":[]},"262":{"Title":"Topless Jiggly Girl HakPak","Author":"Aridale Belmont","Submitted":20020718,"Updated":20020720,"Category":"Animation","Description":"This is the jiggly bits model and the topless skin combined into 1 hakpak I saw a request for it on the jiggly chest comments so I thought Id put the two together real fast. UPDATED - 7/20/02 to v1.1 see the read me included in the zip. Support of all races now avail.","Rating":8.83,"Votes":3,"Awards":[]},"263":{"Title":"Transport Building","Author":"John Bruce","Submitted":20020708,"Updated":20020618,"Category":"Buildings","Model Format":"BioWare Standard","Polycounts":"252","Description":"I want to put a tranport beam at the bottom and use it to lead in to an interior crypt.","Rating":5,"Awards":[]},"264":{"Title":"Treant v1.1","Author":"Ice-Child","Submitted":20020923,"Updated":20020929,"Category":"Monsters","Description":"I had to make one for our Module. I start with the Troll supermodel and ended up with this. It isnt a bad reproduction of a Treant. We liked it enough that I got it first try. didnt have to do any retakes with textures or modeling. Now on to my next project. Thought Eater and an Osquip. I should be able to post this tonight. Am just making some fine adjustments to textures and a little on the animations. Will be ready by tomorrow at the latest.","Rating":8.5,"Votes":0,"Awards":[]},"265":{"Title":"Treasure Chest with Lock and Key","Author":"Barks","Submitted":20020708,"Updated":20020326,"Category":"Other","Model Format":"MFX","Description":"This was made using bezier curves and the extrude tool.","Rating":4.5,"Votes":0,"Awards":[]},"266":{"Title":"Tree City tileset","Author":"geekgirljess","Submitted":20020708,"Updated":20020629,"Category":"Tileset","Description":"The 'Tree City' hakpack is a reskin of the Forest tileset which replaces the forest floor texture with a wooden plank texture, allowing platforms to be made. It also reskins the most of the buildings to use a wooden plank texture. But best of all, it replaces the 2x2 Camp 1 group with the 2x2 Giant Tree group from the City Exterior tileset! W00T! :)","Rating":7,"Awards":[]},"267":{"Title":"Trog","Author":"DMcF","Submitted":20020827,"Updated":20020828,"Category":"Other","Model Format":"3DS","Description":"Here is a Trog that needs skins and animations. It is in 3DS and mdl format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model.","Rating":5,"Awards":[]},"268":{"Title":"Troll","Author":"BioWare","Submitted":20020708,"Updated":20020619,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Famous for being outsmarted by goats while living under a bridge, the common troll is the only creature in the Forgotten Realms made entirely of phlegm. Possessing amazing regenerative powers, Troll skin is covered in many blister-like, goo-filled pustules, serving as a shambling reminder why High School wasn?t all that fun. In combat Trolls are wildly unpredictable, fearless, primal and utterly ruthless much like circus clowns..","Rating":6,"Awards":[]},"269":{"Title":"Twig Blight","Author":"Erendril","Submitted":20020822,"Updated":20020822,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Twig blight for The Sunless Citadel. Also posting a dire rat model as well.","Rating":8.17,"Votes":3,"Awards":[]},"270":{"Title":"Two headed dragons","Author":"Zonker","Submitted":20020926,"Updated":20020927,"Category":"Monsters","Model Format":"BioWare Standard","Description":"This is a trio of models. 2 multi-headed dragons along with an experiment (that turned out ok so ill release it as well) of a man riding the deer model :) Inspired by the goblin grog rider. I also put a shot of tiamat in the screenshot. She is not in the zip file though since i'm still working on it. Enjoy, Z","Rating":8.88,"Votes":2,"Awards":[]},"271":{"Title":"UAZ - 469 russian army jeep","Author":"Alexeyev Stanislav","Submitted":20040308,"Updated":20040308,"Category":"NPC","Model Format":"MDL","Polycounts":"~1400","Description":"Its russian UAZ 469 for my mod. Unzip the archive into OVERRIDE folder, and then use. The models's name in the NWN Editor will be 'Arching target'.","Rating":8.75,"Votes":9,"Awards":[]},"272":{"Title":"Umberhulk","Author":"BioWare","Submitted":20020708,"Updated":20020619,"Category":"Monsters","Model Format":"BioWare Standard","Description":"They are the sort of thing that young Timmy thinks hides under his bed waiting for him to go to the bathroom in the middle of the night where he will then be horribly consumed before he can say 'Mom. Dad. I told you there was a giant insect living under my bed, but you never listened. In fact, I think you thought this was kind of cute. Now look what has happened. You will have to pay Ted, the cleaning guy, to come in again because you didn?t believe little Johnny either when he said he had some sort of rubbery, flesh-eating ooze living in his closet.'","Rating":9,"Awards":[]},"273":{"Title":"Underdark Placeables","Author":"MrTootles","Submitted":20020713,"Updated":20020724,"Category":"Other","Model Format":"Other","Description":"This includes the mushrooms and stalagmites available in the Mines and Caverns tileset as placeables, as well as a custom giant mushroom. Update: You can no longer walk through the stalagmites.","Rating":9,"Awards":[]},"274":{"Title":"Valdris Shortsword","Author":"Zoome","Submitted":20030827,"Updated":20030829,"Category":"Weapon","Model Format":"BioWare Standard","Description":"This is the Valdris shortsword, looks really cool","Rating":8.88,"Votes":2,"Awards":[]},"275":{"Title":"Vampire Bugbear","Author":"Trash","Submitted":20021019,"Updated":20021021,"Category":"Monsters","Polycounts":"740","Description":"This is my first Hak pak. Its a modification of the original Bugbeara in the game, making it look like a vampire bugbear. There is no modified 2da file because with this Hak you substituite the original, therefore no ERF file is needed either. If you intend on using the model, or simply want to contact me please email me at: trash69@uol.com.br. Hope you like it. -Trash","Rating":7.25,"Votes":2,"Awards":[]},"276":{"Title":"Various Bows&Crossbows","Author":"Avenger","Submitted":20030703,"Updated":20030703,"Category":"Weapon","Model Format":"Other","Description":"Originally modeled for rendreing, but i thought they might be intresting...","Rating":3,"Awards":[]},"277":{"Title":"Vehicle","Author":"-[WolF]-Nemo","Submitted":20020708,"Updated":20020619,"Category":"Other","Model Format":"Fan Skin","Description":"Hey, why not? Somebody has to have a vehicle. Why not ride in style.","Rating":8.33,"Votes":3,"Awards":[]},"278":{"Title":"Venus Mantrap","Author":"DMcF","Submitted":20020818,"Updated":20020818,"Category":"Other","Model Format":"3DS","Description":"Here is a Venus Mantrap model that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model.","Rating":5,"Awards":[]},"279":{"Title":"Wall Crack Model/Texture","Author":"JemyM","Submitted":20020919,"Updated":20020920,"Category":"Placeables","Model Format":"BioWare Standard","Description":"I made this for the Eye of the Beholder II project ( http://eotb2.no-ip.com ). The purpose of this simple model is to show how to change the appearence of a wall, without using a tileset, or an advanced model. When placing this placeable in front of a wall, it will look like there is a 'crack' in the wall. The idea is to make the 'crack' placeable attackable. When it is destroyed, script it to create Crack2 in the same spot. Crack2 is an 'opening' that will bring a character to the other side when clicked. This will look like someone bashing down the wall to get to the other side. You can repaint the texture to create other large wall features, like a painting, or a curtain. Only your imagination and photoshop skill will limit you. This model will not replace any existing models from bioware.","Rating":6.88,"Votes":10,"Awards":[]},"280":{"Title":"Warrior","Author":"Whalebones-Othar","Submitted":20020708,"Updated":20020315,"Category":"NPC","Model Format":"Fan Skin","Description":"Well detailed Human fighter","Rating":6,"Awards":[]},"281":{"Title":"Water trough","Author":"hmmm83","Submitted":20021215,"Updated":20021217,"Category":"Placeables","Model Format":"BioWare Standard","Description":"Here's a water trough with some water in it. Now your cows won't sound stupid slurping empty troughs.","Rating":7,"Awards":[]},"282":{"Title":"Weapons","Author":"Alpha Male","Submitted":20030425,"Updated":20030428,"Category":"Weapon","Model Format":"Other","Description":"Just decided to post some of the stuff ive been making inthis last week,since adquiring 3d Studio Max.I am barely getting by with modelling and tottally suck at texturing so if someone would like to give me a hand you�re welcome...then maybe i can put these into a hak.file for everyone out there!*s*","Rating":9,"Awards":[]},"283":{"Title":"Well Endowed Human Female (All base armors)","Author":"Allarian","Submitted":20040406,"Updated":20040406,"Category":"PC Parts","Model Format":"Other","Description":"This is Furball's Chest model with some adjustments. I removed the inherent colors in the model and and adjusted the model properties for better alignment with the base models. I also adjusted the Jiggliness to be more accurate. (I.E. No jiggles on plate armor and more accurate amounts of jiggle for all armors.) Just unzip into your override directory and have fun. Thanks to Furball for the awesome model. You Rock!!!","Rating":"N/A","Awards":[]},"284":{"Title":"Well built woman","Author":"-=']['igers@n=-","Submitted":20021231,"Updated":20030102,"Category":"Other","Model Format":"3DS","Description":"I've made little bigger female mode, but i don't know how to animate, skin it, put it in NWN... Help me please, can someone do it How can i skin my model... e-mail me...","Rating":6,"Awards":[]},"285":{"Title":"Well-endowed Human Female","Author":"Furball","Submitted":20030518,"Updated":20030520,"Category":"Other","Model Format":"Other","Polycounts":"696","Description":"Hi, this is a model that replaces the human female chest model when she is not wearing any equipment such as armor or clothing. If you're wondering what happens when she puts on armor, have you ever tried finding a bra that large, despite any armor!? 0_o Personal commentary: I didn't spend an extraordinary amount of time on this, for hopefully obvious reasons. However, it does look good. There is a discrepency with the texture because I didn't have the original textures to align the uvw map to. If you have a sample of the original textures, I can fix this if I can get my hands on it. The polycount is a little higher than the original chest, so you may notice a slight difference, even though I didn't. Have fun :P","Rating":8.83,"Votes":5,"Awards":[]},"286":{"Title":"White Lion","Author":"NinthLetter","Submitted":20020708,"Updated":20020321,"Category":"Monsters","Model Format":"Fan Skin","Description":"This is my first attempt so the name is a bit off. You can change it if you like.","Rating":6,"Awards":[]},"287":{"Title":"Wight","Author":"BioWare","Submitted":20020708,"Updated":20020529,"Category":"Monsters","Model Format":"BioWare Standard","Description":"The tragic result of excessive use of hair care products and a number of unnecessary face-lifts, these creatures inhabit places that are infused with death and desperation like underground catacombs, dusty burial mounds and public washrooms. Much like boy bands, Wights are invulnerable to mind-influencing effects and can create more undead simply through infecting those unfortunate enough to succumb to their evil.","Rating":5,"Awards":[]},"288":{"Title":"Winged Base PC Models","Author":"DantePN","Submitted":20021210,"Updated":20021211,"Category":"Other","Model Format":"BioWare Standard","Description":"With help of the wing models posted months back, I added them to the base a_ba models and gave them animation. By adding wings to NPC that use the a_ba models as supers or adding them to PC chest models and then using these models as the supers, you can spawn NPCs/mobs with animated angels wings. Demon wings could be animated in a similar fashion (should the wings be modelled properly). NOTE - The wings used on these 4 base models are HIGH polycount (10k). They are not might. I have no clue how to model well ;)","Rating":6,"Awards":[]},"289":{"Title":"Wings/Tails by SecUnder (including Saja's Dragonwings)","Author":"SecUnder","Submitted":20031227,"Updated":20040704,"Category":"Other","Model Format":"MDL","Description":"This is more than just wings and tails. Through simple exploration, I found that you can put any type of model in the wing/tail slots on npcs/pcs. This includes visual effects among other things. The beauty of this is some modelers out there can use this slot to make cloaks, backpacks and such. Its basically a new slot for pc/npc development and customization. This package contains: All Dragon wings (Saja's hak), black angel wings, Mephistophele's wings, gargoyle wings, and around 60 different model/visual effects to use in wings/tail slot. To install just extract to your override folder, I don't like haks so I left it in override format. There are 3 2das included, wingmodel, tailmodel, and appearance. Appearance.2da is included to change the size of wings to a little larger. There is also a few extra monster appearances added to the 2da, including the rakshasa bear and wolf females. Thanks to Saja for the wonderful dragonwings hak and for help when I got confused with textures lol.","Rating":9,"Awards":[]},"290":{"Title":"Winter Pine Tree","Author":"Tovrin","Submitted":20021024,"Updated":20021025,"Category":"Placeables","Model Format":"Fan Skin","Description":"A simple reskin of the Pine Tree featured in the tutorial by scooterpb","Rating":9,"Awards":[]},"291":{"Title":"Winter Tileset","Author":"Labtek","Submitted":20020708,"Updated":20020630,"Category":"Tileset","Description":"Winter Tileset v0.6 (6.7 Megs) Neverwinter Nights Hak Pak This Hak Pak adds a winter tileset to Neverwinter Nights. To use it first place a copy in the HAK directory in your NWN folder. Create a new module (or open an existing one) select Edit - Module Properties from the drop down menus. Select the Advanced Tab. Select the winter Hak Pak from the Hak Pak drop down list. Add a new area using the Area wizard. You will now see the 'snowy' tileset. Contributors: Laktek: Hak Pak creator and tile set duplicator. Loremaster Q (aka Kenbok): Re-textured TGA files. Xahlt: A mod to replace water with ice. Version History v0.0: Original 3 retextured TGAs by Labtek v0.1: Everwinter retextured TGAs by Kenbok v0.2: Placed in Hak Pak. Added ice mod by Xahlt v0.3: Removed Grass v0.4: Added repeating edge effects v0.5: Retextured the Mini-Map. v0.6: Reduced the TGAs to match those in the release version.","Rating":9,"Awards":[]},"292":{"Title":"Wolf Grey","Author":"Nirijan","Submitted":20020708,"Updated":20020515,"Category":"NPC","Model Format":"BioWare Standard","Polycounts":"1097","Description":"A model I've had sitting around collecting dust, thought I would format it to fit the NWN viewer.","Rating":8.25,"Votes":2,"Awards":[]},"293":{"Title":"Wyvern","Author":"DMcF","Submitted":20020821,"Updated":20020821,"Category":"Other","Model Format":"3DS","Description":"Here is a Wyvern that needs skins and animations. It is in 3DS format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model","Rating":6,"Awards":[]},"294":{"Title":"XE-Ryder KoJ's Female Half-Orc Head w/added pony tail","Author":"XE-Ryder KoJ","Submitted":20040924,"Updated":20051231,"Category":"PC Parts","Model Format":"BioWare Standard","Polycounts":"126","Description":"This is a Female Half-Orc Head that replaces the Bioware standard head file pfo0_head010. I made this for one of our players who noted there wasn't much offered to this race in the way of custom heads. What is different? Long Pony tail has been added, it was extended back far enough to not hit the backplate, and doesn't seem to behave odd in animations like laughing etc. Perhaps you can use it too. If you want to add it as an additional head, just renumber the file references to a higher number, but leave the texture reference the same or it won't be texed in game. (Updated 12-31-05)","Rating":"N/A","Awards":[]},"295":{"Title":"XE-Ryder KoJ's Rural 4 Stone Menhir","Author":"XE-Ryder KoJ","Submitted":20040927,"Updated":20051231,"Category":"Tileset","Model Format":"BioWare Standard","Polycounts":"507","Description":"I am offering this Replacing 4 Stone Menhir for the Rural tileset to any who may wish to use it. In my PW we use an advanced porting system and this tile suited our needs better. I thought perhaps others might like to have it as well. I will be offering this tile for the Desert tileset as well, as an addon feature, with some other goodies I am working on. Simply include the two zipped files in your hakpack and you will have a different Menhir in your rural tileset. Since it is a replacing tile, your existing Menhirs will be converted to this style. The walkmesh file is included. If you are tileset saavy you can add this tile as an addition if you don't want it to replace. Hope you enjoy it! (Updated 12-31-05)","Rating":"N/A","Awards":[]},"296":{"Title":"Xena' Outfit","Author":"Davir","Submitted":20020722,"Updated":20020723,"Category":"Armor","Model Format":"Fan Skin","Description":"yes i know it but here is she glotning","Rating":4,"Awards":[]},"297":{"Title":"Xzart","Author":"DMcF","Submitted":20020825,"Updated":20020825,"Category":"Other","Model Format":"3DS","Description":"Here is a Xzart that needs skins and animations. It is in 3DS and mdl format. Contact me if you would like the model in another format for modification. All permission is given to finish or 'adjust' this model. This malicious creatures are related to goblins but prefer to use their inate magick abilities to confuse and attack weak adventurers.","Rating":4,"Awards":[]},"298":{"Title":"Zulu Shield","Author":"Mystique","Submitted":20050225,"Updated":20050225,"Category":"Item","Model Format":"BioWare Standard","Description":"A Zulu shield i created in gmax, could be combined with the zulu npc model available elsewhere on this site, or used to add flavour to a module, to arm headhunters or cannibals with","Rating":6.63,"Votes":2,"Awards":[]},"299":{"Title":"Zulu warrior","Author":"Colorsmith","Submitted":20020708,"Updated":20020415,"Category":"NPC","Model Format":"Fan Skin","Description":"A zulu-like warrior. Something that may be usable as a charcter, or an interesting NPC","Rating":7,"Awards":[]},"300":{"Title":"amazon_axe","Author":"Colorsmith&Inselaffe","Submitted":20020708,"Updated":20020430,"Category":"NPC","Model Format":"Fan Skin","Description":"A piece together that I talked Inselaffe into doing, then re-skinned to make a character. The axe is all his!","Rating":5,"Awards":[]},"301":{"Title":"anime/anthro npc","Author":"darklordavalon","Submitted":20040816,"Updated":20040820,"Category":"NPC","Model Format":"3DS","Polycounts":"4547","Description":"its ms3d format, im needing some one to convert it and skin it (it has the nymph skeleton and anims) but ms3d wont export the anims (and if you feel especially helpful you could skin it) okay its a (Auto desk)3ds now and I put in a skin I made (uses nymph skin plus some alterations I made to it)","Rating":9.25,"Votes":1,"Awards":[]},"302":{"Title":"c_pixolet","Author":"Samwise","Submitted":20040520,"Updated":20040601,"Category":"Monsters","Model Format":"3DS","Polycounts":"579","Description":"My first experience with 3d modeling, and my first post to the vault. So, let me know what you think. The idea for this creature comes from the novel, 'The Practice Effect' by David Brin. It is described there as a mix between a piglet and a pixie, among other more detailed descriptions/cover art. My main reference was the cover of my copy of the book. Newer editions show it on the cover appearing more impish, but I don't think that follows the text as well. This model started as the c_boar.mdl imported into GMax 1.2 with NWMax 0.6. The texture I'm using for now also started as c_boar.tga, tho I plan to eventually get a better one made. Latest Update (6/1/04): remade the hind legs and added ears and tail, also have a better screen shot.","Rating":1,"Awards":[]},"303":{"Title":"cage_panel","Author":"crecy","Submitted":20020715,"Updated":20020715,"Category":"Other","Polycounts":"98","Description":"one side of a cage, basically a panel of bars. this can be used to construct a cage that would actually hold a humanoid.","Rating":9,"Awards":[]},"304":{"Title":"draconians","Author":"jeshuran","Submitted":20020731,"Updated":20020731,"Category":"Monsters","Model Format":"Fan Skin","Description":"these are some draconians i made using the lizrdfolk as a base and someone elses(sorry i dont remember his name) exploding chicken base. I didnt do the aurak as i havent yet figured out how to get it to transform into the fireball creature.","Rating":8,"Awards":[]},"305":{"Title":"drylands tileset low v1.1","Author":"Baronrage","Submitted":20020708,"Updated":20020710,"Category":"Tileset","Description":"Drylands v1.1 Updated Some bugs have been fixed. The Drylands HakPak is a total re-skin of the rural tileset. It is released in 2 versions : the hi-version (13mb) with 512*512 textures, and the low version (7mb) with 256*256 textures. This file is the Hi-resolution textures one. I have also made a 'demo' module: the 'Orc's camp' included in the zip file. Be sure to read the text file for Installation instructions.","Rating":9,"Awards":[]},"306":{"Title":"e_head","Author":"key","Submitted":20041212,"Updated":20041212,"Category":"PC Parts","Model Format":"MDL","Description":"... Is it dangerous if a famous man's head is made (for example, President)?","Rating":9.75,"Votes":1,"Awards":[]},"307":{"Title":"evil microphone","Author":"Asaf a","Submitted":20020708,"Updated":20020715,"Category":"Monsters","Model Format":"BioWare Standard","Polycounts":"204","Description":"look at this great monster,created from scratch","Rating":4,"Awards":[]},"308":{"Title":"fiend axe","Author":"Lance_allot","Submitted":20041026,"Updated":20041026,"Category":"Weapon","Model Format":"Fan Skin","Description":"Hi everyone,i was working on an axe for a fiend in never winter nights but iv turned it into the mdl file like your suposed to and put it in a hackpack and it doesent seem to be anywhere in never winter nights can anyone please leave a message on how to get the mdl files into never winter nights,iv put it in a hackpack and yet nothing is there :(","Rating":9.5,"Votes":0,"Awards":[]},"309":{"Title":"githzeri heads","Author":"Coross","Submitted":20040111,"Updated":20040111,"Category":"PC Parts","Model Format":"BioWare Standard","Description":"Here are some githzeri/githyanki looking heads. Nothing much, just a little thing I tweaked from a model I found in a hakpack.","Rating":9,"Awards":[]},"310":{"Title":"kobolds","Author":"Erendril","Submitted":20020825,"Updated":20020827,"Category":"Monsters","Model Format":"BioWare Standard","Description":"c_kobold: reskinned, scaled lizard-kind with additional modeling/animation (e.g., tail). c_kobold.mdl uses animations from: a_ba_mod; a_ba_mod2; a_ba_mod3; and a_ba_mod4. all of these mdl's should be placed into the same hak pak as c_kobold. c_kobold.mdl = the model; a_ba_*.mdl = core animations for c_kobold.mdl; po_kobold_* = portrait images; c_kobold.tga = skin image; c_kobold.dds = compressed skin image for use in hak pak; representative modifications for portraits.2da and appearance.2da are also provided. NEWLY MODIFIED TO WORK WITH PATCH 1.23; NO MODIFICATION OF DIALOG.TLK REQUIRED - JUST PUT eh_kobold.hak INTO YOUR NWN/HAK DIRECTORY AND kobold.mod IN YOUR NWN/MOD DIRECTORY; LOAD THE kobold MOD.","Rating":8,"Awards":[]},"311":{"Title":"kurairyu's hands 1.5","Author":"kurairyu","Submitted":20040729,"Updated":20070302,"Category":"PC Parts","Model Format":"MDL","Description":"this vertion fixes the odd discolorations seen on many of the male hands. more to come.","Rating":9.9,"Votes":8,"Awards":["Hall of Fame"]},"315":{"Title":"Hera's Nude Override Pack","Author":"Hera","Submitted":20050522,"Updated":20060201,"Category":"Animation","Model Format":"Other","Description":"This little bundle is so you are able to see characters nude or in lingerie. For it to work you must extract the files into your override folder, also you must remove both Textures_tpa.erf and Textures_tpc.erf from your Texture folder for it to work correctly. Added a read me file.\n\nEnjoy ","Rating":9.98,"Votes":51,"Awards":["Hall of Fame"]},"316":{"Title":"Rural Elevation Tower","Author":"Tom_Banjo","Submitted":20050525,"Updated":20050525,"Category":"Buildings","Model Format":"MDL","Polycounts":"788","Description":"this is an elevation tower i took from the city tileset and edited for rural.\n\nit is made to fit a normal rural tileset, not the doa builders base.\n\nthere are two sourse lights and if you turn on animloop01, the flag will \"blow in the breeze\".\n\ni tried to test everything as best i could, but you can send \nbug reports to: webmaster@goblins-lair.com","Rating":10,"Awards":[]},"317":{"Title":"Ogre Reskin","Author":"St4rscream","Submitted":20050609,"Updated":20050609,"Category":"Monsters","Model Format":"MDL","Polycounts":".... Not sure","Description":"This is a reskin/model of Bioware's Ogre. In this one he is fat and wearing clothes. I'm not sure why ogres only wear loin cloths in NWN. Perhaps they like to show off thier ripped bodies. Well this fella ain't that comfortable with his body I guess. Anywho he replaces the standard OgreA.. Also in this hak are the other ogres with animation fixes. This was needed because OgreA was the one they all supermodeled, and I needed a new OgreA to fit my character on Alvis.\n\n\nNote: I fyou don't like the animations on the Ogre mage b you can open the MDL file in notepad and change its super model to Ogreb instead of Ogre, this will replace the animations back to NWN standard. Or if you like it better you can change all of them to c_ogre from c_ogreb...\n\nIf that confused you Im sorry, just Email me or something with questions.. st4rscream@gmail.com","Rating":"N/A","Awards":[]},"318":{"Title":"Female Human Heads - fixed for 1.66 Patch - mdls coincide with current CEP models","Author":"Lisa","Submitted":20050619,"Updated":20050619,"Category":"PC Parts","Model Format":"MDL","Description":"\nTitle tells you everything I think - but a few disclaimers and explanations:\n__________________________________________________________________\n IN NO WAY SHOULD THIS BE VIEWED AS ANY KIND OF OFFICIAL CEP PATCH \n_________________________________________________________________\nI will remove this hak once the CEP gets their own patch up...but I've been having trouble getting ahold of the CEP folks and they have given no timeline as to when they will be posting a patch themselves. \n__________________________________________________________________\nUSE AT OWN DISCRETION! CEP SHOULD NOT BE EXPECTED TO SUPPORT THIS _ Any questions should be directed to me tiamiat@comcast.net __________________________________________________________________\n\nIn this file you will find female human head models that have been patched to meet the needs of \nNWN patch 1.66. The models just happen to amazingly coincide with the ones in the CEP...Most are not my work :) I just patched 'em. \n__________________________________________________________________\nNO 2da files or textures are included - anyone needing those should already have those. You may need to use these models in your OVERRIDE heads as well as your PW/mod hak - They are not in a hak form - so anyone using these will need to be familiar with updating their PW/mod custom content. \n__________________________________________________________________\nI realize that I am probaly gonna step on someones toes with this posting but that is not my intent. There are several reasons I decided to post this but the main the reason is - I am spending way to much time dealing with individual requests for CEP head fixes. I've been getting a lot of requests for this particular set of files and cannot keep mailing them out individually. Many of the requsts have come from people who need these and who are not necessairly using the entire CEP. __________________________________________________________________\nOther reasons: I prefer to spend my fixing time helping folks not using the CEP head packs fix their unique batches, I believe that individual pw/mod authors have a right to update content they are using (the fix is free and public so they could do this themselves - and I have offered to help out anyone who cannot run the fix themselves and feel that includes people using CEP heads), the beta 1.66 patch has been around a long time and I know I prepared 1.66 fixes for my main haks and posted them within 24 hours of 1.66 going final...\n","Rating":"N/A","Votes":0,"Awards":[]},"319":{"Title":"City Texture Overrides Volume 2","Author":"DaleV","Submitted":20050630,"Updated":20050630,"Category":"Other","Model Format":"Fan Skin","Forums":"Link","Description":"We all know what the city tileset looks like. It's dull, now. It's been 3 years, and we've been in more cities than we can count. This PW, that PW.. the official campaign.. I mean.. the same old look is just not what it once was.\n\nSo here it is, folks. The second installment of DaleV's City Texture Overrides. For those that liked my first set, I think you'll find this one to be very different. Rather than simply re-coloring an existing set, I've actually created these by combining, coloring and modifying actual texture images from the net.\n\nTo use, simply Un-RAR to your C:\\NeverwinterNights\\NWN\\Overrides folder. (Assuming C:\\ is the drive that NWN is installed on your machine.) -> And that's it. Now all your favorite PWs, Official Campaigns and Single Player Modules will have a unique feel!\n\nAnd I know you guys want to know what you're getting, so to the right, you'll see approximately 15 screenshots, showcasing the new textures in my PW, The Crescent Coast. Enjoy, and remember.. if you don't like them, it's as simply as deleting the TGA files from your overrides directory, later on down the road. \n\nEnjoy, and ROCK ON!","Rating":9.88,"Votes":16,"Awards":[]},"320":{"Title":"old","Author":"jen","Submitted":20050711,"Updated":20060730,"Category":"Other","Model Format":"BioWare Standard","Description":"old","Rating":"N/A","Votes":0,"Awards":[]},"321":{"Title":"Fix to head from Linu in OC for HotU 1.66","Author":"Mordaedil","Submitted":20050805,"Updated":20050805,"Category":"PC Parts","Model Format":"BioWare Standard","Polycounts":"164","Description":"This small *.rar file fixes the female elven head which clips now after HotU due to the robe animations. This pissed me off as this is my favorite elven head from the default vault. This is also the first submission I am making as well as my first real creation using 3dsMax for a game. This was rather easy, any one 'could' do it, thing is, noone has. Installation is easy, just export to your override folder. Head 9 is changed.\n\nThis was an old file of mine, now repaired for 1.66 patch as well.","Rating":10,"Awards":[]},"322":{"Title":"Masks","Author":"v3par","Submitted":20050809,"Updated":20051120,"Category":"Armor","Model Format":"MDL","Description":"This is simple mask created by modify CEP hood (respect for author of that). This mask is based on Darth Nihilus mask from KotOR2:SL.\n\nThree files inside ZIP: mdl (ascii) and two plt files (texture and icon). Put it in hakpak and should work (i hope)\n\nSince i'm a beginner please let me know of any errors. \n\nCreated with GMAX and NWmax.\n\nAdditional mask or if you want revision 2 :)\nnothing special but i hope you like it ;)\nAnother mask/hood. this time its Visas Marr (or something that try to be similar :)\n","Rating":9.55,"Votes":7,"Awards":[]},"323":{"Title":"CEP Japanese Clothes Model Revision Set","Author":"dsss","Submitted":20050819,"Updated":20071211,"Category":"Armor","Model Format":"MDL","Description":"CEP Japanese Clothes Model Revision Set\n06/02/21;Change Dwarf & Half Ork Models.","Rating":8,"Awards":[]},"324":{"Title":"Dripping Blood placeable","Author":"gMonk","Submitted":20050819,"Updated":20050819,"Category":"Placeables","Model Format":"BioWare Standard","Description":"A simple edit of the water drips placeable model and texture to make a dripping blood placeable.\n\nZip file contains the edited model file, tga and dds textures and a text file with suggested 2da entries.\n\nI tried getting a screenshot of this but it's really hard to see. Just close your eyes and picture the water drips being dark red and less transparent.","Rating":"N/A","Awards":[]},"325":{"Title":"Larva Model & Texture, Animations MIA","Author":"Paganini","Submitted":20050821,"Updated":20050926,"Category":"Monsters","Model Format":"gmax","Polycounts":"996","Description":"This is a Larva model and texture I did a few months back based after the creatures from the Planescape setting, it has been waiting for me to upload. Anyone who is interested in doing the custom animations for this is welcomed to, all I would like is model and texture credit. Hope to see these guys in game. File is actually a gmax file, all geometry has been transformed/scaled/reset xformed and texture is already 256x256 and in tga format. minor work needs to be done for the alpha map dealy but it shouldnt be too hard as it is pixelated enough to just highlight the black and save to alpha channel.","Rating":8.63,"Votes":2,"Awards":[]},"328":{"Title":"Ruin of Skullcap","Author":"S.Davis","Submitted":20050924,"Updated":20050924,"Category":"Animation","Model Format":"BioWare Standard","Description":"The only things need in this test mod is cep1.51, xp1, xp2 and of course the newest patch for the game.\nThis is the first of the releases with more to come. Come on in and enjoy the free xp and treasure. \n\nHaks needed are as follows: For now just CEP (latest)","Rating":"N/A","Awards":[]},"329":{"Title":"Random Head","Author":"jonnyhr","Submitted":20050930,"Updated":20051005,"Category":"PC Parts","Model Format":"MDL","Polycounts":"170","Description":"Head by jonnyhr.rar & zip file contain: \n - head_model.mdl\n - head_pallet.plt\n\nI did not bother to make a HAK file out of this since it was only one head. This will be a part of a later HAK Pack however, which will be released some time in the future.\n\nFor those interested I've uploaded a preview of the clan suit I'm making which will be released with the complete HAK. (This image is still a work in progress, the whole texture will appear sharper when finished.)\n\nClan Suit\n\nPS: \nIf you've downloaded this head and perhaps would like me to make more, please comment and rate this head. Everything said will encurrage me to make more heads and other content.. and to post them here.\n\nThanks for reading all this.","Rating":9.7,"Votes":3,"Awards":[]},"330":{"Title":"Updated Werewolf Model","Author":"Worm","Submitted":20051005,"Updated":20110801,"Category":"Monsters","Model Format":"MDL","Polycounts":"720+","Description":"This just overwrites the default werewolf with this modified model.\n\nI do plan on re-doing the skin texture as well as some mesh editing so stay tuned for an update.\n\nas of yet I've no plans on adding this model as a new creature,mostly because I can't stand the look of the default model anyway and personally preferred to have it overwrite.\n\nDefault Model edited in 3ds-max 4 by adjusting head,adding 'real' teeth, adding eyeballs and light emitters to give their eyes that special glow.\n\nto use, as HAK:\nPlace wm_werewolf.hak into your Nevewinter Nights\\NWN\\Hak directory and associate it with whatever module your making/using\n\nto use, as Override:\nUse NWN explorer of NWHak.exe(located in Neverwinter Nights/nwn/utils folder) to extract \"c_werewolf.mdl\" from hak and place into your Neverwinter Nights/NWN/Override folder\n\n\nKnown problems.\nsometimes for a split second the emmitters seem to float away from the eyes, this is usually during running , I haven't been able to find a fix for this so if anybody has any guesses, let me know and I'll post an update a.s.a.p\nthanks for downloading.\n\n~WoRm\n\n\n\n\n\n\n*****UPDATE: 11/25/06 **********\n\nwerewolf v2 override version has been uploaded. enjoy!","Rating":9.78,"Votes":25,"Awards":["Hall of Fame"]},"332":{"Title":"Dynamic Illithid Head #4 (CODI Scientist)","Author":"Monferrat","Submitted":20051105,"Updated":20051105,"Category":"NPC","Model Format":"MDL","Polycounts":"~450","Forums":"Link","Description":"Adds the CODI Scientist Mindflayer Head as a dynamic head for dynamic illithid / mindflayer model (see http://nwvault.ign.com/View.php?view=hakpaks.Detail&id=5288 has lengthy install and playing as pc instructions). Adds as pm$0_head007. Also includes a freakazoid head for humans pmh0_head192, just for fun. Itz a downscaled beholder head. these are dynamic, can be any color.","Rating":9.25,"Votes":1,"Awards":[]},"333":{"Title":"Male Human Vertex Weight Fix","Author":"Mordaedil","Submitted":20051114,"Updated":20051114,"Category":"PC Parts","Model Format":"MDL","Polycounts":"Standard","Description":"This fixes a sloppy weight error in the Bioware robe for males as seen in provided picture.\n\nIf you are sick of walking around with a monk, slightly tied to the ground, this is a fix for you!","Rating":"N/A","Awards":[]},"334":{"Title":"CopyItemAndModify fix","Author":"Primogenitor","Submitted":20051205,"Updated":20051205,"Category":"Animation","Model Format":"BioWare Standard","Description":"A fix for a biobug in CopyItemAndModify\nIf you apply it to an item type that has multi-part icons but only a single 3d model (e.g. potions) then it always return OBJECT_INVALID\nThis is because it trys to make a 3d model for it, since it assumes every icon has a matching model, which is not true.\nThis hak fixes this by providing duplicates of the bioware model that fit the file name format of component models.\nUntested if this could be serverside only.","Rating":"N/A","Awards":[]},"335":{"Title":"Otyugh Model","Author":"danthedust","Submitted":20051220,"Updated":20060111,"Category":"Monsters","Model Format":"gmax","Polycounts":"1450","Description":"This is an Otyugh model i made in gmax.\nIts my first own custom model(I`ve been through many tutorials before, huh:)).Its not set up for NWN right now, just an normal gmax mesh (without UV mapping). It also needs skin and animation. I also dont know if its made right for animation. I left every moving part a single mesh. But I want to post it in this beta phase because I need someone who can skin or\\and animate it. Its one of the monsters I really missed in NWN.Feel free to play a little bit around with it. If somebody wants to animate or skin and has problems:mail me for earlier versions.Really hope you like it.\nUpdated 11.01.2006:I greated new Tentacles because the old ones didn't look very good to me and they are now made of 5 instead of 3 mesh pieces. I think animation will be a lot easier because of this.I left the old one in the rar if someone wants to use it.","Rating":8,"Awards":[]},"336":{"Title":"Silver Half Dragon","Author":"apeiron","Submitted":20060102,"Updated":20060126,"Category":"PC Parts","Model Format":"MDL","Description":"-This is a custom derivation of Ryuujin's Gold Half Dragon, which reskins and slightly modifies the model to give it a somewhat smoother style.\n\nTo use this as a PC model, grab Leto (http://nwvault.ign.com/View.php?view=other.Detail&id=664), or the PRC Character Creator (http://nwvault.ign.com/View.php?view=other.Detail&id=707), and set the following values to a saved character:\n\nAppearance: 764\nTail: 23\nWings: 45\n\nThe original model, with HAKs and full documentation, can be found at: http://nwvault.ign.com/View.php?view=hakpaks.Detail&id=6224\n\n\n\nVersion History:\n1.1: The model is now fully compatible with Ryuujin's Gold Half Dragon.","Rating":9.66,"Votes":10,"Awards":[]},"338":{"Title":"CEP Heads for Override","Author":"CEP Team (extracted by Alcor)","Submitted":20060108,"Updated":20060110,"Category":"PC Parts","Model Format":"BioWare Standard","Description":"Simply the 'CEP Head'files (version 1.52 compatible) suitable for insertion to NWN 'overide' folder. \n\nThese files will enable character generation with CEP head varients at servers where CEP standard heads are utilised unsupported by 'stand alone' haks - simply 'unRAR' all files to the overide folder.","Rating":8.63,"Votes":4,"Awards":[]},"339":{"Title":"Morrowind Indoril Armor","Author":"NewByPower","Submitted":20060109,"Updated":20060113,"Category":"Armor","Model Format":"MDL","Polycounts":"near1500","Description":"From Morrowind, this is the Indoril Armor (I love its look, specially with the Mournhold skirt!)\nOnly for human thin female phenotype.\n\nAnd now (13/01/06), the helmet.","Rating":9.94,"Votes":6,"Awards":[]},"340":{"Title":"Portals ","Author":"v3par","Submitted":20060113,"Updated":20111202,"Category":"Placeables","Model Format":"MDL","Description":"Simple portals.\n\nLook to file description for more info.\n","Rating":9.99,"Votes":26,"Awards":["Hall of Fame"]},"341":{"Title":"Module/Server logo (GUI override)","Author":"v3par","Submitted":20060125,"Updated":20060125,"Category":"Other","Model Format":"MDL","Description":"Very simple idea. Hope no one discover that already. :)\n\nThis is loadscreen model override which will add you own logo to every loadscreen. This may be useful for Persistent World servers. Just make own logo, save it as TGA and it will appear on all loadscreens in your module.\n\nThree versions available: left, center and right. \n\nJust put one of the mdls together with tga into one of your hakpaks and it should work.","Rating":10,"Awards":[]},"343":{"Title":"Morrowind Trueflame & Hopesfire!","Author":"Scorpiochess","Submitted":20060127,"Updated":20080814,"Category":"Weapon","Model Format":"BioWare Standard","Description":"Note: This is the first time I've posted anything...\n\nI JUST finished Morrowind and wanted to bring a souvenir of Vvardenfell into the world of Toril: the weapons of Nerevar and Almalexia! They were easy to make (I used the Toolset), but I just couldn't resist the urge to make them. Of course, you don't HAVE to be a Drow (or Dunmer?) to equip them, as I felt that would be a bit restrictive. And since they're scimitars, NOT longswords, even a druid like me can use them! Enjoy.\n\nSorry if someone else already made these, by the way! I looked a bit myself, but didn't find them, so I thought to myself, \"Why not?\"\n\nHmm... Maybe later I'll also make Kagrenac's Tools as well...","Rating":"N/A","Awards":[]},"344":{"Title":"kings of old","Author":"Audacity guy","Submitted":20060130,"Updated":20060314,"Category":"Other","Model Format":"gmax","Description":"Hello all, This model is part of a tileset that I am working on and thought that I would share it with the community in case someone else would like to use it for their own purposes (it will be a while before I am done). I have uploaded it in two differrent formats, one for gmax and one as mfx (openfx). the gmax has all of the objects as unique(fingers,wrist,forearm etc...) so you can manipulate the model. the mfx model has all of the objects as unique also, but if you export the file as a whole to 3ds the objects become merged as one, so to fully use this model open it with openfx, select a single object then export as 3ds (there are about 50 objects in this model)\nRight now i don,t have any textures and the model isn,t scaled to nwn it,s just basic. when finished the tileset will be a palanthus, lord of the rings, swampland/ruins mix.\nThe polycount is high, but it will be unique and occur only once and as in the LOTR movie the shot with the two kings carved out of the mountain was an awesome part of the movie, an artifact of a once great kingdom.","Rating":"N/A","Votes":0,"Awards":[]},"345":{"Title":"bridge","Author":"Audacity guy","Submitted":20060205,"Updated":20060314,"Category":"Other","Model Format":"gmax","Description":"Model of a bridge. feel free to use it or any parts of it you wish. (it is meant to be very large, the boot on the statue should be the size of a human character in nwn) ","Rating":"N/A","Votes":0,"Awards":[]},"346":{"Title":"Redux: Death Mask [Helm Override]","Author":"Sabbryn","Submitted":20060210,"Updated":20060210,"Category":"Armor","Model Format":"BioWare Standard","Polycounts":"228","Description":"Need a little something for your Palemaster, Assassin, or evil cult? Find the existing models lacking? I sure did ....\nModel is designed to override the existing BW model (the 'ram-horns skull helm').\nFile contains the 'redux' model (helm_026), texture map (helm_026.plt) and icon (ihelm_026).\n\nCredit to BW for the original skull face map and inspiration behind the hood design.","Rating":9.94,"Votes":6,"Awards":[]},"347":{"Title":"Atlas ?","Author":"audacity guy","Submitted":20060214,"Updated":20060321,"Category":"Other","Model Format":"MDL","Description":"Here are the Atlas models in mdl format\none with the helmet and the other with\nArringends dreadlocks.\n\nIve included the pwk and plc 2da for\nconvienience though i am sure you will\nwant to change things to suit your\nneeds.\n\nAll of the textures are from game\nitself with the exception of the map\nof Fearun. They look decent in the nwn\nexplorer but in the game they become\nkinda dull looking, oh well, still\ntrying to develope the skill of\ntexturing for NWN and I,m hoping there,s a few texture artist,s who can\nfinish these and possibly include them\nin a hak. don,t know if jpg format\nwill work ingame, the tga format was\n12 mb for the map of Faerun so just dl\nand convert to tga. also if you dl the\ngmax file that was previously posted\ndelete it there was a problem with the\nhands and i think there were two models\nsharing the same geometry and\nconnected as one so i just remade the\nhands. The statues are tall as the\naverage house in NWN.","Rating":"N/A","Awards":[]},"348":{"Title":"Bone Helmet Head","Author":"NewByPower","Submitted":20060217,"Updated":20060217,"Category":"PC Parts","Model Format":"MDL","Polycounts":"400","Description":"This is a head with an helmet for human female, inspired by a Royo drawing","Rating":9.75,"Votes":6,"Awards":[]},"349":{"Title":"\"Euro-katana\" (by request)","Author":"gaoneng","Submitted":20060309,"Updated":20060311,"Category":"Weapon","Model Format":"MDL","Polycounts":"203","Description":"Simple rapier model requested by Hya-kun.\n\nOriginal request posted here in Idea Database.","Rating":10,"Awards":[]},"350":{"Title":"BLK Armor","Author":"syuuza","Submitted":20060318,"Updated":20060323,"Category":"Armor","Model Format":"MDL","Polycounts":"713","Description":"Image from japanese comic\n\n\nThis is machine translation.\n\n\nComment.\n\nHEAD PART not ORIGINAL . Modification from NeverWinterMilitia HEAD.\nSorry I can use only THAILAND or JAPANESE language.\nI cannot answer even if I get comment....\n\n\nThe Usage.\n\nMake hak file or insert override folder.","Rating":8,"Awards":[]},"353":{"Title":"Bioware Children Heads for Halflings","Author":"Caliginosity.","Submitted":20060321,"Updated":20060321,"Category":"PC Parts","Model Format":"MDL","Description":"This is an override that fills in the space between CEP halfling heads pma0_head026 - pma0_head160 (for males) and pfa0_head015 - pfa0_head161 (for females). I simply copied the last CEP head and pasted it multiple times, renaming the head number so it bridged the gap between where the CEP heads ended and the Bioware \"children\" heads began. So, while these heads do nothing for you in and of themselves, they will now allow you to select the children heads (161-167 for females, and 160-161 for males). Simply place these in your override folder, and you should be good to go. \n\nNote: You must have CEP installed in order to use these heads as the numbering system only works with the CEP head numbering system. \n\nNote 2: The CEP head override can be found here: http://nwvault.ign.com/View.php?view=Models.Detail&id=338 (copy and paste this link to your address bar in your internet explorer ;))","Rating":"N/A","Awards":[]},"354":{"Title":"Blank Tileset","Author":"Rabidgoalie","Submitted":20060506,"Updated":20060506,"Category":"Tileset","Model Format":"gmax","Polycounts":"approx. 180","Description":"This is a blank tileset, similar to the one that comes with the Bioware export scripts download. There are aurabases set up in a grid, with letters and numbers running along the sides to denote the grid position.\n\nAlso, there is a MAXScript that will rename the entire tileset using the prefix and variation numbers that you provide in a rollout utility.","Rating":"N/A","Awards":[]},"355":{"Title":"GNEW GNOMES","Author":"St4rscream","Submitted":20060531,"Updated":20060531,"Category":"PC Parts","Model Format":"BioWare Standard","Polycounts":"?","Description":"These are 6 New Gnome heads for the male gnome, which I feel Doesn't have alot of choice in head selection. Infact even the cep only adds Orc heads and a few heads that are for Halfling and human ones, But these are 100% gnome. Also they work really great for Forrest Gnomes.\n\nTO USE THESE, Either place in your override or add them to your hak.. Fun and easy, just like gnomes.","Rating":9.79,"Votes":18,"Awards":[]},"356":{"Title":"Elemental Swords","Author":"v3par","Submitted":20060601,"Updated":20060603,"Category":"Weapon","Model Format":"MDL","Description":"Four swords based on elemental reavers from Legacy of Kain series.\n\nThese are great swords which use model nr 18. CEP compatible but may override some other custom content.\n\nFeel free to report bugs and comments.\nUPDATE 1: \nAdded 3 more swords: black, pink, red","Rating":10,"Awards":[]},"357":{"Title":"Elemental Forges","Author":"v3par","Submitted":20060602,"Updated":20060603,"Category":"Placeables","Model Format":"MDL","Description":"Another idea \"stolen\" from Legacy of Kain series. This time chapel-like placeables which can be used as weapon boost places.\n\nAs always bug reports and comments are welcome.","Rating":9.92,"Votes":5,"Awards":[]},"358":{"Title":"Skinned Otyugh Model","Author":"danthedust/Zornok","Submitted":20060611,"Updated":20060801,"Category":"Monsters","Model Format":"gmax","Polycounts":"1450","Description":"The improved Version of my earlier Otyugh Model(see readme for details).The skins were made by Zornok and I like them very much.Thank you very much for your work.I'm still in need for an animator who brings the monster to live.If you want to help, mail me to danthedust@freenet.de","Rating":10,"Awards":[]},"359":{"Title":"Extracted Feline Heads","Author":"JenX","Submitted":20060618,"Updated":20060618,"Category":"PC Parts","Model Format":"BioWare Standard","Description":"These are the two female half-orc heads, extracted from JenX and fixed to be usable. It's a total of four files, very small, so it won't be a problem for dialup users. THESE ARE NOT MY HEADS. These are in the JenX hak, only broken to be unusable. All I have done is pull them out and make them usable.","Rating":"N/A","Awards":[]},"360":{"Title":"New Gnomes","Author":"Tuldor","Submitted":20060618,"Updated":20060619,"Category":"PC Parts","Model Format":"MDL","Description":"I made these new gnomes for the german PW Weltentor. But i think other people like it too so i want to share it.","Rating":10,"Awards":[]},"361":{"Title":"SF Vehicle Package","Author":"SSJKamui","Submitted":20060701,"Updated":20060701,"Category":"Other","Model Format":"gmax","Description":"Vehicles from Mazinger Z, Space Runaway Ideon, Ghost in the Shell , Xenogears, Akira , Bubblegum Crisis , Blade Runner, Kamen Rider , Space Sherrif Gavan, 2001 A Space odyssey and other Science Fiction Storys","Rating":9,"Awards":[]},"362":{"Title":"Morrowind Robe","Author":"NewByPower","Submitted":20060704,"Updated":20060704,"Category":"Armor","Model Format":"MDL","Polycounts":"~ 800","Description":" This is a robe from Morrowind, the blue and sand extravagant set (skirt and shirt) assembled as a robe.\n Only for human thin female phenotype ( I had no other deformation basemesh at the moment, and all my game characters are human females ).\n","Rating":9.92,"Votes":8,"Awards":[]},"363":{"Title":"Roman Temple","Author":"GrassMaster","Submitted":20060704,"Updated":20060705,"Category":"Animation","Model Format":"3DS","Polycounts":"2500","Description":"A while ago I released several roman building tiles for NWN, however, I never finished the tileset I had hoped to make. Now a little more then a year later my interest was renewed and I recreated this much more detailed model of a small roman temple. \n\nUnfortunatly it likely has to many polygons (about 2500) to be effectively used in NWN1. But with NWN2 now close to being released, It may find its place, along with any other new models I make, there.\n\nThe file is in .3ds format so it should import to 3dsMax as well as Gmax. ","Rating":"N/A","Awards":[]},"371":{"Title":"Engine \\ Generator Thingy","Author":"rezzzman","Submitted":20060721,"Updated":20060723,"Category":"Placeables","Model Format":"MDL","Polycounts":"1586","Description":"Generator: \n�� Fixed\\re-textured by Rezzzman : www.cityofgoldmod.com\"\n�� Original Model Extracted from the D20 Modern Placeables Hak\n\nUpdates:\nOriginal Model used excessively large textures (3+ MB compressed), linked to some non-existent textures, had overlaying textures in the same plane, which caused \"flickering\" clipping issues. Some textures were backwards or upside down, but the biggest problem was the walk mesh was incorrect, causing anomalies and sometimes crashes when walking near the generator.\n\nThis update includes a fixed\\re-textured generator with a non-buggy walkmesh. It could be a simple generator or with a little imagination, it could be the engine for various vehicles ( Steam boat, flying ship, etc...).\n\nUPDATE 7/23/2006 : Someone pointed out in an email to me that some textures were still \"backwards\". I fixed these however the first 27 downloads recieved some bad textures (luckily, none of them voted ;) )","Rating":9.83,"Votes":3,"Awards":[]},"372":{"Title":"Drow Head","Author":"St4rscream","Submitted":20060727,"Updated":20060728,"Category":"PC Parts","Model Format":"BioWare Standard","Polycounts":"A bit higher than NWN Im not sure","Description":"Here is a drow head I modelled for the New Night Below Underdark server,\nhttp://nwvault.ign.com/View.php?view=community_news.Detail&id=2387\nSo its Drizzt, old 2nd edition with sideburns and all.","Rating":10,"Awards":[]},"373":{"Title":"New Weapon_VFXes","Author":"DeathFace (RestlessKnight)","Submitted":20060815,"Updated":20060831,"Category":"Weapon","Model Format":"MDL","Description":"I finally done it. This models allow you to use a new visual effects of your wepons. The damages are old, but effects are much, much better now.\n---\nLast Update: Fixed an acid effect in all weapons... I hope...\n \nLet's install this little pack to your override section and let's test it:-)\n\n//Sorry for my bad english...","Rating":9.85,"Votes":19,"Awards":[]},"375":{"Title":"Nalfein's Helmet Pack 1.0","Author":"Nalfein","Submitted":20060907,"Updated":20060910,"Category":"Armor","Model Format":"MDL","Polycounts":"Average","Description":"This pack contains 10 custom helmets complete with textures. See image for details. 9 different helmets are shown in the photo, with the dragon helmet shown once for each of the chromatic types. Missing from the picture is a mask without horns, but otherwise identical to the dragon mask.\n\nNow with item icons for each helmet. (included in patch)\n\nMore helms coming soon!","Rating":8.75,"Votes":2,"Awards":[]},"376":{"Title":"Nalfein's Werebear 1.0","Author":"Nalfein","Submitted":20060909,"Updated":20060913,"Category":"Monsters","Model Format":"MDL","Polycounts":"Average","Description":"This werebear was built for my PW where one of the characters is able to take a hybrid bear form at will, like a werebear. I also use it for a monster in my swamps.\nThe download includes a model, the texture and a readme with a line for your appearance.2da file.\nGeneral instructions are in the readme.\nSee image for good look at the werebear.","Rating":9.67,"Votes":3,"Awards":[]},"377":{"Title":"Nalfein's Werebear 2.0","Author":"Nalfein","Submitted":20060913,"Updated":20060914,"Category":"Monsters","Model Format":"MDL","Polycounts":"Average","Description":"I updated the werebear model to look more like the DiabloII werebear. Also included multiple sizes and colors. You can now choose from a brown, black, or polar bear form.\nIncludes textures and portraits. Thanks goes to Kefrem for the Polar Werebear idea.","Rating":"N/A","Awards":[]},"378":{"Title":"Half-Demon/Fire-Demon","Author":"tialno","Submitted":20060928,"Updated":20060930,"Category":"Monsters","Model Format":"MDL","Description":"Here is an overwrite for the Lizard-warrior B. I self use it with Leto as an half-Demon-PC. I used exisiting Modelparts and added some lights, fire and smoke an some glow-effects.","Rating":9.5,"Votes":0,"Awards":[]},"379":{"Title":"Electric demon","Author":"tialno","Submitted":20060929,"Updated":20060929,"Category":"Monsters","Model Format":"MDL","Description":"Glimming Body and glowing Eyes..uuhhh, Lightning around his Feets and white Smoke coming out his Horns - I use this amazing Demon as PC with LETO, it's an override of the Lizard Warrior B.","Rating":9.5,"Votes":0,"Awards":[]},"380":{"Title":"Plants","Author":"Tom_Banjo","Submitted":20061005,"Updated":20061005,"Category":"Placeables","Model Format":"MDL","Description":"finally...\n\nhere are some plants i created a while back that i wanted to release so anyone that is interested can make use of them. \n\nincluded in this hak are 2 plants and 1 pot.","Rating":10,"Awards":[]},"381":{"Title":"Fire Demon 2.0","Author":"tialno","Submitted":20061006,"Updated":20061008,"Category":"Monsters","Model Format":"MDL","Description":"Even if NWN2 is coming, I decided to release every week new models to keep NWN alive. This is an update of my Fire Demon: i reduced the smoke, added sparks, the horns are now also glowing with fire at their ends, the eyes has a flaming aura and the body is glowing and at last i added glowing wings. Enjoy this more fiery demon:-)","Rating":8,"Awards":[]},"382":{"Title":"Human Male Model Bugfix","Author":"NWC_Snake","Submitted":20061116,"Updated":20070602,"Category":"PC Parts","Model Format":"BioWare Standard","Description":"The models in this archive are replacements for the bugged human male normal and large phenotype models that were included in the 1.68 patch. These replacement models fix the accidental rotation and translation of the impact animation nodes that occurred when the cloakmodel node was added. The misplacement of the impact node causes visual effects intended to orient with the character body to be improperly oriented. This model fixes this problem by putting the impact nodes for the human male models back where they belong.\n\nTo use these models, you can either place them in your NeverwinterNights/NWN/override folder, or add them to a hakpak that ia associated with your game. You don't need a special 2da file entry or other modification to use these models.","Rating":10,"Awards":[]},"383":{"Title":"Beholder","Author":"r.bichi","Submitted":20061221,"Updated":20061221,"Category":"Monsters","Model Format":"Other","Forums":"All Models","Description":"this two images jpg are the rendering of a model that i make whit Cinema4D/3DSMax 8.0\nand if anyone is interessed to make an animation is wellcome alike every comment..","Rating":6.75,"Votes":2,"Awards":[]},"385":{"Title":"whatbrick's NWN Stuff","Author":"Patrick Wilson (whatbrick)","Submitted":20061228,"Updated":20070101,"Category":"PC Parts","Model Format":"MDL","Polycounts":"various","Description":"*****************************************************\n*****************************************************\n\n\"Neverwinter Nights\" Items v0.1\n\nby Patrick Wilson\n\"whatbrick\" on nwvault\n\"LeAdderNoir\" on the Bioware Forums\n\n*****************************************************\n*****************************************************\n\n\"So, what is this?\"\n\n\"This\" is a collection of custom content that I had created for Neverwinter Nights. It was never released before because the work that is completed was done so on the verge of NWN2. My main focus is on NWN2 content creation right now, but the only thing stopping me from doing other NWN1 stuff is time.\n\nAlso, while the majority of the content is my own design, there are elements that belong to someone else. Someone that I could not successfully contact, so elements that relate to that character have been removed. The model is still in the collection, but the textures aren't. I have included texture templates so others can create there own textures, however, so I haven't gimped people too much.\n\nHere's a list of what is available. Please note that all of this works in-game, though not everything is what I would consider \"finished.\"\n\n1) Full body \"robe\" for human males. I had a distinct vision of what I wanted my monk character to look like, and this is it...sort of. Comes with an inventory icon and the 2DA for robes.\n\n2) Cloth Wrap cloak: The idea here was that a large cloth banner was taken down and is wrapped around a person to make a cloak. Here are the different versions of the wrap:\n\na) Tattered Wrap with bordering embroidery\nb) Tattered Wrap without border\nc) Non tattered wrap with border\nd) Non-tattered wrap without border\ne) Hooded cloak with tattered border\n\nI think the non-tattered borderless version comes for all races and genders. I didn't go through and fix all the clipping issues, but I got quite a few. The others are for human males only.\n\nThe hooded cloak has a problem that all cloaks and robes with hoods suffer from (at least those that expose the PC heads). The problem is when you mouse over an object, the game engine rotates the head object of the PC itself, not the head object of the supermodels that supply the animations. The result is that the hood portion of the cloak (or robe) does not move with the head when it tracks an object you have moused over. The hood deforms normally with all other animations (combat, emote, etc).\n\n3) Full body \"robe\" for elven females only. This is the model based of another's character design. It was a tiefling (whatever the elven-tiefling thingies are called), hence the tail. The 2DA entry for it is included. To get it working, you just need a texture and inventory icon.\n\n4) Custom rapier parts. These are only sized correctly for elven females...my mistake, but they work. They come with their own inventory icons...which are also sized incorrectly. Only the blade portion is visible in the inventory.\n\n5) Custom dagger parts. As with the rapier they are sized for elven females, but the inventory icons should be the correct size.\n\n6) Hair-styles test material. There are a couple of heads and one quickly made hair mesh in here to test the feasibility of doing custom hair-styles. Might want to ignore this as I only just started on it before moving on.\n\n7) Custom heads. Besides the heads for the above hair test, I made a couple of heads for the full body \"robes\" above. As before, the textures to the character that is not my design has been removed.\n\nUsage Requirements:\n\nNo legalese here, just credit me for the initial work if any of this is used. Please use common sense and common courtesy, that's all I ask.","Rating":9.5,"Votes":0,"Awards":[]},"387":{"Title":"Gelatinous Cube","Author":"peektime","Submitted":20070101,"Updated":20070101,"Category":"Monsters","Model Format":"MDL","Forums":"All Models","Description":"This is my version of a gelatinous cube. There's an animation on how to move this creature (is an .AVI Xvid encoded) i've add two object from placeable of NWN2 and put in a deformed simple cube on 3DS. In add i have make a .MDB file if anyone is capable to insert in the game (please inform me).","Rating":9.75,"Votes":1,"Awards":[]},"388":{"Title":"Beholder NW","Author":"peektime","Submitted":20070103,"Updated":20070103,"Category":"Monsters","Model Format":"Other","Description":"Is the new version of the beholder eye small a short beard and a rhino-like texture. How do you think about it?","Rating":9,"Awards":[]},"392":{"Title":"Weapons001","Author":"TaLLan","Submitted":20070110,"Updated":20070111,"Category":"Weapon","Model Format":"3DS","Polycounts":"629","Description":"These Ancient Blades are done in Damascus blades with Ivory, Lapis, Wooly Mammoth and Flint handles","Rating":8.5,"Votes":0,"Awards":[]},"404":{"Title":"CEP 2 Heads","Author":"Ioryo","Submitted":20070121,"Updated":20080422,"Category":"Other","Model Format":"MDL","Description":"I just extracted the CEP 2 heads files, you just have to put them in the override folder of your Nwn main folder, and enjoy the new heads.","Rating":9.5,"Votes":0,"Awards":[]},"407":{"Title":"PLC_Firewood","Author":"Tom_Banjo","Submitted":20070706,"Updated":20070707,"Category":"Placeables","Model Format":"MDL","Polycounts":"180","Description":"just a place to stack your firewood besides on the floor.\n\ni tested this model and the pwk and shadows seem to be working correctly. if anyone\nnotices any problems besides a missing texture*, please let me know and i will correct\nthem. of course, i appreciate any comments or ideas. enjoy...\n\n* i created this placeable using a texture from DLA's tilesets. i'm assuming everyone has purchased the module by now. (it's really a very fun mod to play and they put a lot of hard work into the modelling and textures) if not, bioware is supposedly patching that stuff in to the game soon.","Rating":10,"Awards":[]},"408":{"Title":"Djinn Pack","Author":"SilkD","Submitted":20070802,"Updated":20070805,"Category":"Monsters","Model Format":"BioWare Standard","Description":"3 Djinn, a very big Djinn and fire and air Djinn. see Screen\n\n\nproblem with the tail version, is the footstepp sound, better was the soundset of the air elementar\n","Rating":9.92,"Votes":3,"Awards":[]},"409":{"Title":"Modern lockers","Author":"Stacy/Jez","Submitted":20070816,"Updated":20070816,"Category":"Placeables","Model Format":"BioWare Standard","Forums":"Link","Description":"This is just 7 variants of modern lockers done by stacy_19201325. I like variety some I did some more, here they are.\n\nOh I also added great sounds to go with these, I suggest you change sound entry of Stacy's to 49 like mine, see the readme.\n\nInstruction on how to add this to your haks included in the readme. Read it! ^^\n\nDone for Whitefall 2527: Link","Rating":10,"Awards":[]},"410":{"Title":"Whitefall Exotic flowers v1.1","Author":"Jez","Submitted":20070827,"Updated":20101001,"Category":"Placeables","Model Format":"BioWare Standard","Polycounts":"very low","Forums":"Link","Description":"These are variations of common found placables flowers, I love variations ^^\n\nOriginal models and textures I think are all by Adam Miller, credits and thanks to him!\n\nNew textures by me of course :p\n\nIncluded in the .rar are the models, textures and lines to add to your current placeables.2da\n\nenjoy!\n\nDone for Whitefall 2527 persistent world in development *French*\n\nUPDATE to version 1.1 - May 11th, 2010\n\n- Added a separate TGA pack for those who can't view .dds textures. Use: just add those TGA files to your hak. Done.\n\n- Removed angular/square shadows. Usage: Take version 1.1 and replace the old files in your hak with these, and you're done.\n\n\n\n","Rating":10,"Awards":["Hall of Fame"]},"411":{"Title":"New Male Head","Author":"Tom_Banjo","Submitted":20070827,"Updated":20070828,"Category":"PC Parts","Model Format":"MDL","Description":"a new human male head. \n\n*eyes use plt layer Tatoo1.","Rating":9.5,"Votes":0,"Awards":[]},"412":{"Title":"Matron Head Fix","Author":"Hadzilla","Submitted":20070916,"Updated":20070916,"Category":"PC Parts","Model Format":"BioWare Standard","Description":"this is the Matron head fix as her hair and lips can be picked for color now just stick in the override file and enjoy \n\nThanks to Elorfin Endorfin for the original head ","Rating":10,"Awards":[]},"415":{"Title":"Lineage shields","Author":"Quantiko","Submitted":20071113,"Updated":20071113,"Category":"Armor","Model Format":"MDL","Description":"Five Lineage shields, three tower and two small shields I made looong time ago (basically a learning work :-p )\n\nOnly models, textures (tga format) and icons in the .rar.\n\n*** Credits ***\n- The DoD guys (Ossian St.) and... I don´t remember the others used for the small and kite shields, sorry >_< \n- Front part taken from some screenshots and modified by me.\n\nHYLT\nFantasy mode off.\n \n\n","Rating":9.88,"Votes":4,"Awards":[]},"417":{"Title":"Bioware's Mass Effect M7","Author":"Jez","Submitted":20080104,"Updated":20090722,"Category":"Weapon","Model Format":"Other","Polycounts":"800+","Forums":"Link","Description":"This is Bioware's Mass Effect M7 I did on request at d20 forums.\nIncluded are NWN1 model, texture, and .3ds and .Max format if someone want to port it under NWN2. (let me know then ^^)\n\nVisit the new NWN1/NWN2 Sci-Fi home website: FutureNights!\n\n05/01/08 - added a demo module. The hak contains also some new sound, inventory icons, and empty crosbow models to match M7 middle part.\n\n10/01/08 - Added .dds inventory icons so they appear correctly ingame. Had them to your hak.\n\nNote: Updated version here: Link","Rating":9.63,"Votes":12,"Awards":[]},"418":{"Title":"Sten mk II","Author":"Jez","Submitted":20080106,"Updated":20090719,"Category":"Weapon","Model Format":"BioWare Standard","Forums":"Link","Description":"This is a Second World War english smg. Made by request from Gifly Ganger at d20mm forum.\n\nIntented for builders, not players.\nTo take a look, put the files in override, and create a custom light crossbow in a module. You should see it.\n\nV2 adds a black version, and numbering is compatible with d20mm 2.0 (tba).","Rating":10,"Awards":[]},"419":{"Title":"My deer version...","Author":"Doc","Submitted":20080108,"Updated":20080121,"Category":"Monsters","Model Format":"MDL","Description":"My first model ever,I just doodled. I'm not a artist. Kinda just colorized a deer....","Rating":1,"Awards":[]},"420":{"Title":"Silver Spider","Author":"Doc","Submitted":20080120,"Updated":20080121,"Category":"Monsters","Model Format":"MDL","Description":"This is well ... A silver,metal like spider I made in 3 seconds. May override the Green Giant Spider that model viewer came with.\n\nIf you like this perhaps I can make more silver creatures.","Rating":"N/A","Awards":[]},"422":{"Title":"Fallout Ghouls by Kazcor","Author":"Kazcor","Submitted":20080124,"Updated":20080124,"Category":"PC Parts","Model Format":"BioWare Standard","Polycounts":"low","Forums":"Link","Description":"This is an old pak of Fallout ghouls head made by Kazcor I'm posting here. It was buried in the old archives of d20mm and thought some people might like to use this.\n\nThanks Kazcor about this, if you read this, please email me.\n\nJez","Rating":10,"Awards":[]},"423":{"Title":"Whitefall Heads","Author":"Jez/Others","Submitted":20080124,"Updated":20120406,"Category":"PC Parts","Model Format":"BioWare Standard","Polycounts":"not much","Forums":"Link","Description":"This is a massive compilation of heads I did for my PW Whitefall. Most heads can be found on the Vault, but a lot comes from too many haks and sources to remember, lots have been modified and/or been retextured and some are exclusive.\n\nIt is not only a compilation but also a massive rework of most heads. To start with all female are 1.66 compliant (neck problem, though some might be seen as \"short necked\", thats life...)\n\nFemales head have lips color on tatoo 1, and eye color on tatoo 2 (Some also have tatoo or accesories based on cloth colors)\n\nMales have eyes color to tatoo 2 too (say that, its funny)\n\nAlmost all have eyebrow color according to hairs.\n\nAlso as it was done for a modern PW, some girls head may have some dark blush (not sure thats the correct english name)\n\nThere is 213 Female heads, and 191 males. Remember that some numbers can't be chosen at character creation screen and others can't be used in aurora for NPC's (050 to 099, and 200+). You may have to renumber those you want to use and/or use ingame head changer script like Body Tailor.\n\nOh and sorry but there is only \"normal\" phenotype and only humans.\n\nCredits and thanks to Kazcor and D20MM, Lisa, Taina, CODI, DLA, Colisifu, NewByPower/Claude for his SoulCalbur model and a lot I lost track of, sorry guys :/\n\nAnyway, enjoy!\n\nupdate: added more preview images\nupdate2: added more pics again\nupdate3: added more credits\nupdate4: added heads for override ","Rating":9.96,"Votes":27,"Awards":["Hall of Fame"]},"424":{"Title":"Talim's Soulcalibur halfling head","Author":"NewByPower","Submitted":20080127,"Updated":20080128,"Category":"PC Parts","Model Format":"BioWare Standard","Polycounts":"Not much","Description":"This is a halfling head version by request, of the very nice model by NewByPower Link\n\nJez","Rating":10,"Awards":[]},"426":{"Title":"Mosque2 model 3x3","Author":"PC_Maniac","Submitted":20080302,"Updated":20080303,"Category":"Buildings","Model Format":"MDL","Description":"This is completly model great mosque (from my 1001 Arabian Nights tileset):\n3x3=9 mdl file.","Rating":9,"Awards":[]},"427":{"Title":"Mosque1 model 3x3","Author":"PC_Maniac","Submitted":20080302,"Updated":20080303,"Category":"Buildings","Model Format":"MDL","Description":"This is completly model (my first model :oP) great mosque (from my 1001 Arabian Nights tileset):\n3x3=9 mdl files.","Rating":10,"Awards":[]},"428":{"Title":"4 gazebos","Author":"PC_Maniac","Submitted":20080302,"Updated":20080303,"Category":"Buildings","Model Format":"MDL","Description":"Gazebo models (from my1001 Arabian Nights tileset):\n1. (1x1)\n2. (1x1)\n3. (2x2)\n4. (2x2)\ntextures pack","Rating":10,"Awards":[]},"429":{"Title":"Palace pack (with walkmeshes)","Author":"PC_Maniac","Submitted":20080302,"Updated":20080303,"Category":"Buildings","Model Format":"MDL","Description":"52 elements of palace (from my1001 Arabian Nights tileset).\nFiles included:\n52x files mdl\n1x file 3ds\n1x file max","Rating":10,"Awards":[]},"430":{"Title":"Bioware weapons replacement pack","Author":"al3xcss","Submitted":20080501,"Updated":20080523,"Category":"Weapon","Model Format":"MDL","Description":"Original Bioware weapons replacement:\n- Bastard sword\n- Battle axe\n- Club\n- Dagger\n- Greataxe\n- Greatsword\n- Kukri\n- Mace\nLooks good!\nMaybe it will be updated with other weapons too.\nCredit goes to the authors, these are not my models, I only compiled them.\nExtract, and put it to the override folder without the subdirectories of course. Overwrite everything.\nEnjoy!","Rating":9.71,"Votes":8,"Awards":[]},"431":{"Title":"Total Female Body Rebuild","Author":"Kino","Submitted":20080608,"Updated":20080614,"Category":"PC Parts","Model Format":"MDL","Polycounts":"1128","Description":"Well, that's it. This is my first submission to the vault and my first mod for NwN. I always thought that the base model for the female characters was pretty poor and that the modern hardware was a little bit wasted for a 8 years old game (or something like that), so... why don't waste some polygons to create a better model? on the Vault I've found improved version of chests, hands and feet, but never a complete model.\n\nThe greatest limit in modelling a body for NWN is that the original structure must be respected, this means that can't be a perfect connection between the parts, that the proportions can't be changed and that the mesh is always not fully optimized. In order to overcome those limits I'm trying to find a way to replace the base nude model with a Robe model using an override file, any help for this thing would be truly nice.\n\nWhen I'll be satisfied with the result with this mod I'll convert/create the model for all the races.\nWhen this project will be completed I'll improve the male model and then some armors.\n_____________________________________\nThe pack contains the mdl file for the human female naked body and some textures. All the texture are heavily modified versions of Jacen Arkana's chest texture and Ogre Mage's.\n\nThe models are 100% mine, the pack includes chest, pelvis, arms and legs; for better result use this pack in combination with KuraiRyu hands/feet pack, you can find it here Link\n_____________________________________\n\nUpdate:\nVersion 0.3 is out\n\nChangelog:\n-Some minor changes to the pelvis model\n-Chest model has rib cage and shoulders lowered (now the neck looks a little bit longer).\n-Chest model has forked in two versions, one with the \"old\" breasts and one with smaller, more realistically shaped breasts; both the models exists in jiggly and rigid version\n-Some minor changes to the base textures\n-Big changes in model skinning, now the textures work a little bit better. New templates are in the pack\n-Added 2 new underwear textures (they are identical, but one is white and the other one is black), those texture are 512x512 instead of the usual 256x256 in order to keep visible underwear details.\n\n_____________________________________\n\nUPDATE:\nVersion 0.2 is out. Changelog:\n-New legs and arms in order to reduce poly count\n-Modified chest and pelvis with broader waist and structure optimization\n-Modified textures with some improvements, both nude and with underwear, now there is also an hairy version of the pelvis.\n-Added a non-jiggly version of the chest, so now you can just chose the one you wish.\n-Added the pelvis and chest texture template with the model wire.\n\nBy the way both on new and old model the texture for the standard model should work pretty fine\n\n_____________________________________\n\nVersion 0.1. The pack contains:\n-New models for legs, arms, chest and pelvis for the human female\n-2 texture pack (both nude and with underwear)\n\nThe model is has a very high poly count and an extremely thin waist, use of model 0.2 is recommended\n_____________________________________\n\n\nWarning: the model (with KuraiRyu's feet) is pretty heavy: 1034 vert, 1128 poly, 1786 triangles. On slow machine it could give a bad performance loss, anyway on my laptop with a T7100@1,8ghz and a 8600gt just work fine (no performance loss at all).\n\nInstallation:\n-Open the archive and extract the .mdl files you wish to use in the override directory, notice that there are different chest models, look at the screens to chose the one you prefear.\n-Chose the texture you wish to use and extract the .plt file in the override directory, however the \"normal\" chest mesh doesn't look good with underwear textures, it's not a tecnical problem, simply the shape looks wrong. Keep in mind that nude and standard underwear textures works well with standard models, my modified underwear pelvis textures don't. Notice that you can mix textures as you wish (for example you can use the underwear pelvis texture and the nude chest).\n-In order to make the texture work you have to open Texture_Tpa.erf in the texturepacks directory (you could do this with erfedit.exe), delete \"pf0_chest001\" \"pf0_chest002\" \"pf0_pelvis001\" in the .plt section and save the file (Warning: backup the file before editing it).\n____________________________________\n\nFiles moved to my own web space, I have some problems uploading the files to the Vault, I hope everything works fine","Rating":7.65,"Votes":7,"Awards":[]},"432":{"Title":"Drider animation fix","Author":"kroko","Submitted":20080828,"Updated":20080828,"Category":"Other","Model Format":"MDL","Description":"This will fix lack of animation when Drider form of Shifter is attacking from close range. There was no c1stab animation so i just copied another attack animation and name it c1stab, so there is no new animation. Just copy to override folder. I dont know how many people encountered this bug, i know of 3 so im uploading it, maybe some people will use it. ","Rating":10,"Awards":[]},"433":{"Title":"Centaurs racialtypes system (beta v5b)","Author":"PC_Maniac (PBC)","Submitted":20080920,"Updated":20081007,"Category":"Monsters","Model Format":"Other","Description":"Centaurs racialtypes system (v.beta 5b).\n\nIncluded: \nCentaurs.hak\nmodified cep21_v1.tlk\nCentaurs.mod (micromod demo)\ncentaurs.erf with 7 examples models)\n\nVersion requires NWN1.69 & CEP 2.1\n\nFor the final version, unfortunately, there is a need for models hides torso horse designed by Hardpoints, as are my ugly.\n-------------------\n-In beta 3 pelvis removed from the human body.\n-------------------\n-In beta 4 Horses skin from hair-color (with damaged animations).\nRemoved belt from human clothes (conflict with the torso horses).\n-------------------\n-In beta 4-Revised\nList:\nWalnut (no.01)\nGunpowder (no.02)\nSpotted (no.03)\nBlack (no.04)\nNightmare(no.05)\nWhite (no.06)\nHair-color (no.07)\n-------------------\n- In beta 5 - Increased human body by 25%. Reconstructed Centaurs animation. The first attempt to use a robes.\n-------------------\n- In beta 5b - The second attempt to use a robes.\n-------------------\nIn the final version will include classes and special skills for the Centaurs.\n\nThank you all for voting.","Rating":10,"Awards":[]},"434":{"Title":"Xaltar's Head and Underwear packs","Author":"Xaltar","Submitted":20081205,"Updated":20090601,"Category":"PC Parts","Model Format":"MDL","Polycounts":"very high","Forums":"Link","Description":"This is my attempt at improving the default underwear and head models for humans. I will likely do other races in time but for now only humans are covered.\n\nI have remodeled every part except the male pelvis seeing as that looks ok as is (still tweaked a little). All models are my own work, nothing has been borrowed from other modders.\n\nAll models work with the origional game textures. The reason I did this is to keep the download size down whilst still providing a significant visual upgrade over the stock models.\n\nThanks to the author of NWMax, Bioware and everyone here at the vault.\n\nMajor update. Female torso now conforms to nude skins available in the vault and now jiggles :P\n\nFemale pelvis is better unwrapped and the thigh joints are improved.\n\nEnjoy the pack and feel free to leave comments and suggestions, I don't have a lot of time to work on this but I will do my best.\n\n[edit]\nI have started making more new heads but this time with their own textures. These heads are designed to be easy to reskin for anyone who has the urge and have the eyes mapped to their own space. This means that having tintable eyes is much easier to achieve.\n\nSo far I have 4 new textured heads. 2 male and 2 female as well as the older model only heads. The new heads are for a module I am planning so they are based off concept sketches I have been working on for the characters. \n\nFeel free to use my stuff in your own modules or edit them as you choose. All I ask is that I be credited.\n\n[edit 27/12/08]\n\nAdded 2 elf heads, 1 male one female. I will start out with one of each gender for each race then add to it like I have with the human pack.\n\nUploaded in a separate pack for ease of download.\n\n[30/12/08] Removed old heads without PLTs from pack. You do not need to redownload the pack as nothing else has changed. I will be redoing the heads and adding them again in the next few weeks.\n\nDon't forget to vote :P\n\nPlease note, my forums require registration to see the boards and once registered you will need to PM me to get posting rights. This is in an effort to keep the boards spam free. I will be releasing beta heads on my boards and on my boards only so you may want to get in on the action ;)\n\nThanks:\nThe author of NWMax (Joco)\nBioware\nWhatbrick\nThe Vault\nThe voters :P\n\n[edit]12/01/09\nTint pack incorporated to the head pack and redundant pack deleted.","Rating":9.94,"Votes":35,"Awards":["Hall of Fame"]},"435":{"Title":"Head model collection used by DLCO (Dragonlance Chronicles Online)","Author":"unknown","Submitted":20090114,"Updated":20110815,"Category":"PC Parts","Model Format":"Other","Forums":"Link","Description":"These are the head-files used within the server-mod DLCO (Dragonlance Chronicles Online). The original source is lost. I just packed them up.\nUnpack and place them into your NWN-override-folder.\nIt does NOT contain specific Dragonlance-heads (e.g. Tanis, Raistlin... )! Still, it's a very nice collection.\n\nEDIT: \nSome of the heads seem to mess up NWN / CEP-heads (though, it did not occur to me). There is a \"revised package\" (= sorted) to be found here: \nLink","Rating":10,"Awards":[]},"436":{"Title":"Goudea's head","Author":"Goudea","Submitted":20090215,"Updated":20090216,"Category":"PC Parts","Model Format":"MDL","Polycounts":"1800","Description":"This is my head. \nIn fact, someone on the Bioware boards gave me the idea, some time ago. \nAnd I thought that would be a funny thing to play with my own head as a dark sorcerer or a modern soldier ... \nSo I finally took the time to make it. \nI hope you'll like it. \nIt's a bit \"heavy\" in polycount, but I thought I would deserve at least 1500 polys. I did not noticed any problem while testing it. \n\nTo test it, simply put it in the override and it would be available in the toolset. \nYou can customise the colour of the eyes using tattoo 2.\nTo allow player using it at character creation, simply rename the files to the next head number you have. \n(I am still running in 1.68, so I don't know the number for 1.69) \n\nThanks. ","Rating":10,"Awards":[]},"437":{"Title":"Carcerian's Werewolf, non replacing","Author":"Big_Shoe","Submitted":20090307,"Updated":20090307,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Non-replacing version by Big_Shoe. All credit goes to Carcerian, whose original work (with more screenshots) can be found here:\n\nLink\n\nThis is simply a non-override version of Carcerian's werewolf model, which was itself based on a reskin by Lord-of-Worms. It requires some hak editing to install and use, but it does not replace the BioWare default werewolf model, and allows both models to be used in the game.\n\nAll credit goes to Carcerian and Lord-of-Worms, who did all the real work on this model.","Rating":10,"Awards":[]},"438":{"Title":"NWN2 Houses as tiles","Author":"Joern Preine","Submitted":20090411,"Updated":20091223,"Category":"Tileset","Model Format":"MDL","Description":"This is no longer supported. I fixed the models and made a complete tileset from them which you can find here: Link.\n\n\n[These are the first NWN2 houses I reskinned and converted to NWN1 tiles.\nThey were meant to go into the TNO tileset, hence the ground height is at 5.0 instead of 0.0. I put them in the micro-tileset so you can have a look at them. They worked fine in the toolset, but they crash the game and I can't find out why. I strongly suspect it has to do with the walkmeshes. Feel free to use them in your own tilesets if you know what's wrong with them and can fix it. If nothing else, you could use the textures for the NWN2 house placeables by TheGeorge.]","Rating":"N/A","Awards":[]},"439":{"Title":"Additional Items","Author":"Friedeyes","Submitted":20090427,"Updated":20100810,"Category":"Item","Model Format":"MDL","Description":"These items are a gift. Do as you desire with them; consider them open content without reservations. They were custom made, on request. \n\nHere are some models you can use to stop the bag from showing up when you drop an item on the floor.\n\nAdd the boot item name to your baseitems 2da. (One is included)\n\nLine # 26 replace it_bag under default model with it_ru_boots.\n\nFor the magic bags (bigbox), just drop them into a hak and they work whenever you drop a bag or box.\n\nAlso, included are three bags with textures for M. Helling Rogue/Assassin HAK Bag icons (not included).\n\nLink","Rating":10,"Awards":[]},"440":{"Title":"ACP compatible ACAG robe parts","Author":"Valine","Submitted":20090506,"Updated":20090506,"Category":"Armor","Model Format":"MDL","Description":"Hello. Have you ever wanted to use ACP v4 in ADwR or another mod which uses ACAG, but were annoyed to find the skirt parts didn't quite sync up? Well, have no more fear; what you need is here.\n\nThis zip file contains the robe mdls necessary for ACP's phenotypes. All I did was replace some text, but believe me it could have been tedious. I seriously would not recommend doing something like this without a program like notepad++ which allows you to open multiple files and replace text in all of them. So basically I'd like to emphasize how small my contribution is here.\n\nBecause you may want to use this in versions of ACAG other than the latest, because uploading a modified version of a hak you probably already have would make for an unnecessarily large download for you, and because I'm not entirely comfortable uploading a file that would be almost identical to the authoress' own (which might reasonably be expected to be updated in the future besides), I've included only the mdls.\n\nInstallation\nTo use this, you'll need to open whichever ACAG you want to modify (at the time of this writing ACAG105 is the latest) with a hak editing tool. You should have BioWare's nwhak.exe in your /utils directory, but there are others on the vault just in case. Then you simply use the tool's function to add the mdls to the hak.\n\nIt's that simple.","Rating":"N/A","Votes":0,"Awards":[]},"441":{"Title":"head additions","Author":"Jennie from Phoenix Rising","Submitted":20090607,"Updated":20090608,"Category":"PC Parts","Model Format":"MDL","Description":"These are heads from the author of the head pak from the server Phoenix Rising. I've had them saved even after the server went missing. Not mine...though I hope the author enjoys that her work lives on after her.","Rating":"N/A","Awards":[]},"442":{"Title":"Ornate Longbow v2.2 (Override)","Author":"Lathspell/SushiSlave","Submitted":20090611,"Updated":20090930,"Category":"Weapon","Model Format":"Other","Description":"I have provided an override alternative to Lathspell's Ornate Longbow v2.2 HAK. Simply extract the files into your override folder, and the ornate longbow will replace the first slot of standard BioWare longbow. \n\nLook up my name in the search bar for more override alternatives to popular HAK files. \n \n\n","Rating":9.75,"Votes":1,"Awards":[]},"443":{"Title":"Bioware's Mass Effect M7 v2 (Resize and variants)","Author":"Bioware/Jez","Submitted":20090720,"Updated":20090720,"Category":"Weapon","Model Format":"BioWare Standard","Description":"This is a remake of my previous version Link\n\nResized the weapon to a more realistic size, plus added 3 more color variants\n\n","Rating":10,"Awards":[]},"444":{"Title":"Spectacled Head","Author":"Ben Harrison","Submitted":20090803,"Updated":20101102,"Category":"PC Parts","Model Format":"MDL","Polycounts":"348","Forums":"Link","Description":"This resource consists of a single head for the elven male body; a scholarly, spectacled human. It was created at the specific request of a community member.\n\nPlease view the included readme file for more information.\n\nThis mod is no longer supported in any way (I've left the NWN community), but you're all free to update, modify, and re-distribute my content without restriction, as ever. Have fun!","Rating":"N/A","Votes":0,"Awards":[]},"446":{"Title":"KD Male Pelvises","Author":"kittydragon","Submitted":20091118,"Updated":20091118,"Category":"Armor","Model Format":"Other","Description":"Many have complained that the male nudes don't have as many options as the herms, so I have converted the files to work for males. I will resize and adjust them to look more like male-shaped pelvises in the future.\nFiles taken from the JenX collection.\n\nJust put the files in your override folder, but be warned: they may replace other files if they use the same number slot.","Rating":"N/A","Awards":[]},"448":{"Title":"Modern media kit","Author":"Jez","Submitted":20091215,"Updated":20091215,"Category":"Item","Model Format":"BioWare Standard","Polycounts":"not much","Description":"This is a quick model set I did for d20mm, with holdable microphones (2 versions) and camcorder, and big news camera as placeable.\n\nHow to use:\n\n- Put all files in your hak\n- edit your current placeables 2da to add jzp_ncam01 and jzp_ncam02 models (both are cameras)\n- create new torch item and select appearance number 021 to 023 (for microphones and camcorder)\n- create 2 placeables blueprints and select the camera placeable models.\n- enjoy!\n\nThis should be in D20mm 2.0 haks so if you use them, don't bother with this =)\n\nJez\n","Rating":10,"Awards":[]},"449":{"Title":"Humvee","Author":"unknown / conversion by Jez","Submitted":20091217,"Updated":20091218,"Category":"Placeables","Model Format":"BioWare Standard","Polycounts":"not much","Description":"A green Humvee of quite good quality, from unknown author, but source is probably FPS creator.\n\nI just converted it to NWN format. Enjoy.\n\n","Rating":10,"Awards":[]},"450":{"Title":"Horse statue","Author":"Jez","Submitted":20091218,"Updated":20091219,"Category":"Placeables","Model Format":"BioWare Standard","Polycounts":"1064","Description":"A statue of a horse on a marble stand.\n\nNWN conversion and adaptation of an original model and texture from Hitman Blood Money by Eidos/IO interactive, an excellent game I recommend.","Rating":10,"Awards":[]},"451":{"Title":"Modern bloody notes","Author":"Jez","Submitted":20091218,"Updated":20091219,"Category":"Placeables","Model Format":"BioWare Standard","Polycounts":"phew","Description":"Some modern looking notes, with blood stains...\n\nsee readme.txt for instructions.\n\nNWN conversion of original model and texture from Hitman Blood Money by Eidos/IO interactive, an excellent game I recommend.","Rating":10,"Awards":[]},"452":{"Title":"Additional Armor","Author":"Friedeyes","Submitted":20100103,"Updated":20120824,"Category":"Armor","Model Format":"MDL","Description":"This shield is a gift. Do as you desire with it; consider it open content without reservations. It was custom made from scratch, on request.\n\nRe-number, re-name or modify as needed.\n\nThis shield was made as an Artifact for a dwarf only. It�s made to only fit in a male�s hand, but can be adjusted to fit a female. The scaling makes it look too big on other races. As an Artifact; it is made from a laminate of two rare metals, hammered thin by a master dwarf shield smith. (I lost my notes on the metals; Mithril on the inside and a rare anti-magic metal laminated on the outside. I no longer remember the metal name.)\n\nMay 21, 2011 updated\n\nRemapped original shield & additional shields for easier re-texturing.\nAdded a second shield with an adjusted hand rest to fit better with the female pheno.\nAdded a the third shield, made for fun.\nAlso, a mapping texture was included named \"friedshieldt\".\nRenaming the texture to overwrite the original shield texture will give an idea of the shields mapping.\n\nFriedeyes","Rating":10,"Awards":[]},"453":{"Title":"SPL Shield Variations","Author":"garrison","Submitted":20100203,"Updated":20100301,"Category":"Armor","Model Format":"MDL","Description":"These are shield variations I made for Skullport Legends including a few color varitions of Friedeyes Dwarven Shield. \n\nUpdate 01 March 2010, see screen shots.\n\nUse as you like.","Rating":10,"Awards":[]},"454":{"Title":"Snowball Override","Author":"The Amethyst Dragon","Submitted":20100204,"Updated":20100205,"Category":"Weapon","Model Format":"MDL","Forums":"Link","Description":"This simple override transforms the basic dart into a snowball.\n\nChanges:\ndart 1 icon\ndart 1 model\nin-flight dart model\n\nThis was used for my snowball fight submission for the winter screenshot contest. I figure folks could just have some fun with it, since it doesn't affect what everyone else sees in the game.","Rating":9.75,"Votes":6,"Awards":[]},"455":{"Title":"Up/Down Arrow Placeables","Author":"Ben Harrison","Submitted":20100404,"Updated":20101102,"Category":"Placeables","Model Format":"MDL","Polycounts":"4","Forums":"Link","Description":"This modder's resource consists of up- and down-pointing versions of the coloured arrow placeables in NWN. The only texture required is a standard game resource (assuming your game is up to date), so only the .mdl files and 2da entries are included.\n\nPlease view the readme file for more information.\n\nUpdate, 06/04/2010\n� Added CEP 2.3-compatible 2da\n\nThis mod is no longer supported in any way (I've left the NWN community), but you're all free to update, modify, and re-distribute my content without restriction, as ever. Have fun!","Rating":"N/A","Votes":0,"Awards":[]},"456":{"Title":"Warhammer 40k Pack","Author":"Xialya","Submitted":20100530,"Updated":20101030,"Category":"Item","Model Format":"MDL","Description":"Some stuff I made for a WH40K mod.\nThere are mostly weapons (ranged and melee), placeable weapons (heavy bolter, lascannon) also, placeable banners, equip-able banners (as wings), and a Space Marine helmet.\n\nI'm not proud of my textures but they look okay enough.\n\nThe weapon models are made to work on the DHCRS, so you'll certainly have to rename them in order to work on your mods.\n\nI am no longer working on these for now, but I might sometimes add a couple of new models if I have time to get back on this project.","Rating":9.67,"Votes":16,"Awards":[]},"459":{"Title":"Tessellated original head models","Author":"Awogayheru","Submitted":20100731,"Updated":20100812,"Category":"PC Parts","Model Format":"MDL","Polycounts":"700 to 900","Description":"Just tessellated, added something details and a bit modified bioware's original head models.\nI have something inspired from old Idea Database,and I made these models to experiment on an effect.\nThese models are overridable,and using original head textures.\nSo they have no separated eyeballs,eyelashes,nose or ear holes,and no mouth interior.\n\nFor the alternate model of pfh0_head004,\nSince I have been suggested from several persons that earrings are better to be shrunk ,\nI have shrunk her earrings about to her chin line.\n\nThey are not so effective in game, but if someone liked it,use it.\n","Rating":10,"Awards":[]},"460":{"Title":"Additional Placeables","Author":"Friedeyes","Submitted":20100810,"Updated":20111107,"Category":"Placeables","Model Format":"MDL","Description":"These placeables are a gift. Do as you desire with them; consider them open content without reservations.\n\nThe Demon was made as a storage chest.\n\nThe Surgeon�s bed was made for a head changer area that wasn't used.\n\nThe Cornstalk was made for a quest, copied from a Bioware tile model.\n(A corn item is posted in that category)\n\nThe Hanging Man was made as a joke with Q2 sounds in our haks. \n(�Kill me now, it hurts�- a tribute to ID software and Quake. Sounds not included here.)\n\nNovember 7, 2011\nAlso, added a lamp post with ambient and non-ambient. \nPortraits for some included.\n\nFriedeyes","Rating":10,"Awards":[]},"461":{"Title":"Custom Content Challenge August 2010 - High Priestess� Chamber","Author":"CC makers","Submitted":20100917,"Updated":20120106,"Category":"Placeables","Model Format":"BioWare Standard","Polycounts":"not much","Forums":"Link","Description":"Here are the results for the \"Custom Content Challenge\" of August 2010 that took place on Bioware Social Forum here: Link\n\nThe theme was: \"Imagine the private appartments of a High Priestress/Cleric, and design a usefull piece of decorative furniture that would fit well in there.\"\n\nAnd here are the results of the variouses participants!\n\nThanks to all those who contributed models:\nBen Harrison, wargear set\nEstelindis, an altar\nJFK/Frith5, a prayer kneeler and book\nJez, a hanger with ceremonial cloak and empty\nMorikhan, a rich desk\nSix, a shrine\nZwerkules, a swan bathtube\n\nAlso thanks a lot to the supporters!\n\nHow to use:\nThese are only models and their textures. To use this you have to include those files in a hak, and add the placeables_lines.2da to your own placeables.2da (Copy paste the lines, and renumber approprietly if the numbers we used are already taken in your own placeables.2da)\n\nOnce it's done, open your module in aurora (add the hak if not yet included in the module's custom content list), and then you have to create a blueprint for each of the models. You can find the models under the appearance names starting with \"CCC08_2010\".\n\nCheers, and come and join the fun for September challenge here: Link Pirates!\n\nUpdate: Sept. 19, 2010\n- added Zwerkules swan screenshot\n- added a ready to use hak, and demo module\n- added fixed placeables.2da lines\n\nUpdate v2: January 6, 2012\n- added portraits\n- updated Vault description and title","Rating":10,"Awards":[]},"462":{"Title":"Ophidian Medusa //Version 1.0","Author":"Xialya","Submitted":20101005,"Updated":20101005,"Category":"Monsters","Model Format":"MDL","Description":"Inspired by the Medusa in the Clash of the Titans movie I decided to make this model.\n\nThis is the 1.0 version.\nI might work a bit more on some animations in the future.","Rating":10,"Awards":[]},"463":{"Title":"Magical Key","Author":"Builder__Anthony","Submitted":20101012,"Updated":20101013,"Category":"Placeables","Model Format":"gmax","Polycounts":"381","Description":"My first model untextured.","Rating":"N/A","Awards":[]},"464":{"Title":"Wicked Traps","Author":"Xialya","Submitted":20101013,"Updated":20110227,"Category":"Placeables","Model Format":"MDL","Description":"These are nasty traps to give your players a bit of a challenge in your dungeons.\n\nInside this package you will find:\n\n- A spear trap placeable with On/Off animations and sound.\n\n- A rolling rock trap for the Indiana Jones feeling.\n\nYou may watch these videos showing my traps:\n- Spear Trap\n- Rock Trap (Please note that the texture has changed between the video and the release)","Rating":10,"Awards":[]},"465":{"Title":" Marks VFX","Author":"Xialya","Submitted":20101030,"Updated":20101106,"Category":"Other","Model Format":"MDL","Description":"This pack contains a question mark, an exclamation mark and a dollar sign VFX.\nThere is a grey and a yellow version for each.","Rating":10,"Awards":[]},"466":{"Title":"Flag String","Author":"Xialya","Submitted":20101030,"Updated":20101031,"Category":"Placeables","Model Format":"MDL","Description":"A string of triangular flags you can lay across a street in your favorite cities for their parades and festivals. \n","Rating":9.83,"Votes":5,"Awards":[]},"467":{"Title":"GOG Contest: DRM Monster","Author":"Hellfire_RWS","Submitted":20101212,"Updated":20101212,"Category":"Monsters","Model Format":"BioWare Standard","Description":"Hi All!\n\nHere are the results of the GOG NWN1 Model Contest.\n\nThe winner of the DRM Model Contest: Hellfire_RWS! \n\nHis interpretation of the DRM Monster as Lars Ulrich of Metallica is sure to earn him a few giggles and a few enemies to boot� As the winner, Hellfire_RWS gets three free games compliments of GOG.com. \n\nHere is the official announcement:\n\nLink","Rating":9.5,"Votes":0,"Awards":[]},"468":{"Title":"Dragonrider / Mounted Dragon","Author":"TheOneBlackRider","Submitted":20110120,"Updated":20110815,"Category":"Other","Model Format":"MDL","Forums":"Link","Description":"Mounted Dragon Model - \nNote: These are not models like horses! It's one model consisting of dragon and rider!\nThey are adjusted/corrected versions based on Adam Miller's dragonmodels in his module \"Dreamcatcher 3 - Pit of Stars (1.09)\" to be found here:\nLink\nMany thanks for creating these models!\nMeanwhile the Dreamcatcher-models are also part of CEP 2.3(+)\n--------------------------------------------------------------------------------\n-\n\nBesides those little corrections (See screens and below), I wanted these models to be usable for players. For this, the PC would have to change the appearance into that of the drigon&rider-model.One problem was, that the original hooded riders didn't have a mask, so a bearded PC would have a different face as a dragonrider. Another problem was, that the clothing / coloring of the clothes of the original dragonriders cannot be made as an armor-item = no PC-armor model would match the riders textures. Either model or color would not match.\n\nSo I remodeled the dragonrider head in 2 versions: One with a mask and one with a helmet (NWN-helm020). And I retextured the dragonrider-models in a way, that their clothes can be also created as (N)PC-armoritems. In addition, I created a dragonrider-model with a helm (NWN-type 20).\n\nModelvariations:\nHood 1 = hood with mask, org body texture\nHood 2 = hood with mask, retextured body\nSame for Helm1/2\n\nCorrections on the original model:\n- Right leg of female rider model.\n- Hands of female rider model.\n- Removed bodyscale of dragon, so riders don't sit on the scales.\n- Added a (simple) saddle texture.\n- Casting animation exchanged. (If a PC was activating an item while in the shape of a dragonrider-model, the model played a \"jerky\" animation. This is replaced with one more smooth.)\n\nThe appearance.2da is based on CEP 2.3 (Jan. 2011). The dragonrider-models start with \"[BR]...\" beginning in line 7000.\nNOTE: The CEP23-model-names will show, but if the CEP-haks are not in the mod, they are not chooseable! But, it's CEP23 compatible. If you don't want the CEP-part, just copy line 7000+ into your own appearance.2da.\n\n(PC-) Headmodels:\nThere are no masked headmodels for humans. So I took them from (N)PCs (c_ynpc_h_m04 and pfh0_012 with a rescaled & remodeled mask from c_ynpc_h_m04) to make heads matching the drigonrider-heads.\nTo keep it CEP compatible, I gave them No. 170 (which is not used by CEP):\npfh0_head170, pmh0_head170\nHeadmodels for \"large\" (pfh2_head170, pmh2_head170) are included, but they are only copies of type \"normal\".\nTHESE ARE IN A SEPERATE HAK! You could also extract them and put them into your override folder.\n\nKnown issues:\n- The base of the model is on the ground, so when you zoom towards the model IG, you will at one point end up below the model. Keep playing with the view until you found a nice angle.\n- Since NWN was not made for \"flying models\", the models are treated like creatures on the ground. This means, everything, that is an obstacle to a ground-creature (eg. tileset-wise or placeables) is also an obstacle to the flying dragon, even if it's above/over the obstacle!\n\n\nVersion notes:\n\nV1.0 (Jan. 2011):\nFirst release.\n\nV1.1 (March 2011):\nFixed a flaw within the animation of the female dragonrider models.","Rating":10,"Awards":[]},"470":{"Title":"Ladies Bonnet","Author":"Navarian","Submitted":20110219,"Updated":20110219,"Category":"Item","Model Format":"MDL","Forums":"Link","Description":"This model is an original inspired by coulifsu's conical hat which obscures the upper part of the face. The bonnet was designed for Wheel of Time: A New Beginning server to meet the needs of cultural clothing.\n\n\nSkin is leather 1, hair is leather 2, Bonnet is cloth 1, lips are cloth 2 and the ribbon is metal one. Making it fully customisable.","Rating":9.75,"Votes":1,"Awards":[]},"471":{"Title":"Chariot Statue","Author":"Borden Ha'elven","Submitted":20110310,"Updated":20110311,"Category":"Placeables","Model Format":"MDL","Polycounts":"8929","Forums":"Link","Description":"My entry for this months custom content challenge. It's a placeable based on a tileset statue I made for my upcoming Egyptian Temple complex. It has a high poly count so use sparingly.","Rating":9.88,"Votes":2,"Awards":[]},"472":{"Title":"Lost Dale Weapons","Author":"Various","Submitted":20110416,"Updated":20110417,"Category":"Weapon","Model Format":"Fan Skin","Description":"This is an override pack of weapons for an RP server.","Rating":"N/A","Awards":[]},"473":{"Title":"Lost Dale Shields","Author":"Various","Submitted":20110416,"Updated":20110417,"Category":"Armor","Model Format":"Fan Skin","Description":"A compilation of shield overrides for an RP server.","Rating":"N/A","Awards":[]},"474":{"Title":"5 Egyptian Statues","Author":"Borden Ha'elven","Submitted":20110420,"Updated":20110713,"Category":"Placeables","Model Format":"BioWare Standard","Description":"5 Egyptian statues, Horus, Anubis, Bast, a falcon headed sphinx and an ankh. The 2da entries are 301 to 305 in the placeables 2DA.\n\n13:07:2011\n\nRe-skinned and rebuilt Huros, Anubis, Bast and Falcon statues.","Rating":10,"Awards":[]},"475":{"Title":"***","Author":"***","Submitted":20110705,"Updated":20120513,"Category":"Buildings","Model Format":"3DS","Polycounts":"***","Description":"***","Rating":"N/A","Votes":0,"Awards":[]},"476":{"Title":"Ring Stargate Teleporter","Author":"MrKure","Submitted":20110806,"Updated":20110807,"Category":"Animation","Model Format":"Other","Description":"Just a teleport based on Stargate ring teleport. Contain test module and hak file.","Rating":10,"Awards":[]},"477":{"Title":"New Weapon Visual Effects (VFX) - NWNCX","Author":"The Amethyst Dragon","Submitted":20110806,"Updated":20120128,"Category":"Weapon","Model Format":"MDL","Forums":"Link","Description":"This package contains 44 new visual effects for all weapon types (default weapon types and many CEP weapons). These visual effects are NOT intended for use as an override...they are ADDITIONAL, non-overwriting visuals.\n\nImportant: NWNCX (Neverwinter Nights Client Extender) is required on the PLAYERS' side in order for them to see these visual effects.\n\nIn order for players to be able to see the visual effects in-game, \nyour players will need:\n- the contents of this hak file\n- the current version of NWNCX (Neverwinter Nights Client Extender)\n\nAug. 9, 2011: Added demonstration module.\nJan. 22, 2012: Added separate iprp_visualfx.2da file for downloading to your NWN/override folder for playing modules that don't use the NWNCX visuals hak. Needed only for installations of NWNCX prior to version 0.2.1.","Rating":10,"Awards":[]},"478":{"Title":"Shambler from Quake","Author":"jestemwlodzimierz","Submitted":20111016,"Updated":20111017,"Category":"NWN2 Model Contest","Model Format":"BioWare Standard","Description":"The epic enemy form Quake 1.\n\nI also added a custom spell for him - a form of an electricity bolt ;D","Rating":10,"Awards":[]},"479":{"Title":"Kneeling Animation Fix","Author":"ndbabe","Submitted":20111114,"Updated":20111115,"Category":"Animation","Model Format":"MDL","Description":"This kneeling animation fix changes \"praying\" into a meditative look of \"palms down on thighs\". The animation is favored by many social servers for the look of \"proper kneeling\" in an animation.\n\nORIGINAL CREDIT GOES TO TormentedBlood for giving permission for this to be publically used. He rocks.\n\n(If it turns out I got a wrong file, or this doesn't work feel free to post such.)","Rating":9.88,"Votes":2,"Awards":[]},"480":{"Title":"Reptilian/Draconic Heads Rescaled","Author":"Draxiss","Submitted":20111122,"Updated":20111122,"Category":"PC Parts","Model Format":"MDL","Description":"For now, I'm rescaling the Kobold heads in CEP that go on the halfling bodies. I plan on making more draconic heads that will be a great deal more complex. \n\nI numbered them so that they shouldn't overlap with any other head models, unless you have a HUGE number. \n\nNOTE: These will not appear in the toolset, but they do work. \n\nTo use these as override heads, simply copy the .plt and .mdl files to your override section in the nwn directory. They can be compiled into a hakpak as well, but remember to include the corresponding .plt skins. ","Rating":"N/A","Awards":[]},"481":{"Title":"Reforged: Chain Weapons","Author":"The Amethyst Dragon","Submitted":20111223,"Updated":20130501,"Category":"Weapon","Model Format":"BioWare Standard","Forums":"Link","Description":"Original Release: Dec. 24, 2011\nUpdated: Dec. 27, 2011\n\nThis simple package contains completely remade models and all-new textures for light flails, heavy flails, and morningstars. There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models and new .tga format inventory icons. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nBoth versions include an extra model file: wblfh_t_001.mdl. This model is not actually shown in either the toolset or in-game, but it is necessary since all of the new chain weapon top models use it (indirectly) as an animations supermodel.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nThe basic layout of the weapons has been altered for purposes of better design and improvement to the inventory icons. The \"top\" part is still the chain and head. The \"middle\" part is now the end caps on the handles (both top and bottom caps), and the \"bottom\" is the weapon's grip.\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"482":{"Title":"Reforged: Chopping Weapons","Author":"The Amethyst Dragon","Submitted":20120116,"Updated":20130501,"Category":"Weapon","Model Format":"MDL","Forums":"Link","Description":"Original Release: Jan. 16, 2012\nUpdated: Feb. 18, 2013\n\nThis simple package contains completely remade models and all-new textures for hand axes, battle axes, dwarven war axes, greataxes, double axes, and throwing axes. There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models, new .tga format inventory icons, and a modified baseitems.2da file. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nThe basic layout of the weapons has been altered for purposes of better design and improvement to the inventory icons. The \"top\" part is still the top section. The \"middle\" part is now the end caps on the handles (both top and bottom caps), and the \"bottom\" is the weapon's grip.\n\nThis package includes a change to baseitems.2da to make throwing axes use the same icons/models as hand axes, just as dwarven war axes use the same icons/models as battle axes. If you are already using a copy of this 2da file in another hak, you'll want to change your copy's entries for throwing axes to match the model and icon names for hand axes (leaving all other columns as they are, it's just an appearance change).\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"483":{"Title":"More Asian heads ","Author":"Shemsu-Heru","Submitted":20120128,"Updated":20120130,"Category":"PC Parts","Model Format":"MDL","Description":"First of all I have to say that, I'm not the author of the original models and textures; I have obtain this from websites of free 3D models like:\n\nthefree3dmodels.com / sharecg.com / 3dmodelfree.com / artist-3d.com\n\nI understand that this use don't violate the conditions of those websites, But if the authors or the managers of those sites disagree, I'll have to remove them.\n\nMy work was to removing the heads, from the rest of the full body models, modifying UW maps, modifying and combine textures (just to don't have a big texture file of the full body character, when I only use the head parts), and even in some cases reducing the number of polygons, etc; And you can believe me It wasn't an easy work.\n\nI have made this because I think there are not too much Asian heads in NWN Vault for our oriental campaigns; And the most what be, are base on Japanese characters, what it's good if you are making a module with a Japanese background like L5R; But not so good if you have in mind something more like a Chinese background. Some of this heads are based in Japanese characters but the most of then looks Chinese. It's possible that you recognize some of then because some of the heads are from \"Street fighter\" characters.....\n_______________________________________________\n\nV1.1 Some minor fixes including the compilation of All Heads; Oldtimeradio, I had followed your instructions, even when I did not understand well what I had done I supposed that it made that the models works better; Then MANY THANKS Oldtimeradio :)\n\nV1.2 Added new Vanara heads for elves; I had made it from models & textures of a Morrowind MOD: \"Westly Presents Mang'Chu, The People of the Waters\" Link My Thanks to Westly for it.\n\nAdded too a Nezumi or were-rat mask; I made it from the head of a were-rat model of \"Project Q\" my Thanks to the people of PQ for it.","Rating":10,"Awards":[]},"484":{"Title":"Dungeon Master head","Author":"Shemsu-Heru","Submitted":20120131,"Updated":20120131,"Category":"PC Parts","Model Format":"MDL","Description":"If you are old enough, you could remember an 80s TV serie called \"Dungeons & Dragons\", then you should remember this character:\n\nThis is the DM head for dwarves, halfings & gnomes; personally I always have thought that he was a dwarf, because of his constitution. \n\nPD: This head it's completely my, I have made it by 0.","Rating":9.83,"Votes":3,"Awards":[]},"485":{"Title":"Gypsies","Author":"Shemsu-Heru","Submitted":20120131,"Updated":20120921,"Category":"PC Parts","Model Format":"MDL","Description":"I have made it for my Vistani characters in my Ravenloft module, but I think that the heads also could work well for pirate characters.\n\nContent: 2 human heads, one male & one female. 1 chest part and 1 belt part for all races and sexes in NWN.\n\nThe male head was made from one of the Bioware; The female head is Tika's head with a very few modifications from the HAK: DLA_Lisa: Tika Waylan & Caramon Majere Link My Thanks to Lisa for it.\n\nThe clothing parts was made from Bioware and \"Realms of Mythology Clothing v1b\" HAk Link models, my thanks to the guys of Realms of Mythology too.\n\n-----------------------------------------------\n\nVersion 1.5 Added models for large phenotype, added flexion to some models, new texture for the female chest.","Rating":10,"Awards":[]},"486":{"Title":"Reforged: Smashing Weapons","Author":"The Amethyst Dragon","Submitted":20120316,"Updated":20130501,"Category":"Weapon","Model Format":"MDL","Forums":"Link","Description":"Original Release: March 16, 2012\nUpdated: Feb. 10, 2013\n\nThis simple package contains completely remade models and all-new textures for clubs, light hammers, warhammers, maces, dire maces, and quarterstaves. There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models and new .tga format inventory icons. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nThe basic layout of the weapons has been altered for purposes of better design and improvement to the inventory icons. The \"top\" part is still the top of the model. The \"middle\" part is now the end caps on the handles (both top and bottom caps), and the\"bottom\" is the weapon's grip.\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nNotes on Quarterstaves: For the quarterstaff, top part 1 - color 1 and middle part 1 - color 1 have been replaced by \"blank\" parts, so that a variety of plain staves can be made with just the different bottom parts. In addition, bottom part 4 colors 1 to 4 are a bit different...colors 1, 2, and 3 glow, and part 4 is pure black.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"487":{"Title":"Reforged: Reach Weapons","Author":"The Amethyst Dragon","Submitted":20120419,"Updated":20130501,"Category":"Weapon","Model Format":"MDL","Forums":"Link","Description":"Original Release: April 19, 2012\n\nThis simple package contains completely remade models and all-new textures for halberds, scythes, spears, and tridents. There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models and new .tga format inventory icons. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nThe basic layout of the weapons has been altered for purposes of better design and improvement to the inventory icons. The \"top\" part is still the top of the model. The \"middle\" part is now the end caps on the handles (both top and bottom caps), and the \"bottom\" is the weapon's grip.\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"488":{"Title":"Holy Halos!","Author":"Carcerian/Saduj","Submitted":20120523,"Updated":20120525,"Category":"Armor","Model Format":"MDL","Description":"Holy Halos for all your celestial needs!\n\nUsing neck part 200, these halos match player skin color.\n\nEnjoy!","Rating":10,"Awards":[]},"489":{"Title":"Reforged: Light Blades","Author":"The Amethyst Dragon","Submitted":20120712,"Updated":20130501,"Category":"Weapon","Model Format":"MDL","Forums":"Link","Description":"Original Release: July 12, 2012\n\nThis simple package contains completely remade models and all-new textures for kukris, daggers, short swords, and rapiers. There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models and new .tga format inventory icons. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nThe basic layout of the weapons has been altered for purposes of better design and improvement to the inventory icons. The \"top\" part is still the top of the model. The \"middle\" part is now the both the guard and the pommel, and the \"bottom\" is the weapon's grip.\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"490":{"Title":"Merricksdad's Toolbox for GMax","Author":"merricksdad","Submitted":20120714,"Updated":20130207,"Category":"Other","Model Format":"MDL","Polycounts":"mostly emitters","Description":"Here's my growing script library complete with all current tools.\n\nCurrent Tools Include...\n\n***********************************\n\ntoolWeaponFXFuncs.ms\n\nAdds my custom weapon fx to all selected objects (preferably aurorabases). Use NWMax to export. Creates either replacement weapon VFX or use NWNCX to incorporate new and exciting weaponFX.\n\nCurrent list of effects you can add to weapons:\n*Inner Glow: a simple glow near to the weapon blade. Animated with TXI\n*Outer Glow: a simple glow radiating out from the weapon blade. Animated with TXI\n*Near Glow: a simple glow positioned near the user end of a blade\n*Far Glow: a simple glow positioned near the business end of a blade\n*Mid Glow: a simple glow positioned near the middle of a blade\n*Inner and Outer Glow: adds both inner and outer prefabs at once, using colorEnd as the color for outer glow\n*Flames: uses a unique texture to create small flame fire on a blade\n*Negative Flame: uses a unique texture to create a diablo3 style necrotic fire. Flames are hollow in the center.\n*Firefly: uses a unique texture that rotates in a figure-8 which makes it look like the blade has fireflies coming off it\n*Fog In: creates a vacuous fog effect, drawing particles to the blade\n*Fog Out: creates slowly downward fog from the blade\n*Drip: creates a tiny drip-drop of particles from the blade\n*Snow: creates a snowing effect from the blade\n*Ash: blade emits a trail of ash from the entire blade\n*Cinders: small red particles rotate around the blade, eventually going into it\n*Sparkles: large grain sparkle emitter giving the blade a diablo3 style divine look\n*Wind: (WIP) encircles the blade with windy particles (currently using a texture from old NES game)\n*Tip Star: creates a star near the end of the blade, similar to the sun\n*Runes: creates runes at predefined locations on a weapon, spaced by a dot when needed\n*Inner Glow: super simple full blade emitter, not much different than bioware magic blades\n*Trailing Nebula: uses a gravity emitter to make particles follow and orbit the center point of a blade\n*Lightning: (WIP) not finished, looks like crap\n\nWhat does it work on:\nThis gmax rollout currently has the ability to apply effects to all bioware weapons that can take a VFX. \n*That does not include wand/staff/rod\n*Whip looks bad. I plan to steal some ideas from Amethyst Dragon's flame whip model.\n*Does not yet include ranged weapons, although I intend to include them at some point and make a hak so you can put emitters on bows, crossbows and slings.\n\nYou can find a documentation file in its install location. Documentation includes only how to use the gmax rollout. It assumes you already understand gmax, how to export models, and how to use them in your game.\n\n**************************************\n\ntoolBeamFuncs.ms\n\nAdds customizable p2p beam fx, for use as casting node VFX (in spells.2da). You can also make these beams work with NWNCX as new rays, OR you can also use them as target-following p2p rays by overriding standard beams in Vanilla NWN.\n\nYou need to make your own entries in various 2da's to get these to work. See NWNCX documentation for help. Otherwise you just add them to a spell listing in spells.2da in your CastHandVisual (or similar) column.\n\nYou might also like to add a light effect for certain beams. All effects except the darken beam are rendered using the lighten setting so they all appear bright, however, they do not light up an area without adding a light emitter.\n\n*************************************\n\nLook for updates, including new tools, weekly!","Rating":10,"Awards":[]},"491":{"Title":"NWNCX BeamFX Pack","Author":"merricksdad","Submitted":20120719,"Updated":20120812,"Category":"Animation","Model Format":"MDL","Description":"A pack of bezier and lightning effects for use with NWNCX's beam expansion. Includes MDL and TGA files only.\n\nYou need to make your own entries in various 2da's to get these to work. See NWNCX documentation for help.\n\nSo far rays are included for divine, drain (negative necrotic), cold, acid, fire, lightning (3 colors), soul (positive necrotic), prismatic (3 varieties), arcane, and gem (3 colors). \n\nFor most beam types I have included a large and small variety of each. \n\nAlso included are a few pulse beams I am still working on which you can apply at the same time as any other beam, or use separately. This is a WIP. \n\nMultiple pulse varieties are now available for each energy type.\n\nA small and large beam of blackness is also included for combining with other beams. That beam does not show well by itself except outside in broad daylight. I suggest fiddling with the render order to tweak your darkening function.\n\nIf you have a beam request, simply point me to a picture of what you are looking for and I will try to duplicate it for you as best I can using that picture.\n\nFeel free to use your imagination when using these beams. What I am doing is this:\n*Small beam for lower level spells\n*Large beam for higher level spells\n*Apply pulses when using certain feats, metamagic, or special equipment (think diablo 3 runes).\n*Apply multiple beams at once to mix colors (or use the darken beam to give a black border).\n*Apply large beam to primary target and small beams to secondary targets when using certain feats.\n\nI intend to eventually remove the source impact from these rays. I will then release a pack of source impact, target impact, and just rays, all of matching colors. \n\nI also highly suggest dropping the casting graphics when firing these beams (in spells.2da). Its position seems off, and it usually interferes with the source impact graphics.\n\nYou might also like to add a lighting effect for certain beams. All effects except the darken beam are rendered using the lighten setting so they all appear bright, however, they do not light up an area without adding a light emitter.","Rating":10,"Awards":[]},"492":{"Title":"Reforged: Heavy Blades","Author":"The Amethyst Dragon","Submitted":20121019,"Updated":20130501,"Category":"Weapon","Model Format":"MDL","Forums":"Link","Description":"Original Release Date: October 20, 2012\n\nReforged: Heavy Blades\na remake for scimitars, katanas, longswords, bastard swords, greatswords, and two-bladed swords\nby The Amethyst Dragon\nfor The World of Aenea PW\nLink\n\nThis simple package contains completely remade models and all-new textures for scimitars, katanas, longswords, bastard swords, greatswords, and two-bladed swords. There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models and new .tga format inventory icons. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nThe basic layout of the weapons has been altered for purposes of better design and improvement to the inventory icons. The \"top\" part is still the top of the model. The \"middle\" part is now both the guard and pommel, and the \"bottom\" is the weapon's grip.\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"494":{"Title":"Elf Female Head","Author":"Xia","Submitted":20121123,"Updated":20121123,"Category":"PC Parts","Model Format":"MDL","Description":"[TEST]\nDon't ask me How to use ","Rating":10,"Awards":[]},"495":{"Title":"Fallout Nuka Cola Machine","Author":"Drenark","Submitted":20121226,"Updated":20121227,"Category":"Placeables","Model Format":"MDL","Description":"This my retexturing of the DrHoo Jukebox (Link).\n\nNow, you have a nice Nuka Cola machine for Fallout universe.\n\nOf course, this is an adaptation to approach the initial model of Fallout 1 and 2.","Rating":10,"Awards":[]},"496":{"Title":"Robe as Base Model: More Bones -- Less Jiggle","Author":"merricksdad","Submitted":20121227,"Updated":20130110,"Category":"PC Parts","Model Format":"MDL","Polycounts":"medium","Description":"I've been working on this for years, and until now haven't had enough hours in a year to complete it. But now, its almost done!\n\nWhat I've done is take a lot of cues from newer games like Diablo 3, TERA, and a lot of other online and console games. My intent is to:\n\n*increase the bone count in a model series to create a more fluid character\n\n*replace body part models with an underlying skin mesh\n\n*reduce the use of danglymesh on actual body parts, and increase their usage on cloth and other materials\n\n*reduce a group of animations to a single, smaller MDL file\n\n*allow for better constructed armor parts without having to work in skin textures and the like\n\n*reduce model pass-through and unwanted clipping errors\n\nSo what this model set does is fully replace the male and female human base model series, from PH(m/f)0 back to PH(m/f)0_casts. All bioware animations are included in one file, and all unused and overwritten animations are removed to reduce file size.\n\nThe model includes functional shoulder/clavicle bones for proper shoulder movement, and contains adjusted animations to make use of them.\n\nThe model has a breathing system animated in. It is not perfect yet, but it may be shortly. It looks pretty realistic in most animations. In others, the breathing is not correct for what is going on in the animation (ie. breathing in when swinging a sword or taking a hit). Working on it...\n\nThe models contain nodes (bones) for female breasts, for the sole purpose of reducing danglymesh usage to portray breast jiggle (in some cases, a hideous act). The bone makes the skinmesh as realistic as possible, and since its a skin, you can modify the skin (like with robes) to make use of a percentage of the jiggle. Female breast movement was calculated and animated using a very simplified elastics system which greatly improves upon danglymesh. Male breast \"jiggle\" is also in the works, and includes some muscle flexing show-offs for certain animations.\n\nBecause body jiggle is animated into the model series, it allows for the user to have a separate danglymesh on torso items so you can now have, in effect, two danglymesh tightness values on a single armor part.\n\nThese models are higher poly than the standard robe, but lower poly than a combined set of model parts, AND they allow you to still add the model parts over top. They do require a new full set of model parts, which I am happily working on. This allows for more focus on that specific model part without having to add the skin portion.\n\nThe way these skins are built, additional animation keys help reduce pass-through of one model node into another. It also helps in lighting so that models don't look so blocky in-game.\n\nUpon final release, the following separate skins will be available:\n\n*Nude (nothing too vulgar)\n*Nude without anything sexual (no nips etc)\n*Tight fitting underclothes, comic book style (think Star-Trek TNG)\n*A variety of female-only squishies, such as corset push up, push in, push down, pull apart and combinations thereof.\n\nWhen complete, the replacement model parts will better fit the character model with lower poly counts.\n\nPackage includes gmax scripts for the following:\n*modify jiggle in animation\n*modify breathing in animation\n*elastics and gravity processing\n*model merging\n*math, string, array, object, vector, point3 and rotation libraries (which I should put somewhere else on the vault...)\n\nThis is a work in progress, and so won't be of any use until the replacement body node stuff is complete...unless you just want some low-texture naked people running around in your mod...\n\nUNRELEASED, NO FILES","Rating":10,"Awards":[]},"499":{"Title":"Reforged: Unusual Weapons","Author":"The Amethyst Dragon","Submitted":20130131,"Updated":20130501,"Category":"Weapon","Model Format":"MDL","Description":"Original Release: January 31, 2013\n\nThis simple package contains completely remade models and all-new textures for kamas, sickles, whips, darts, and shuriken. There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models and new .tga format inventory icons. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nThe basic layout of the weapons has been altered for purposes of better design and improvement to the inventory icons. The \"top\" part is still the top of the model. The \"middle\" part is now both the guard and pommel, and the \"bottom\" is the weapon's grip.\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"500":{"Title":"Miniature Active Effect Icons","Author":"Hovering Sombrero","Submitted":20130205,"Updated":20130206,"Category":"Other","Model Format":"BioWare Standard","Polycounts":"1","Description":"I made this small GUI tweak for aesthetic reasons while building my SP module.\n\nThese model files can be dropped in your overide directory.\n\nI created two versions (horizontal or vertical icons), because the preference is one of taste, really, and I wanted to put this up here for anyone to use. At lower resolutions and in one-man party situations the horizontal display seems more pleasing, but the vertical display has an aesthetic closer to NWN2's icon display.\n\nI do realize at one-quarter size the icons are a little indistinguishable, and will continue tweaking the geometry until a good balance is struck.","Rating":8.5,"Votes":0,"Awards":[]},"501":{"Title":"Merricksdad's Infinity Engine VFX Clones","Author":"merricksdad","Submitted":20130207,"Updated":20130212,"Category":"Other","Model Format":"MDL","Polycounts":"emitters (varies)","Description":"This is a collection of spell VFX I am working on. It's basically just me trying to clone or upgrade Bioware's Infinity Engine spells and other vfx.\n\nBioware must have used model-based structures to create most of what you see in Infinity Engine games, however, they all got released as sprites. Not so useful in a 3D world, and so most spell vfx from Infinity cannot be nicely used with Aurora.\n\nWhat I am doing is watching a video playback of various spells from Infinity and trying to mimic them as accurately as possible using Gmax.\n\nRelease 0.0 \"Infinity Casting VFX\", only has \"default\" animation cycle, so you can't use them as \"duration\" cycles nicely, but they do work good as \"impact\" or \"cast01\". I use them as \"cast01\" substitutes currently.\n\nNote: Any time Infinity uses a waterfall-like effect, I instead use a pull-particles-from-every-direction effect.\n\nWatch for weekly updates!","Rating":10,"Awards":[]},"502":{"Title":"Merricksdad's Skull Monsters","Author":"merricksdad","Submitted":20130228,"Updated":20130301,"Category":"Monsters","Model Format":"MDL","Polycounts":"Low","Description":"Skull Monsters similar to those found in Dungeon Siege (1)\n\nI hope to expand this entry to include a lot of skull-based creatures that use same or similar animation cycles.","Rating":10,"Awards":[]},"503":{"Title":"Tno Rural Addons","Author":"symmetric","Submitted":20130301,"Updated":20130428,"Category":"Buildings","Model Format":"BioWare Standard","Description":"- 2x2 windmill tile group with animated wings (\"Windmill 2x2\", for grass terrain)\n- 2x2 building tile group (\"Guildhouse 2x2\", for city terrain)\n\nFeel free to use any of these in your own haks or tilesets.","Rating":9.92,"Votes":3,"Awards":[]},"504":{"Title":"Merricksdad's Worms","Author":"merricksdad","Submitted":20130307,"Updated":20130317,"Category":"Monsters","Model Format":"MDL","Polycounts":"Low","Description":"Pack currently contains a mine grub, the 3E purple worm and the 3E polar worm.\n\nIncludes hack and module files for testing.\n\n\"STATIONARY\" CREATURES:\nPlease read the readme file in the zip due to bugs with stationary monsters.\n","Rating":10,"Awards":[]},"505":{"Title":"Reforged: Ranged Weapons","Author":"The Amethyst Dragon","Submitted":20130501,"Updated":20130501,"Category":"Weapon","Model Format":"MDL","Description":"Original Release: May 1, 2013\n\nThis simple package contains completely remade models and all-new textures for shortbows, longbows, light crossbows, heavy crossbows, slings, bullets, bolts, and arrows (plus in-flight models for shuriken, throwing axes, and darts). There are two options when using this upgrade: hak or override.\n\nThe override version can be dropped right in the NWN/override folder and contains the models and new .tga format inventory icons. \n\nThe hak version contains the same files, plus .dds format inventory icons (which are needed to override the default icons in-game when using a hak). It goes into the NWN/hak folder.\n\nThe model designs are based largely on the existing models, so they will have similar shapes and basic coloration.\n\nAll new inventory icons are included in this hak, made from screenshots of the actual models rather than the previously not-really-accurate images. These icons will not correctly line up with older versions of the inventory icons.\n\nThe basic metal textures have all been redone, and now include (in general):\ncolor 1 = polished steel\ncolor 2 = gold\ncolor 3 = bright copper\ncolor 4 = adamantine\n\nWood and all other textures are also new for Project Reforged.\n\nThe included demonstration module is intended to show off the changes made with the override version of this package. If you want to use the hak version, simply open the module in the toolset, add the hak to the custom content for the module (Edit > Module Properties > Custom Content), save, and play it like normal.\n\nProject Reforged:\n1. Reforged: Chain Weapons (all flails & morningstars)\n2. Reforged: Chopping Weapons (axes of every sort)\n3. Reforged: Smashing Weapons (clubs, maces, hammers, & quarterstaves)\n4. Reforged: Reach Weapons (halberds, scythes, spears, & tridents)\n5. Reforged: Light Blades (daggers, kukris, short swords, & rapiers)\n6. Reforged: Heavy Blades (all swords scimitar size & heavier)\n7. Reforged: Unusual Weapons (darts, shuriken, sickles, kamas, & whips)\n8. Reforged: Ranged Weapons (bows, crossbows, slings, & ammunition)","Rating":10,"Awards":[]},"475-":{"Title":"***","Author":"***","Submitted":20110705,"Updated":20120513,"Category":"Buildings","Model Format":"3DS","Polycounts":"***","Description":"***","Rating":"N/A","Votes":0,"Awards":[]}}