{"1":{"Name":"Moveable Boxes in Multiplayer","Author":"RQScott","Submitted":20061104,"Updated":20061104,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.00","Description":"Download the file, place it in your \\neverwinternights2\\ui folder.\n\nThats it.","Rating":9.38,"Votes":2,"Awards":[]},"2":{"Name":"More hotbar buttons","Author":"sorcerer","Submitted":20061104,"Updated":20061106,"Category":"Minor UI change","ShowCode":"C:\\Games\\nwn2\\UI\\default\\hotbar.xml\n\n<UIScene name=\"SCREEN_HOTBAR\" OnAdd=UIScene_OnAdd_SetupHotbar(\"HOTBAR_GRID\") x=95 y=ALIGN_BOTTOM width=1120 height=57 draggable=true priority=\"SCENE_INGAME\"></UIScene>\n\n560 => 1120\n\n<UIGrid name=\"HOTBAR_GRID\" rows=1 columns=24 x=40 y=7 xPadding=2 yPadding=0 update=true OnUpdate=UIGrid_OnUpdate_UpdateHotbarGrid() >\n\ncolums=12 => colums=24Select All Text | View Code in separate window","Patch":"1.00","Description":"Follow instructions below","Rating":"N/A","Awards":[]},"4":{"Name":"SLATE's 2-row Hotbar","Author":"SLATE","Submitted":20061105,"Updated":20071008,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.00","NWN2Game":"All","Description":"So, here is my beautiful creation. A 2 rowed hotbar. \n\nOnly bad thing is, you cannot actually use shortcut keys for the second row.\n\n--\nHow to install: \n\nCopy the file to your My Documents\\Neverwinter Nights 2\\ui\\default folder.","Rating":9.79,"Votes":30,"Awards":["Hall of Fame"]},"6":{"Name":"NWN 2 Message Box Patch","Author":"Micha LNH HSV","Submitted":20061106,"Updated":20070809,"Category":"Minor UI change","Patch":"1.06","Description":"This small, but nice patch changes the size and position of the 2 messagesboxes. Now the chatboxgui is clearly arranged and appears in the old nwn 1 style. Especially important in MP with a low resolution. (see screenshot: before,after)\n\nCompatible to the folowing resolutions:\n1024x768\n1152x864\n1280x1024\n\nCopy the file \"guisettings.ini\" to your \"My documents\\Neverwinter Nights 2\\ui\\default\" folder (first make a backup of the old originalfile). ","Rating":9.92,"Votes":5,"Awards":[]},"8":{"Name":"SLATE's Draggable Party Bars","Author":"SLATE","Submitted":20061106,"Updated":20071013,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"NWN2","Description":"Choose between a draggable left or right side party bar, or just a static left side party bar.\n\nUpdated Nov. 8: Added dragging capability\nUpdated Nov. 10: Fixed issue with not being able to click on portraits (particularly on the right side partybar)\n\nUpdate Nov. 11: Fixed an issue with the spell effect icons hiding behind the portrait on the left side partybar.\n\n--\nto install:\n\nunzip to: put it in \"My Documents\\Neverwinter Nights 2\\ui\\default\"\n\nPlease vote and enjoy my UI change!","Rating":10,"Votes":6,"Awards":[]},"9":{"Name":"SLATE's 5-row hotbar","Author":"SLATE","Submitted":20061107,"Updated":20061110,"Category":"Minor UI change","Patch":"1.00","Description":"5-row hotbar with smaller buttons.\nI advise all spellcasters who use this mod to also get my Mini-spellbook mod.\n\nUpdate Nov. 10 2006: Forgot to include the proper background image for the hig-res version. Please redownload it if you already have it.\n\n\nThings to note: \nShortcut keys cannot be used on any row except the first. Thats just the way they designed the hotbar system, unfortunately.\n\n--\nto install:\n\nunzip to: put it in \"My Documents\\Neverwinter Nights 2\\ui\\default\"\n\nThis should create a hotbar.xml file and an \"images\" folder. Within the \"images\" folder should be a folder called \"generic\". Within the \"generic\" folder should be \"hotbar_bg4.tga\".\n\nPlease vote and enjoy my UI change!","Rating":9.62,"Votes":17,"Awards":[]},"10":{"Name":"SLATE's Tiny Spellbook","Author":"SLATE","Submitted":20061107,"Updated":20080206,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"All","Description":"The default spellbook has really large icons and lots of wasted space. I wanted to be able to see more of my spells on screen at once. Given that motivation, I created this Tiny Spellbook mod. \n\nUpdate Nov 14: Added more spells per row and made the spellbook longer (fits more on screen)\n\nFor all casters, a perfect companion to this mod is my 5-row hotbar mod.\n\n--\nto install:\n\nunzip to: put it in \"My Documents\\Neverwinter Nights 2\\ui\\default\"\n\nThis should create a spells_known.xml file and a spells_memorized.xml file. All done!\n\nPlease vote and enjoy my UI change!","Rating":9.62,"Votes":29,"Awards":["Hall of Fame"]},"11":{"Name":"SLATE's Tiny Inventory mod","Author":"SLATE","Submitted":20061107,"Updated":20071013,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"NWN2","Description":"The default inventory uses really large icons and sorts your carried items over 4 \"bags\" (pages) of inventory. I wanted to be able to see all of my inventory at the same time. Given that motivation, I created this Tiny Inventory mod. ","Rating":9.13,"Votes":6,"Awards":[]},"12":{"Name":"SLATE's Vertical Hotbar","Author":"SLATE","Submitted":20061108,"Updated":20061112,"Category":"Major UI Change","Patch":"1.00","Description":"Due to popular demand, here is a vertical 2 column hotbar.\n\nI advise all spellcasters who use this mod to also get my Mini-spellbook mod.\n\n--\nto install:\n\nunzip to: put it in \"My Documents\\Neverwinter Nights 2\\ui\\default\"\n\nThis should create a hotbar.xml file and an \"images\" folder. Within the \"images\" folder should be a folder called \"generic\". Within the \"generic\" folder should be \"hotbar_vert.tga\".\n\nPlease vote and enjoy my UI change!","Rating":9,"Votes":5,"Awards":[]},"13":{"Name":"Big Inventory Icons and More Tabs","Author":"clubok","Submitted":20061110,"Updated":20061111,"Category":"Minor UI change","Patch":"1.00","Description":"This is the opposite of SLATE's Tiny Inventory mod. It makes the inventory icons 50% bigger in each direction, so you don't have to squint.\n\nAlso, for those of us who like to organize our inventory to death, it doubles the number of inventory tabs available. So instead of 4 tabs with 32 slots each, you'll have 8 tabs with 16 items each.\n\nThe tabs are now larger and arranged vertically on either side of the inventory grid, making it easier to drop items onto them.","Rating":9.88,"Votes":2,"Awards":[]},"14":{"Name":"slimhealthbars","Author":"ibjodaddy","Submitted":20061110,"Updated":20061111,"Category":"Minor UI change","Patch":"1.02","Description":"Slims down the healthbars next to the character portraits. There is also a seperate blue texture for the health bars in the file.\n\nThe health bars are the one glaring thing I noticed about the UI that needed changing. I've never worked with XML or UIs before, but it was a very simple mod.\n\nI'd suggest previewing the screenshots to see if you like it.\n\nEDIT: I'm also now uploading the files necessary to resize the health bars of your target.\n\nBy request I'm working on a seperate partybar.xml file that will make the portraits significantly smaller.","Rating":9.9,"Votes":7,"Awards":[]},"15":{"Name":"SmallPortraits","Author":"ibjodaddy","Submitted":20061111,"Updated":20061125,"Category":"Minor UI change","Patch":"1.02","Description":"This UI modification makes the character portraits significantly smaller (about half their former size). The health bars are also thinner. It works with my other UI mod which makes the health bars blue as well.\n\nI also had to resize the buff icons so that they would display in proper alignment. I haven't tested this out when characters have more than 4 buffs, but it should work ok.\n\nIf you encounter any problems with the mod, please let me know.\n\nEDIT: This mod will cause 1.03 clients to crash.","Rating":8.5,"Votes":3,"Awards":[]},"16":{"Name":"Big Inventory Icons and Character Info","Author":"clubok","Submitted":20061111,"Updated":20090401,"Category":"Minor UI change","Patch":"1.10","NWN2Game":"All","Description":"This makes the inventory icons 50% bigger in each direction, so you don't have to squint.\nBelow the paper doll is an excerpt of the information available from the Character screen. This way, you can immediately see the effect on your statistics of equipping or unequipping an item.\nVersion 1.03 update: There are now five versions of the screen available, including a new 4x4x8 one. They are now all bundled into a single download, and you can now switch between them in-game, a la xUI.\nVersion 1.041 update: Fixed problem in which Inventory screen would disappear if you switched characters while browsing a merchant's wares.\nVersion 1.05 update: Made compatible with NWN2 1.04. XML files moved into custom directory.\nVersion 1.06 update: Made compatible with NWN2 1.10. Added inventory sort button. Fixed minor bug in noscripts version.","Rating":9.25,"Votes":25,"Awards":["Hall of Fame"]},"17":{"Name":"Compact Character Stats","Author":"cyricc","Submitted":20061112,"Updated":20061124,"Category":"Minor UI change","Patch":"1.02","Description":"The character statistics in the default UI (race, class, mainhand/offhand, etc.) take up a whole lot of unnecessary space. This mod removes the icons and reduces the spacing of the text, making it more similar to the stats pane in NWN1. Feats and skills listings occupy roughly half the original space and retain their icons.\n\nThis also changes the font used in the stats, skills, and feats panes to the one used by the Chat Box (which, in my case, is 12 pt Arial). It DOES NOT alter the font of anything else in the character screen.\n\n\nUPDATE Nov 25: Missed a 1.03 compatibility issue, sorry X_x Fixed attack/damage text not updating properly when switching weapons.\n\nUPDATE Nov 24: Fixed Effects not appearing under 1.03. Compacted the Skills and Feats panes. Enabled showing a skill's description by clicking the text (rather than just the icon).\n\nUPDATE Nov 16: Added a separate version \"charstats_alignment.zip\", which adds numerical alignment values into stats pane ala NWN1, via script. SP only; MP requires server/module to have script","Rating":8.79,"Votes":17,"Awards":[]},"18":{"Name":"23slots_1x6_old_windows","Author":"Razio","Submitted":20061112,"Updated":20061113,"Category":"Minor UI change","Patch":"1.00","Description":"Requirements:\n - Game resolution: 1280x1024.\n\nFeats:\n - New fit for information windows.\n - Longer one-line quick slot menu (23 slots).\n - Total quickslots = 23 x 6 = 138 (Using scroll buttons).\n\nSee screeshot on the right.","Rating":9,"Votes":2,"Awards":[]},"19":{"Name":"Corrosion's Magnum-size Inventory","Author":"Corrosion","Submitted":20061112,"Updated":20061113,"Category":"Minor UI change","Patch":"1.01","Description":"I missed the big ole NWN inventory.\nThis is a minor tweak to the UI, resulting in 60% larger inventory icons and paper doll. I also made a slight increase to the lighting of the paper doll.\nKNOWN ISSUE: \nThis is a minor cosmetic problem.\nThere is a missing texture error when hovering the mouse over tab #1. I am attempting to track this down and will post an update when it's resolved.\n11-13-06 Fixed texture problem. Thanks clubok!","Rating":9.33,"Votes":3,"Awards":[]},"20":{"Name":"Triple hotbar","Author":"Qkrch","Submitted":20061113,"Updated":20061113,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.01","Description":"A simple minor change into quickslots. With this Ui you have 3 hotbars and bigger icons (arrows too). See screenshot","Rating":9,"Votes":2,"Awards":[]},"21":{"Name":"UImproved","Author":"ibjodaddy&Slate","Submitted":20061116,"Updated":20061124,"Category":"Major UI Change","Patch":"1.02","Description":"DISCLAIMER: I have been informed there are some issues with this UI mod and the 1.03 patch (aside from the normal issues it has :P)\n\n\nThis is a compilation of UI mods made by Slate or myself.\n\nIt includes slimhealthbars (which are draggable), an improved chat window, improved hotbar, improved spells known/memorized windows, a draggable playermenu, and a draggable quickcast bar.\n\nUnzip into one of the following 2 directories. The ini file must go into the C:\\Program Files\\Atari\\Neverwinter Nights 2\\UI\\default directory.\n\n1) MyDocuments\\NWN2\\UI\\Default\nor\n2) C:\\Program Files\\Atari\\Neverwinter Nights 2\\UI\\default (if it is on the default installation path)\n\nBackup any files before overwriting them.\n\nMuch credits and thanks to Slate. His vault profile is here: http://nwvault.ign.com/View.php?view=User.Profile&id=6701","Rating":8.75,"Votes":7,"Awards":[]},"22":{"Name":"Extended triple bar","Author":"Shimtek","Submitted":20061118,"Updated":20061119,"Category":"Minor UI change","Patch":"1.00","Description":"I wanted the triple hotbar by slate but also wanted it to be wider and have more slots for each line so i made my own hotbar file.\n\n","Rating":"N/A","Awards":[]},"23":{"Name":"Smaller Minimap","Author":"Shanra","Submitted":20061119,"Updated":20061120,"Category":"Minor UI change","Patch":"1.02","Description":"I felt the minimap was too big, and it bothered me, so I made it about 25% smaller. Its still viewable without being the large nuisance I felt it was.","Rating":9.08,"Votes":5,"Awards":[]},"24":{"Name":"Gross Death","Author":"Seiseki","Submitted":20061120,"Updated":20061121,"Category":"Minor UI change","Patch":"1.00","Description":"Just a little mini mod I did for fun, it only changes dead characters portraits into a more disgusting version of the default one, everything was edited by myself.\n(If you wish to include these in your on UI-mod or Module, please do so!)","Rating":10,"Votes":1,"Awards":[]},"25":{"Name":"Charlie's UI","Author":"Charlie Vale","Submitted":20061121,"Updated":20110531,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"A more compact UI with less wasted space, safe for multi player.\n\nIt includes\n * Side by side re-sizable multi player chat windows\n * A more compact character sheet (all pages)\n * Classic alignment value display (multi player safe).\n * Compact creature examine (same as character sheet).\n * 12 x 10 scrolling hot-bar, 33x2 big hot-bar & 2 12x1 vertical hot-bars.\n * compact, transparent voice chat with back arrow.\n * Compact player/rest menu\n * Extended action queue bar\n * Compact 2x8x8 inventory\n * Compact spell book\n * Compact stores\n * Compact party bar\n * Compact target box\n * Larger journal with compact headings.\n * Compact character selection page when loading/starting new game\n * Smaller mini-map icons and modified camera direction indicator.\n * Drag-able death screens.\n * More compact player list.\n * Double click enabled to join a server or LAN game.\n * Larger player chat selection window with a background.\n * United Colors - Greatly increases the choice of colors during character creation. - by Gaoneng\n * Compatable with Tony K's Companion and Monster AI v2.0\n\n ... and for DMs \n * Compact DM tool bar and difficulty slider with a border for easy dragging.\n * Compact & drag-able DM Quick Cast\n * Compact, single row of buttons in the DM Chooser.\n\nInstallation\n * Remove any old version of Charlie's UI\n * Rename guisettings.ini in \"My Documents\\Neverwinter Nights 2\\UI\\default\" to guisettings.bak\n * Unzip the download into \"My Documents\\Neverwinter Nights 2\\override\".\n * For 1.04+ hot-bars, you must restart the game after turning on/off hot-bars in the options->interface menu.\n * For the 'classic alignment value' to display in multiplayer the script file 'gui_vn_classic_alignment.NCS' must be installed in the server's override directory. Without it you will get the standard alignment display.\n * (optional) If you don't want, or have conflicts with united-colors, simply delete that directory.\n * (optional) For compatibility with xUI rename override\\charlie_ui\\hotbar.xml to hotbar.bak\n\n\nCustomization\nIf you only want part of the Charlie UI, delete the files you don't need. The files and what each one does are:-\n\n Hot Bars hotbar.xml hotbar_2.xml hotbar_v1.xml hotbar_v2.xml & hotbar_bg_md.tga\n Action Queue (top centre) actionqueue.xml & action_queue_md.tga\n Character Selection characterselection.xml\n Character Sheet characterscreen.xml, creatureexamine.xml, char_left_bg_md.tga & char_skills_top_md.tga (+ gui_vn_classic_alignment.NCS for classic alignment values)\n Chat windows defaultchat.xml, defaultmpchat1.xml & defaultmpchat2.xml\n 'Conversation' skill font fix levelup_skills.xml, chargen_skills.xml\n DM Client charlie-DM folder\n Double click join server. internetbrowser.xml, lanbrowser.xml\n Inventory 2x8x8 inventoryscreen.xml\n Journal journal.xml\n Load Game Char Selection loadgamescreen.xml & pregameloadgame.xml\n Mini (round) Map minimap.xml & radar_camera_direction_md.tga\n Mode bar modebar.xml\n Party bar partybar.xml\n Player chat chatselect.xml\n Player list playerlist.xml\n Player Menu (with rest icon) playermenu.xml & playermenu_popup.xml\n Smaller Font size fontfamily.xml\n Spell Book spells_known.xml & spells_memorized.xml\n Stores store.xml\n Target box target_enemy.xml & target_object.xml\n Quick Cast Bar quickspell.xml\n United Colors chargen_appearance.xml & color_*.2da & color_united.tga\n Voice Chat voicemenu.xml, b_back_hover.tga, b_back_normal.tga & b_back_hover_pressed.tga\n\nUpdates\nFrom version 1.31, Charlie's UI will try to check for updates, when playing on-line. It does this by comparing its version number against the version number in server scripts. This will give the user a message if the on-line server has a newer version installed.\n\nChange log\n * Added FontFamily as an additional download for people who like the smaller fonts. Just add FontFamily.xml to your override directory.\n * 1.45 - Removed 'classic alignment' display. Alignment values are displayed normally in NWN 1.23.\n * 1.44 - Updated for NWN2 1.23. Fixed trade button for SoZ. Changed back to default fonts.\n * 1.43 - Updated for NWN2 1.21 and SoZ and TonyK's AI v2.0.\n * 1.42 - Updated for NWN2 1.13 and TonyK's AI 1.11\n * 1.41 - Added custom portrait choice ability - NWN2 update 1.12.\n * 1.40 - Fix missing last item in stores scene; Fix repeated \"Spell casting\" heading in behavior tabs.\n * 1.39 - Character sheet fixes: companion influence readout (OC/MotB); skills descriptions; behavior tabs consistent; Added Tony_K AI Merge download.\n * 1.38 - Removed 'Concentration Fix' - OEI Fixed this, making older versions of Charlie's UI unable to adjust skills ; No longer suppresses the \"custom portrait\".\n * 1.37 - More space for long feat names.\n * 1.36 - Fixed flashing inventory icons. Longer class names now fit on the character sheet.\n * 1.35 - Fixed x1 backgrounds and duplicated scenes.\n * 1.34 - Added default player menu for users with only Charlie's UI.\n * 1.33 - All feats show on creature examine and character screen. Updated United Colors.\n * 1.32 - Mode bar move-able; fixed the party bar issue with 1.10 so you can summon without crashing; fixed the inventory (the 1.10 update changed the inventory background) and added the sort inventory button; quick spell is move-able.\n * 1.31 - Compatibility fix for Charlie's Item Appearance Changer. Added update checker.\n * 1.30 - Fixed DM tool-bar and difficulty sliders.\n * 1.29 - Improved hot-key alignments for the hot-bars.\n * 1.28 - Enabled double click to join a server. Added a larger player chat with background.\n * 1.27 - Includes 'Concentration Fix'. Fixed xp progress bar. Long feat names now displayed properly.\n * 1.26 - Fixed Character screen - Spell casting, Disarm Spells and Item usage tabs.\n * 1.25 - Fixed Load Game button. Updated Gaoneng's United Colors to version 1.05.\n * 1.24 - Fixed journal.xml\n * 1.23 - Added a more compact player list.\n * 1.22 - Added 'classic' alignment value display, so you can see the numeric (1-100) value of your alignment.\n * 1.21 - Fixed player chat.\n * 1.20 - Added drag-able death screens.\n * 1.19 - Added changes to DM Client UI.\n * 1.18 - Door image now fits the targeting box.\n * 1.17 - Updated for NWN2 1.04 beta; compact target and party bars; more consistent color scheme (silver/gold)\n * 1.16 - Divided into folders: charlie_ui, united_colors, theme-black\n * 1.15 - Added theme-black; Merged in United Colors by gaoneng\n\nCheers!","Rating":9.64,"Votes":74,"Awards":["Hall of Fame"]},"26":{"Name":"Smaller Big Map","Author":"cyricc","Submitted":20061122,"Updated":20061125,"Category":"Minor UI change","Patch":"1.02","Description":"I felt the circular minimap was too constrictive, and the area map too large, so I shrank the area map to about half its height and width.\n\nI was hoping to attain something closer to NWN1-style map, but all the actual map functionality is hardcoded and doesn't lend itself to anything beyond superficial changes. Oh well.","Rating":9.49,"Votes":23,"Awards":[]},"27":{"Name":"Uncensored Character Names","Author":"SunryzeR","Submitted":20061122,"Updated":20071102,"Category":"Minor UI change","Patch":"1.02","NWN2Game":"All","Description":"As I am sure some of you have spotted, Obsidian/Atari have decided that we should be spared the more \"creative\" words in the English language - words such as cockerel and shitsu - which they feel are not right for inclusion in our character names ;)\n\nIt has also come to my attention that players wishing to list certain professions in their name have been prevented! For example, \"Gregor the Analyst\" was unhappy to find his name become \"Gregor the lolyst\".\n\nFurther more, fans of ice skating were horrified to discover that they were unable to make a character based on their favourite skater, Irina Slutskaya - \"Irina ladyskaya\" just didn't have the same ring to it!\n\nHere is a UI modification that lifts the restriction on the names of our more amusing wildlife and professions in our player character names :)\n\nEnjoy!\n","Rating":10,"Votes":35,"Awards":["Hall of Fame"]},"28":{"Name":"Seamless (large) minimap","Author":"Lowkee","Submitted":20061122,"Updated":20061122,"Category":"Minor UI change","Patch":"1.00","Description":"Removes the frame from around the minimap and enlarges it to almost the size of the full size map.\n\nSize can be edited easily. Simply edit the file and change anything set to 450 to the pixel size you desire.","Rating":8.5,"Votes":1,"Awards":[]},"29":{"Name":"xUI","Author":"XiDragon","Submitted":20061122,"Updated":20080816,"Category":"Major UI Change","Patch":"1.13","NWN2Game":"All","Description":"xUI GUI - Command bar, 24 Hotbars, Mode-, Bard Hotbar, Small Party Bar and much more, all configurable via ingame menues.\n\n\nxUI v1.6 Build 8\nfor Neverwinter Nights 2\n\nIf you want to use this mod or parts of this mod in your own mod, you have to get my authorization first!\n\n\nNEW in Version 1.6 build 3 to 8\n=======================================\nBuild 8:\n- xUI is now fully compatible with NWN2 + MoTB 1.13\nBuild 7:\n- Fixed a bug that prevented the new custom portraits function of NWN 2 1.12 to work.\nThis only occured if you selected the optional xUI package \"Comatiblity with FI Big Fonts UI 1.4\" in the xUI installer/configurator. \nBuild 6:\n- xUI is now fully compatible to the new NWN2 Patch 1.12\n- Added install option to use xUI together with \"Fire&Ice's Big Fonts UI\" mod\n!!! Only install this optional xUI package if you have \"Fire&Ice's Big Fonts UI\" mod v1.4 or v1.12 installed!\nBuild 4:\n- Changed handling of GUI ini files for better future compatibility (see section installation for more details)\n- Changed install path of xUI Scripts. They are now installed into a subfolder within the override folder.\nBuild 3:\n- xUI is now completely compatible with NWN2 v1.11 and also with MotB v1.11\n- Reimplemented option to turn off the standard NWN2 Mode-Bar because the original NWN 2 function to do that is not always working properly\n\nNEW in Version 1.6x\n=======================================\n- Command Bar commandos can now be issued to targeted henchman or the complete party\n (left click whole party, right click and click on target for just that henchman)\n- Chat window can be turned off via xUI Options screen\n- Small button to open and close the chat window\n (located close to the NWN menu button)\n- Unobtrusive chat window (Standalone)\n- Enhanced Character Screen (Standalone)\n Displays a more detailed alignment and the party leaders Influence on henchman\n- Optional additional buttons in the command bar \n for switching puppet mode of henchman and equipping resp. unequipping weapons\n- Enhanced xUI Config screen for choosing which buttons of the extended xUI Command Bar to activate\n (only available when the extended xUI Command Bar and the Main package is installed)\n- Some code optimizations\n- Removed the option to switch off the default Mode Bar popup, because such a function is now implemented into NWN2 by default\n (look under NWN2 Game Options -> Interface)\n- Fix of small graphic glitch in the xUI Quickspell menu\n- Enhanced Installer - Checks for older installed versions of xUI and asks for Startmenu folder ...\n\n\nFeatures\n=======================================\n\n- Highly customizable \n You can install /activate the elements of xUI you like.\n- Ingame Configurator\n- Installer and Uninstaller\n- External Install Configurator \n Lets you add and delete xUI optional installs after xUI was installed.\n\nMain Package features\n- Completely configurable via ingame menu and external configurator\n- Every new GUI element is optional\n- Loads automatically\n- UI changes stay after rezoning\n- xUI Configuration will be saved with savegame\n- 24 differnt styles of hotbars\n- Separated Command hotbar (\"Stand Ground\", \"Guard Me\" and so on) \n- Separated Mode hotbar (\"Parry\", \"Stealth\" and so on) \n- Separated Bard hotbar\n- Std. Mode/Bard bar can be turned off\n\nOptional Standalone Packages\n(These packages also work without the main xUI GUI)\n- Small Party bar\n can be installed together with main package\n- Unobtrusive Quickcast hotbar\n can be installed together with main package\n- Command hotbar (\"Stand Ground\", \"Guard Me\" and so on)\n can not be installed together with main package\n- Unobtrusive chat window\n can be installed together with main package\n- Detailed alignment display on the character screen\n can be installed together with main package\n\nThe optional installs are standalone versions that do not need the Main xUI to work.\n\n\nFAQ\n===========\n\n1.\nQuestion: How to move xUI elements around?\nAnswer: Every element that the xUI adds, except the small party bar and the quickspell bar, can be dragged around. They have an 8 pixel border around them where they can be dragged from.\n\n2.\nQuestion: What files will be overwritten by this UI?\nAnswer: None. \n\n3.\nQuestion: Does this work with PW's?\nAnswer: Yes, but xUI has to be installed on the server. There is right now no way around this and nothing I can influence because this is how NWN 2 is designed.\n\n4.\nQuestion: My xUI is not working properly since NWN 2 v1.04 how do I fix that?\nAnswer: Make sure you have installed at least xUI v1.4 and check that the following two NWN 2 options are activated:\n- Game Options -> Interface -> Show Horizontal Hotbar 1\n- Game Options -> Interface -> Show Modebar\n\n\nKnown problems\n===========\n\n1.\nIn multiplayer the xUI configuration might not be saved.\n\n2.\nHotbar hotkeys do not work completely the same way they work in the default NWN 2 UI. Hotbar hotkeys will only work for the first row of the xUI hotbars. Have a look at the Readme for more details.\n\n3. \nAt the moment the hotkeys for the hotbar do only work after you pressed Shift-1 once.\nI am looking into this to find a solution.\n\n\nHave fun\nXiDragon\n\n\n\n\nxUI History\n===========\nv1.6 build 8:\n- Made xUI fully compatible with NWN2 + MoTB 1.13\nv1.6 build 7:\n- Fixed a bug that prevented the new custom portraits function of NWN 2 1.12 to work.\nThis only occured if you selected the optional xUI package \"Comatiblity with FI Big Fonts UI 1.4\" in the xUI installer/configurator. \nv1.6 build 6:\n- Made xUI compatible to the new NWN2 Patch 1.12\n- Added install option for xUI compatibility files for \"Fire&Ice's Big Fonts UI\"\nv1.6 build 4\n- Changed handling of GUI ini files for better future compatibility\n- Changed install path of xUI Scripts. They are now installed into a subfolder within the override folder.\nv1.6 build 3\n- Made xUI completely compatible with the latest NWN2 + MoTB Patch 1.111153\n- Fixed the issue that the Minimodebar and Bardbar where not moveable anymore because of the last NWN2 patches\n- Reimplemented option to turn off the standard NWN2 Mode-Bar because the original NWN 2 function to do that is not working properly\nv1.6 build 1\n- Code changes to make xUI compatible with NWN v1.1\n- Command Bar commandos can now be issued to targeted henchman or the complete party\n (left click whole party, right click and click on target for just that henchman)\n- Chat window can be turned off via xUI Options screen\n- Small button to open and close the chat window\n (located close to the NWN menu button)\n- Unobtrusive chat window (Standalone)\n- Party Leaders Influence Display on character screen (Standalone)\n- Optional additional buttons in the command bar \n for switching puppet mode of henchman\n- Enhanced xUI Config screen for choosing which buttons of the extended xUI Command Bar to activate\n (only available when the extended xUI Command Bar and the Main package is installed)\n- Some code optimizations\n- Removed the option to switch off the default Mode Bar popup, because such a function is now implemented into NWN2 by defult\n (look under NWN2 Game Options -> Interface)\n- Fix of small graphic glitch in the xUI Quickspell menu\nv1.5 build 1\n- Unobtrusive chat window\n- Detailed alignment display on character screen\n- Optional button in command bar for equipping resp. unequipping weapons\n- Some code optimizations\n- Enhanced Installer - Checks for older installed versions of xUI, ask for Startmenu folder ...\n...\n(see the ReadMe for the full history)","Rating":9.51,"Votes":128,"Awards":["Hall of Fame"]},"30":{"Name":"Solid Transparent Hotbars","Author":"cyricc","Submitted":20061124,"Updated":20061125,"Category":"Minor UI change","Patch":"1.02","Description":"Gridless hotbar with a rectangular transparent solid black (whew) background. Includes 2/3/4/5-row versions.","Rating":9.58,"Votes":3,"Awards":[]},"31":{"Name":"Horizontal Target Frames (now with HP percentage display)","Author":"cyricc","Submitted":20061126,"Updated":20080627,"Category":"Minor UI change","Patch":"1.12","NWN2Game":"All","Description":"This mod moves the target name to the right of the portrait and orients the HP bar horizontally for a more WoW-esque feel. It also displays the numerical HP percentage of the target overlaid on the HP bar, e.g. \"HP: 75%\". (see screenshot)\n\nFor matching party frames, see Horizontal Party Frames\n\nI would have preferred just the number, e.g. \"75%\", but I couldn't remove \"HP:\" without resorting to a custom script. \n\nA red bar is used for enemies, a green bar for non-hostiles. This mod does not change the font used by the target frame.\n\nUPDATE 10-21-07: Added MotB custom portrait support and HP percentage display","Rating":9.4,"Votes":7,"Awards":[]},"32":{"Name":"Reposition UI  w/o blocking MouseClicks","Author":"Abraxas77","Submitted":20061130,"Updated":20061202,"Category":"Other","Forum Thread":"Link","Patch":"1.02","Description":"This is an example demonstrating how a UI with concealable parts (ie: resizable screens, collapsable elements, etc) can be repositioned while preventing non-visible elements from blocking the playing area.","Rating":"N/A","Awards":[]},"33":{"Name":"CleanedUI","Author":"EpikurCicero","Submitted":20061130,"Updated":20061207,"Category":"Major UI Change","Patch":"1.02","Description":"Some changes on the UI layout and location \nwill be performed by this mod","Rating":8.31,"Votes":6,"Awards":[]},"34":{"Name":"Player Menu/Rest Icon Removal","Author":"Kasdar","Submitted":20061130,"Updated":20061201,"Category":"Minor UI change","Patch":"1.02","Description":"All this does is remove the Party Menu and Rest Icons from the UI.\n\nI find I have never used them and they just get in the way.","Rating":9.33,"Votes":3,"Awards":[]},"35":{"Name":"Square Minimap","Author":"cyricc","Submitted":20061201,"Updated":20071020,"Category":"Minor UI change","Patch":"1.10","NWN2Game":"All","Description":"Enlarged the minimap and made it square to increase the visible area. (see screenshot)\n\nTwo minimap files are included. One of them is the larger minimap and can be toggled between small and large versions, but the small version cannot be dragged to the edge of the screen. The other file is only the small version, but can be dragged to the edge of the screen. Instructions are in readme.\n\nKnown Issues\n- Map markers in the corners of the map will not appear. This is because the game still \"thinks\" the minimap is circular. Unfortunately this behavior is hardcoded and cannot be changed.\n- This is the only mod I've written that I do not use myself (I prefer Smaller Big Map), so let me know of any other bugs.\n\nUPDATE 12/03/06 - double-clicking on the title bar (ala unmodded minimap) will now toggle between normal and smaller sizes.\nUPDATE 10/21/07 - added an extra smaller minimap file (instructions in readme)","Rating":9.44,"Votes":14,"Awards":[]},"36":{"Name":"Semi-transparent","Author":"Shoujo","Submitted":20061202,"Updated":20070129,"Category":"Minor UI change","Patch":"1.03","Description":"STC Inventory v.02\n\nRemoves the paper doll and reduces the amount of space taken up by the inventory menu while making it transparent. The numbers beneath the encumbrance value replaces the bag icons (inventory tabs).\n\nSTC Char Sheet v011\nSimilar style to above, made more compact (slimmer and shorter). Uses default font (easier on the eyes IMO), skills/behavior pane require no scrolling. Separate download for pets.\n\nMinor update 1/30\n- Added a transparent quickspell menu. (quickspell.xml)\n- Added semi-transparent player list because I grew tired of scrolling whenever 5+ players would show up. The account names are crossed out for privacy reasons. (playerlist.xml)\n- Being exceptionally lazy, I tweaked the context menu so that whenever you right click on a target's name in the chatbox to whisper to them, the /t Name would appear at the bottom where your cursor is instead of a few inches away.\n\nLet me know if you run into any problems and/or have suggestions.","Rating":9.1,"Votes":7,"Awards":[]},"37":{"Name":"Corrosion's Magnum Inventory Version 2","Author":"Corrosion","Submitted":20061203,"Updated":20061207,"Category":"Minor UI change","Patch":"1.03","Description":"Adds Character Info to my Magnum-size Inventory including:\n\n- Main & Offhand Weapon info\n- Character Attributes\n- Saving Throw info \n- Base Attack Bonus\n\nThis info updates automatically when swapping items and requires no scrolling to view.\n\nNote: It's possible that when equipping weapons with extremely long names, the name may be clipped. Let me know if it becomes a problem. Thanks!\n\nUPDATE 12-6-06:\nRevised .xml files for patch 1.03. Stylesheet no longer causes crash to desktop. Weapon info now updates correctly.\nUPDATE 12-6-06:\nAdded OnDestroy command to UIScene.\n","Rating":9.38,"Votes":2,"Awards":[]},"38":{"Name":"Horizontal PartyFrames (including names and HP)","Author":"cyricc","Submitted":20061206,"Updated":20080627,"Category":"Minor UI change","Patch":"1.12","NWN2Game":"All","Description":"This mod moves the HP bars in the Party Frame to the right of the portrait and orients them horizontally. Names and current/max HPs of all party members are also shown. Draggable/nondraggable versions included. (see screenshot)\n\nThe font used for both the Names and HPs is the same as the target frame font.\n\nFor matching target frames, see Horizontal Target Frames\n\nUpdate Oct 22 07 - fixed party bar being undraggable\nUpdate Oct 11 07 - fixed crash issue with custom portraits in MotB\nUpdate May 20 07 - small update for 1.05/1.06b\nUpdate Dec 10 06 - death icon fixed\n\nKnown Issues\n- Draggable version has a large blank area that cannot be clicked through, similar to other draggable partyframe mods.\n- Very long names may not appear properly or at all.\n- If you find any others, please let me know.","Rating":9.51,"Votes":22,"Awards":[]},"39":{"Name":"Expanded Loot Window (for Magic Bags)","Author":"cyricc","Submitted":20061208,"Updated":20061208,"Category":"Minor UI change","Patch":"1.03","Description":"Though it changes the loot window for everything, this mod is primarily aimed at inventory containers such as Magic Bags and Bags of Holding. It increases the size of the loot window, makes it transparent, and shrinks the size of the item icons. (see screenshot)\n\nItem labels use the same font as that of the chat box.\n\nKnown Issues\n- Very long item names may not appear. They can be displayed by hovering the mouse over them to bring up the tooltip.","Rating":9,"Votes":6,"Awards":[]},"40":{"Name":"Official Campaign Tools&Fixes 1.033","Author":"Kamiryn","Submitted":20061213,"Updated":20080901,"Category":"Minor UI change","Patch":"1.03","NWN2Game":"All","Description":"The Official Campaign Tools&Fixes (OCT&F) UI modification adds a new node to the player context menu. This new node 'Tools' opens a submenu containing the following commands:\n\n- Party Roster: Pulls up the character selection GUI screen.\n- Print Influence: Prints the influence you have on your companions to the message window.\n- Print Alignment: Prints your detailed alignment to the message window.\n- Bug Fixes: Opens a submenu containing a few bug fixes. See below for more informations.\n\nBe careful when changing your party. OnEnter and OnExit scripts do not fire for party members entering or leaving the area through the character selection GUI screen. So you shouldn't use the party roster tool in the Duskwood areas for example (spell failure will not be removed). Also I don't know what will happen if you change the party inside a dungeon every second minute - so be careful!\n\nOriginally this started as Context Menu Party Roster tool and was mainly made for changing the party inside the sunken flagon inn or in crossroad keep for easier item exchange or crafting. \n\n\nThe Bug Fixes submenu contains the following fixes (see the readme file for more informations):\n\n- Restore Companion AI scripts\n- Construct Upgrade Fix\n\n\nThe installation is very simple:\n\nCopy the content of the ui folder (the file 'contextmenu.xml') to\n\nC:\\Program Files\\Neverwinter Nights 2\\Campaigns\\Neverwinter Nights 2 Campaign\\UI\n\nIf you're still running NWN2 1.02 you should try the contextmenu.xml in the 1.02 folder. However I was not able to make any tests so it might work or not.\n\nAlso you have to copy the content of the override folder into\n\nMy Documents\\Neverwinter Nights 2\\override\n\nBoth the compiled script 'gui_mk_tools.ncs' and the source code 'gui_mk_tools.nss' are required.\n\n\nNew in the version 1.033: 'Bug Fixes' submenu added, 'Restore AI Scripts' and 'Construct Upgrade Fix' added.","Rating":9.69,"Votes":32,"Awards":["Hall of Fame"]},"41":{"Name":"[D.T.E.] Better QuickChat UI","Author":"[D.T.E.] LuCif3r","Submitted":20061214,"Updated":20061214,"Category":"Minor UI change","Patch":"1.03","Description":"Enlarged Quickchat Window(NWN1 style dislog box);\nColored Speaker's Name, Ease to notice;\nChange the color of Player's Options to Gold.","Rating":8.75,"Votes":1,"Awards":[]},"42":{"Name":"Change Level UI Screen","Author":"Girruuth","Submitted":20061215,"Updated":20061215,"Category":"Minor UI change","Patch":"1.03","Description":"This is a single simple UI screen that prompts the player to type in the desired level, and when the player clicks the OK button, the character is given enough xp to achieve that level.\n\n/ / / / / / / / / IMPORTANT NOTE: \\ \\ \\ \\ \\ \\ \\ \\ \\\nI am pretty sure there is a bug in the toolset's internals that requires a workaround to make this script interaction work. It is kind of an ugly hack, but until the bug is addressed by Obsidian, it is the only way to get it to work. Without drowning you in details, here is the workaround. When you enter the desired level into the dialog you must add a letter -- any letter -- to the end of the number. \n\nEx. if you wanted to make a level 8 character, you would enter \"8a\". The letter added doesn't matter only that it has been added.\n\\ \\ \\ \\ \\ \\ \\ \\ \\ IMPORTANT NOTE: / / / / / / / / /\n","Rating":10,"Votes":2,"Awards":[]},"43":{"Name":"United Colors","Author":"gaoneng","Submitted":20061219,"Updated":20081223,"Category":"Major UI Change","Patch":"1.21","NWN2Game":"All","Description":"United Colors replaces the limited 18-slot palettes in the character creation screen with a universal 256-slot palette.\n\n Installation \n * Delete any previous version of United Colors.\n * Extract the downloaded folder \"united_colors\" and put it, along with all its content, into your override folder, located in My Documents\\Neverwinter Nights 2\\override.\n * The game engine will automatically load objects in the override folder instead of the original standard resources.\n\n Content \nUnited Colors overrides several standard resources.\n * chargen_appearance.xml - the modified appearance selection screen\n * color_**.2da - the expanded color palettes for all 23 races\n\nAnd United Colors adds a new resource.\n * color_united.tga - background image used in the selection screen\n\nTo uninstall, just remove the \"united_colors\" folder and all its content from your override folder. Generally, it's also good idea, but not absolute necessity, to empty your override folder prior to patching. You can always put the files back in after the updater completes its routine. (What I do is rename the override folder to something else, and then change it back after patching.)\n\n How This Works \nThe way colors on characters work is simple. The player selects the desired colors, and the hex values of these colors are stored in the generated characters' profiles permanently. There is no reference to any 2da or color source beyond the character creation screen. Which is why the colors \"stick\" even after you uninstall United Colors.\n\nUnited Colors does not modify your characters in any way. It does not run any external script either. All it does is expose more color options in the character creation screen. Your characters will remain legitimate for all other modules and campaigns you play, including multiplayer ones.\n\nWhich means you can use any color you want.\n\nWith United Colors installed, you may notice a very short pause when the character creation appearance selection screen loads. This lag occurs because the engine is trying to read 1536 entries off the reference 2da at the same time. This is perfectly safe and harmless, and will not affect anything anywhere else. This is probably why the standard palettes come in such limited colors in the first place - to reduce read amount and lag. I have some ideas on how this issue can be circumvented, but it would compromise a great deal of interface intuitivity and convenience, and I've decided that it's simply not worth it. So, just live with the lag, if you notice it at all. ^_^\n\n Frequently Asked Questions \nQ. I want to keep the original palettes for some races. Is this possible?\nA. Yes. Simply delete the 2da's of those races from the united_colors folder. The engine will then load the original 2da's and the original colors. For example, to keep the drow color choices to the original palettes, just delete color_drow.2da from the united_colors folder. Many of the colors in United Colors are sampled directly from the original palettes though, so it's unlikely you will miss the originals.\n\nQ. The color I want isn't among the 256! What do I do?\nA. You can add more slots, but I'd strongly advise against that. You can easily replace one of the 256 colors with a color of your own. First, get the hex value of the color you want. Open up the 2da you want to modify. And replace the color you don't want with your own custom color. If you aren't sure which color you want to replace, use the second or third row to replace one of the grey shades. :)\n\nAlternatively, there's a program written specifically for use alongside United Colors that allows editing of the color selection via a graphic user interface. It's written by community member Girruuth, and you can get it at PC Color Palette Editor\n\nQ. Does this work in multiplayer/PW sessions? Do my peers/server need to install this package on their end?\nA. The modified color palettes will only appear on the client with the package installed, but color information on your character will appear correctly for all other players even if they do not have United Colors installed. So, yes this works in multiplayer/PW sessions. And no, your peers/server do not need to install United Colors if they do not want to.\n\nQ. I like this package! Can I distribute it elsewhere?\nA. Yes, as long as proper credit is given, you are free to modify and distribute this package. In return, please notify me with an email, and vote.\n\n VERSION HISTORY \n * Version 1.43 - updated for Storm of Zehir by charlievale.\n * Version 1.39 - updated for MotB & new races. Maintenance taken on by charlievale. Future version numbers will correspond with the release of Charlie's UI which includes United Colors.\n * April 17, 2007 - updated interface to include patch 1.05's height and girth sliders\n * January 13, 2007 - added link to Girruuth's program; moved all files into a single folder for a tidier install\n * December 19, 2006 - first release","Rating":9.86,"Votes":112,"Awards":["Hall of Fame"]},"44":{"Name":"Compact Double Mode Bar","Author":"Minor","Submitted":20061225,"Updated":20061226,"Category":"Minor UI change","Patch":"1.03","Description":" This is a small modification to the NWN2 UI that modifies the size of the Mode Bar to 2x5 instead of the default 3x5. It also moves the Mode/Bard buttons over to the side to conserve space. More detailed insructions are located in the .zip file. It has been tested on 1024x768 res and on the v1.03 patch.","Rating":4.88,"Votes":2,"Awards":[]},"46":{"Name":"MANY hot bar slots","Author":"Uriens_The_Gray","Submitted":20070104,"Updated":20070106,"Category":"Minor UI change","Patch":"1.03","Description":"I ran over Razio�s 23 hot bar slots, so i deceided to make a hot bar containing 40 slots at once. A realy LONG one ;-)\nAnd here we are !! I also included Kasdar�s player menu removal. \nPlease note, that this modification has been made for screen resolutions of 1680x1050 and above.\nThanks and Credits go to Razio and Kasdar","Rating":10,"Votes":1,"Awards":[]},"47":{"Name":"1680x1050 Resolution","Author":"Uriens_The_Gray","Submitted":20070106,"Updated":20070107,"Category":"Minor UI change","Patch":"1.03","Description":"After some time play NWN2 i realized that some screens (main menue, load, save and the world transition map) look somewhat squashed in my favored resolution, which is 1680x1050 (16:10).\nSo i deceided to do something. And there we go. The world transition screen will follow later.\nBefore you download these files, please let me know you, that they are only for the resolution mentioned above.","Rating":10,"Votes":1,"Awards":[]},"48":{"Name":"UI 4 1280x800. Chat + Server boxes","Author":"Dish wash","Submitted":20070120,"Updated":20070120,"Category":"Major UI Change","Patch":"1.00","Description":"Nothing huge, just that I noticed a lack of UI organisation for widescreens. I made this one specifically for 1280x800 (my native laptop resolution) which makes things a bit more enjoyable in multiplayer. ","Rating":7.5,"Votes":1,"Awards":[]},"49":{"Name":"TextMacro Tool","Author":"Abraxas77","Submitted":20070125,"Updated":20070313,"Category":"Other","Forum Thread":"Link","Patch":"1.04","Description":"The TextMacro tool is a stand-alone UI designed to provide the familiar text macro feature from oNWN to NWN2. It does just that and much more!\n\nThis system requires either:\n� CSF v1.02 (Common Scripting Framework)\n� DMFI v1.04\n(if your module is enable with both CSF & DMFI, download & install TextMacro v1.02-DMFI)\n\n¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯\n\n________\nFeatures\n¯¯¯¯¯¯¯¯\n� Quickly and easily create text macros.\n� Rearrage the macros in your list with only a few clicks.\n� Create as many text macros as you like. There is a default limit of 30 macros per TextMacro Tool, but you may have multiple tools in your inventory.\n� Trade your text macros with other players or DMs by swapping text macro tools.\n� See the text for each macro in your list by hovering your mouse over any item in the list. The text is displayed as a tooltip message.\n� Minimize the UI to a condensed version to see more of the game.\n� A spam filter limits usage to once per second.\n� Use \"/l\", \"/w\", \"/s\", or \"/d\" to speak at different talk volumes.\n� NEW! Command macros allow you to set macros that perform specific actions rather than speech.\n� NEW! DMFI integration allows you to create command macros for any DMFI command (v1.02-DMFI only).\n� NEW! You can now use the DMFI voice throw feature to make other creatures speak your macros (v1.02-DMFI only).\n� NEW! DMFI in-line emotes are now recognized and executed (v1.02-DMFI only).\n\nAlso new to v1.02\n� Visual Enhancements.\n� A more intuitive method for editing macros.\n� Several new configuration options.\n� The Spam Shield, a far more efficient spam filtering system.\n� Better support for multiple tools.\n� A comprehensive tutorial.\n\nv1.02 Changes\n� The name of the active tool now appears in the UI.\n� Macros can now be added and edited from the minimized UI.\n� Macro tooltips now reveal the label as well as the text.\n� Labels are now limited to 40 characters.\n� Text can now span up to 5 lines or 255 characters, whichever comes first.\n� A configurable limit to the number of text macro tools allowed in a player's possession (default is 5).\n� Major changes to the server scripts, too many to list.","Rating":9.9,"Votes":7,"Awards":[]},"50":{"Name":"4 Row Transparent HotBar","Author":"_oUnnamed_","Submitted":20070203,"Updated":20070203,"Category":"Minor UI change","Patch":"1.04","Description":"Four rows of twelve, semi-transparent quick slots. It's a beautiful thing.\n","Rating":8,"Votes":5,"Awards":[]},"53":{"Name":"Counterspells","Author":"RQScott","Submitted":20070226,"Updated":20070226,"Category":"Other","Patch":"1.04","Description":"Enables counterspells in Neverwinter Nights 2, like it was in Neverwinter Nights 1. \n\nThe package contains 1 script and 1 xml-file (contextmenu.xml). I just took the counterspell-things that are in the original-nwn2. (image, scripts, scripting-funcions etc.)","Rating":10,"Votes":1,"Awards":[]},"54":{"Name":"Player's Handbook","Author":"gaoneng","Submitted":20070228,"Updated":20080108,"Category":"Major UI Change","Patch":"1.04","NWN2Game":"All","Description":"Player's Handbook is an in-game manual add-on for Neverwinter Nights 2. It presents detailed information on all playable races, classes, skills and abilities, feats, and spells in an organized format.Refer to readme included in the download for installation instructions and usage notes.Enjoy. Update Jan 09, 2008\nI am no longer actively developing new content for NWN2, as such, several of my old projects, namely United Colors and Player's Handbook, have been passed on to other developers for maintainance and updates.Player's Handbook is currently maintained by fire&ice and Dragoon001. (Thanks.) Visit this page for the latest revisions. ","Rating":9.7,"Votes":31,"Awards":["Hall of Fame"]},"55":{"Name":"Compact Character Stats - Deutsche Version","Author":"Micha LNH HSV","Submitted":20070307,"Updated":20070307,"Category":"Minor UI change","Patch":"1.04","Description":"Dieser kleine Patch zeigt alle Charaktermen�s kompakter an und blendet ein aus Neverwinter Nights 1 bekanntes Gesinnungsmen� ein (Neutral 58, Gut 100).\n\nEnglisches Original von cyricc\n�bersetzung von burn79\nVerwaltung von Micha LNH HSV","Rating":"N/A","Awards":[]},"57":{"Name":"The Neverwinteros UI","Author":"SuRdO","Submitted":20070311,"Updated":20070401,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.04","Description":"The Neverwinteros UI por SuRdO (Albert Gil Escura) \n\nMis más sinceras disculpas hacia la comunidad no hispana, al no poder entender este paquete por el momento, mi intención es crear una UI totalmente multilanguaje que se base sobre el dialog.tlk o sobre un custom.tlk propio para cada idioma(como mucho).\nDe momento, solo existe la versión hispana.\n\nFor people non-spanish, i apologize to you but i don´t know english. \nIn the future version i´ll try create a english text script for translate \nthis UI.\nSorry\n\nPara instalar este paquete, descomprimelo dentro de Neverwinter Nights 2 de Mis documentos y ejecuta el módulo NeverwinterosUI","Rating":9.63,"Votes":2,"Awards":[]},"58":{"Name":"Classic Roleplaying Adaptation Project - Multiplayer Chat Notification","Author":"Accerak","Submitted":20070408,"Updated":20070408,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.00","Description":"This minor UI change adds a button to the bottom of the MP chat window called \"Notify\" It was created so that players and the dm would have some sort of visual means of telling that someone is either typing or wants to speak next.\n\nTo have the visual effect appear, all that needs to be done is for the Notify button to be pressed in the Chat GUI. This will cause the visual effect to appear over the player�s head, where it will stay, until the Notify button is again pressed.","Rating":9.63,"Votes":4,"Awards":[]},"59":{"Name":"Readable Books","Author":"clubok","Submitted":20070418,"Updated":20070917,"Category":"Major UI Change","Patch":"1.05","Description":"Books that actually look like books! This UI is intended for builders who would like a better book-reading experience in their modules. Features include:\n- Two pages viewable at any time\n- Can turn pages forward and backward\n- Create books with or without Table of Contents\n- Totally data-driven: A 2da file defines the structure of the book, and a tlk file contains the text.\n- Introduces my Enhanced Tag-Based Scripting system. This allows you to use common code for a family of objects.\n- Takes advantage of the patch 1.05 enhancements, so there is no need to change ingamegui.ini.\n- NEW: Support for custom scripting for dynamic page text, or to perform actions upon reading a page.\n\nVersion 1.1: Improved graphics contributed by DavionShores\nVersion 1.2: Added OnRead scripting hook","Rating":9.42,"Votes":17,"Awards":[]},"60":{"Name":"Level Up Screen Change","Author":"TroveLord","Submitted":20070502,"Updated":20071003,"Category":"Minor UI change","Patch":"1.10","Description":"I find that the full level up screen is rather annoying expecially in multiplayer. This modification reduces the screen size of the level up UI aligning it on the right of the screen leaving the whole left part clickable and usable. The 3D model of the character is removed. This way players will be able to control their characters while levelling them up.\nThis does not affect the character creation screen.\n\nTo install: Unpack the xml files in <your documents folder>\\Neverwinter Nights 2\\ui\\default\n\nUpdated for Mask of the Betrayer.","Rating":9.38,"Votes":10,"Awards":[]},"61":{"Name":"Companion Multi-classing","Author":"DMCain","Submitted":20070509,"Updated":20100521,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.00","NWN2Game":"All","Description":"Broken file links pulled. Only version I still had was for the original game. Sorry, I couldn't locate the versions for the x-packs.\n\nThis simple mod allows you to multi-class your companion into any class they are eligible for.\n\nThere are a couple of display bugs I cannot figure out.\n1.. Avatar shows class specific armors instead of current armor.\n2.. Will occasionally highlight a class the character is not eligible for. Ineligible classes cannot be selected though.\n\n** WARNING **\nIf you decide to multi-class your companion into a caster (e.g. wizard), and their casting stat is not 11+, then you will not be able to cast spells.\n\n==> Installation <==\n\n1. Download the file. Right click the file and select \"Save Link As...\"\n2. Place file, levelup_class.xml, into folder: My Documents/Neverwinter Nights 2/override\n3. Enjoy\n\n","Rating":9.59,"Votes":32,"Awards":["Hall of Fame"]},"62":{"Name":"Rod of Preparation","Author":"LostCreation","Submitted":20070517,"Updated":20120731,"Category":"Other","Patch":"1.22","NWN2Game":"All","Description":"I was contacted by KevLs who was interested in updating my little project. Since it's been a very long time since I played NWN2, and am not likely to start to playing again, I gladly gave him my blessing.\n\nIf you enjoyed this mod, please give his a try, you can find it here:\n\nLink\n\nSummary:\n\nThe \"Rod of Preparation\" helps you quickly and consistently recast the same party-buff spells and feats.\n\nThis is the second preview release for 0.04. Fixed a number of bugs from the first preview found through testing. Further feedback is appreciated.\n\nNote that if you used the previous preview release, this version will delete the \"Book of Preparations\" the old release created.\n\n------------------------------------------------------------\nNew in Version 0.04 (preview 2):\n\n- Updated for Storm of Zehir expansion.\n\n- Now uses a custom \"bag\" for storing the preparation in each character's inventory. You can take preparation out of the bag to disable them, and either hold onto them for later, or delete them.\n\n- Anyone in your party can use the rod, not just your main character.","Rating":9.77,"Votes":30,"Awards":["Hall of Fame"]},"63":{"Name":"Expanded Lists for Hi-Rez","Author":"Ragnorak","Submitted":20070520,"Updated":20070526,"Category":"Minor UI change","Patch":"1.05","Description":"Expands all of the \"high-use during normal play\" NWN2 pop-up windows to have\n longer lists more suited for higher resolution displays (at least 960 pixels vertical).\n \n This mod contains nothing but modified XML files, no scripts or new images.\n (easy install, and easier to just use what you want)\n\n Compatibility:\n\nNWN2 Version 1.05\n ","Rating":8.17,"Votes":3,"Awards":[]},"64":{"Name":"Readable Book (with Database)","Author":"nosfe","Submitted":20070523,"Updated":20070524,"Category":"Major UI Change","Patch":"1.05","Description":"this is modification to script \"Readable Book\" of Mr.clubok, now you create easely book with database.\nFeatures include:\n- Two pages viewable at any time\n- Can turn pages forward and backward\n- Create books with or without Table of Contents\n- Totally data-driven: MySQL defines the structure of the book, and contains the text.\n- Introduces my Enhanced Tag-Based Scripting system. This allows you to use common code for a family of objects.\n- Takes advantage of the patch 1.05 enhancements, so there is no need to change ingamegui.ini. ","Rating":5,"Votes":2,"Awards":[]},"65":{"Name":"Fire&Ice's Big Fonts UI","Author":"fire&ice","Submitted":20070527,"Updated":20101201,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"Version: v1.23 NWN2/MotB/SoZ only (older patches will not work)\n\nThis mod aims to provide a better NWN2 UI experience at higher resolutions. By default, the NWN2 UI does not scale and becomes increasingly difficult for some players to read at resolutions of 1280x1024 and above.\n\nThe mod increases the size of fonts in the game. Many NWN2 UI panels are made larger to accommodate the larger fonts.\n\nA zip file and a windows installer are available. The installer places the files in the Neverwinter Nights 2\\ui\\custom\\FI_Big_Fonts_UI folder in your My Documents.\n\nMany thanks to WhatIsSol for all his hard work on this mod.\n\nPlease drop a comment below if you find any clipping problems etc. which you'd like fixed.\n\nInstallation instructions:\n\nSee the readme file. Mod now offers a choice of inventory screens with or without the SoZ cargo button.\n\nTonyK's AI patch:\n\nThis fixes a few UI glitches that occur when you use TonyK's Companion and Monster AI and the Big Fonts UI.\n\nOnly use if the current UI patch is the same version as TonyK's AI. If TonyK's UI is a newer version, don't use an older version of the patch. There will just be some small UI glitches until I make a new patch.\n\nChange log:\n\n 1.23 (29/08/09)\n\n Updated to patch v1.23.\n Included GrinningFool's handy store no-reset patch\n\n 1.22 (28/02/09)\n\n Updated to patch v1.22.\n Merged in the SoZ beta changes.\n Party bar changed to support 10 portraits.\n Removed annoying 'Game Paused' notification from SoZ.\n\n 1.21 (17/11/08)\n\n Updated to patch v1.21.\n","Rating":9.73,"Votes":28,"Awards":["Hall of Fame"]},"66":{"Name":"sunlee's ui themes","Author":"cacysunlee","Submitted":20070529,"Updated":20080112,"Category":"Complete UI Change","Patch":"1.12","NWN2Game":"NWN2:MotB","Description":"update 2 for MotB: \nall old themes are redesigned, some old player wishes added and also a little bit glow.\n\nmain ui screen, start screen, load screen, charakter creation screen, multiplayer screen, minimap, spellbook, store screen and quest journal are adapted to themes.\n\nupdate 2 themes :\nwater, snow, nature, earth, lavastone, drow\nsome old wishes of players : ilithid, bath, leather, talos, mechanus\n\nknown bugs :\nsome corners and borders not adapted\n\n\ninstall :\nextract one of the zip file to :\nMyDocuments\\Neverwinter Nights 2\\ui\\custom\nstart game\n\nuninstall :\ndelete the extracted theme folder\n\nnote : use always only one theme\n\n\nsome wishes? post a link to the seamless texture and don't forget to vote.\nyou can find some seamless textures here : Link\n\nenjoy","Rating":8.61,"Votes":15,"Awards":[]},"67":{"Name":"Size changer","Author":"Saben","Submitted":20070720,"Updated":20080524,"Category":"Minor UI change","Patch":"1.12","NWN2Game":"All","Description":"With one of the later patches it is possible to slightly change the length and girth of your character on creation. You can however only change it 5% up or down from the racial average. This file changes it so length can be modified up or down by 10% and girth up or down by 20%. - Installation: Put the .xml file in your overide folder. ","Rating":8.78,"Votes":10,"Awards":[]},"68":{"Name":"Custom Calendar GUI (Faerunian Harptos Calendar included)","Author":"0100010","Submitted":20070730,"Updated":20070801,"Category":"Other","Patch":"1.06","Description":"This GUI and associated scripts allows you to create your own custom calendar of an arbitrary number of days, including support for zero or one leap days.\n\nYou do this by creating a calendar.2da file, for which a Faerun based calendar is provided as an example.\n\nIn game a player will see a clock icon off to the side (whose hands move every game hour) Clicking on the clock will expand the pane and show the following:\n\nThe current day of the year such as:\n\"1st of Hammer\"\n\nAn additional line of text such as\n\"Summer Solstice\"\n\nAn icon that displays whether or not the sun is rising, setting, or normal. If it is night, it will show the phase of the moon.\n\nThe GUI information gets updated every in game hour for each logged in player.\n\nYou can choose via a script setting to turn off the sun/moon phase icon.\n\nThere are several useful function in the provided scripts that will help you in reconciling your custom calendar with the games internal fixed calendar.\n\nThe custom calendar scripts tracks its information against the internal fixed game calendar, by determining the number of days elapsed since a universal \"sync date\" that you designate.\n\nThis allows you to no longer be bound by a fixed 12 month 28 day cycle as is the default in NWN2. You can have any number of months, with any number of days within them according to how you want to set up your 2DA file.\n\nThe UI files need to be distributed to the clients, the calendar.2da file should be server side only.","Rating":8.69,"Votes":4,"Awards":[]},"69":{"Name":"Lite UI","Author":"Fenumeor","Submitted":20070803,"Updated":20081229,"Category":"Major UI Change","Patch":"1.21","NWN2Game":"All","Description":"A very lite and clean in-game UI.\nOnly useful information showed, no borders and the stuff... (This does not include toggled screens like inventory or stats) \nAnd most things are transparent.\n\nI made it just for myself, so\nit maybe pretty raw and uncomfortable for others. :)\n\nYou can zoom in/out the map by left/right clicking on it.\n\nIf someone has any questions/proposals - post them in comments I'll be around :)\n\nCHANGELOG:\n\nUpdated for MoB:\nThe new version is little less transparent, and the map is round (not square) since the old tweak doesn't work.\n\nFixes (in LiteUI_MotB):\n-fixed the blocking of keyboard when you clicked on a transparent text (this is a NWN bug not mine), I just added transparent backgrounds to such text now.\n-most things can now be moved, just grab them little above/below/side\n-modebar shows bard's bar as well\n-the map is square again, thanks to \"Square Minimap\" mod.\n\nUpdated for Soz:\n-added modified version of \"player menu\"(NWN Eye at the corner):\nit has a day/night indicator, which if pressed brings up a playermenu popup. And AI on/of button.\nIf you can't see the tooltips - move the chat panel a little higher.\n-made sure no new functions are missed\n-some minor changes\n-removed contextmenu.xml, now i just replace the backgrounds.\n\nUpdates:\n-Made all hotbars liter - you can see a small transparent black strip - grab it to move the bars, or just look at it to know where they are\n(make shure you are in a sunny area before you try to position them :) )\n\n-increased the party bar by about 4 slots to see more faces without scrolling\n\nFix:\n-fixed an issue in fontfamily.xml","Rating":9.17,"Votes":5,"Awards":[]},"71":{"Name":"Character Naming and Biography Improvements","Author":"ChiRho84","Submitted":20070805,"Updated":20080319,"Category":"Minor UI change","Forum Thread":"DorMaeglin.com","Patch":"1.10","NWN2Game":"All","Description":"***Updated for MotB***\n\nA simple UI change to permit longer character names and Biographies, it also blanks the default profile.\n\nI originally made this to allow guild members on Dor Maeglin to have a decent guild tag, but just as much use in single player, if you want a fanciful title.\n\nTo install simply put chargen_finish.xml in your Override folder.\n\nRuns entirely on client side, so no need for a server side install.\n\nNote: Many servers enforce maximum lengths for character names (usually quite generous limits though) such maximums would not be affected.\n\nUpdate v1.3: turned the sanitized setting off, as per hahntsak.\n","Rating":9.25,"Votes":5,"Awards":[]},"73":{"Name":"Command Mode Bar","Author":"Sliders","Submitted":20070814,"Updated":20070814,"Category":"Minor UI change","Patch":"1.00","Description":"I always liked and used the separate command bar in xUI package , but i always wanted it to be in the mode bar menu... So I added it to the mode bar at the bottom. I reordered the buttons a bit different than the radial menu or the XiDragon's version - attack, follow, stand, guard, heal (It made more sense to me, and I am used to it from NWN1). ","Rating":9.13,"Votes":2,"Awards":[]},"74":{"Name":"SlimGUI v2.79","Author":"Sliders","Submitted":20070815,"Updated":20090930,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"It all started out as a desire to compile all the various gui tweaks i was using into one (xUI, Slate's Tiny Spell book, Cyricc Compact Character Stats, Gaoneng Player's Handbook etc). I play in 1024 res and the default layout just takes too much space. I really loved the Baldur's Gate UI by Trevor Morris, but it took up even more space. Then I thought of modifying a few things myself...\n\nThese are the changes to the default GUI (I tried to make the panels of uniform size and look - thin borders, transparent black background, smaller buttons, smaller scrollbars etc):\n\n - Character Screen reduced in size to be the same as inventory screen. Changed background, smaller fonts with no outline (much clearer with the black background)...\n - Changed the look of the Inventory\n - Resized Known Spells and Memorized Spells to be the same size as the Inventory, changed look, replaced spell level icons with the ones from NWN1\n - Resized Store, Barter Screens, changed look...\n - Changed Quick Cast drop-down menu and Metadata Grid and look\n - Mini Map changed a lot (square minimap) and Area Map changed just a little bit (not much that can be done there)\n - Smaller Party Bar\n - Added Command bar options in the Mode Bar with the NWN1 Icons\n - Changed the look of Hotbar, Action Queue, Target Enemy, Target Friend, Player Menu, Voice Menu, Journal\n - changed the loading bar in Load Area and Load Module Screens\n(15.08.2007)\n****************************************\n\nTHANKS:\n\nMy sincere thanks goes out to XiDragon for allowing me to use and modify his code to create and give functionality to SlimGUI options screen. XiDragon's (xUI) has been an inspiration to me to make my own UI improvements.\n\n****************************************","Rating":9.77,"Votes":39,"Awards":["Hall of Fame"]},"76":{"Name":"Cypher UI","Author":"Argoyne","Submitted":20070911,"Updated":20070925,"Category":"Other","Patch":"1.07","Description":"This is a cypher puzzle gui. The gui presents a text and gives the player the ability to swap characters around enableing them to solve substitution cyphers. The only information it presents outside of the text is the character frequency.\n\nIts currently very rough (the GUI isn't going to win any prizes) and the program that handles the encypherment is a simple commandline program (though you can just drag a text file onto it).\n\nCurrently its a work in progress, any advice or suggestions are greatly appreciated in particular I'm looking for UI advice any usability issues, I'll be writing a in game text that will describe the premise for solving the cyphers to the player so I'll bundle that in with this package when I do that.","Rating":"N/A","Awards":[]},"78":{"Name":"Smaller Party Bar","Author":"Manel","Submitted":20070929,"Updated":20081205,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"All","Description":"This is stand-alone smaller party bar for 1.10 Patch. There is one you can find on this forum but it does not work with patch 1.10.It seems that the new portrait system is the reason.\n\nThis party bar can show up to 10 companions without scrolling.\n\nInstallation:\nJust extract these file to your \"neverwinter night 2\\ui\\custom\" folder in your \"my document' folder.\n\nV1.1\n - It shows upto 18 of buff(or status) icons of each companion.\n - It is tested that this party bar works with SoZ properly.","Rating":8.88,"Votes":4,"Awards":[]},"79":{"Name":"Smaller Party Bar","Author":"Manel","Submitted":20070929,"Updated":20070929,"Category":"Minor UI change","Forum Thread":"UI","Patch":"1.10","Description":"This is stand-alone smaller party bar for 1.10 Patch. There is one you can find on this forum but it does not work with patch 1.10. it seems that the new portrait system is the reason.\nThis party bar can show up to 10 companion without scrolling.\n","Rating":"N/A","Awards":[]},"80":{"Name":"Inventory Slots","Author":"Forbidden","Submitted":20070930,"Updated":20070930,"Category":"Minor UI change","Patch":"1.10","Description":"Since most of the UI changes haven't updated for 1.10, I decided to do a couple of quick hacks of the inventory screen, since I can't stand the four tiny bags. \n\nThe first one is shamelessly inspired by Charlie's UI, with double-bags below the portrait.\n\nThe second is widescreen-style with all 128 inventory slots shown at once.","Rating":8,"Votes":1,"Awards":[]},"81":{"Name":"Liberation Fonts","Author":"Forbidden","Submitted":20070930,"Updated":20090101,"Category":"Other","Patch":"1.10","NWN2Game":"All","Description":"I can't stand the default fonts in NWN2. While they look all medieval, they're really a pain to read, especially at higher resolution where they are downright tiny.\n\nSo I put in Red Hat's exceptional Liberation fonts and an updated fontfamily.xml. This hack is not for the weak-hearted, it may work well or it may not work at all for you. \n\nThe problem is size. NWN2 stupidly coded the system so that if a text field would be too large for the field, it will not display it AT ALL! This is absurdly sloppy and really bad for any sort of UI scaling. So if you put this in and fields are missing, that's why.\n\nThe fontfamily.xml is a very straightforward file to edit, though, so you can always just go in and change the font sizes to your own preference.\n\nUPDATE: I've added a new fontfamily.xml for SoZ, just overwrite the original one. No changes to the font files themselves.","Rating":"N/A","Awards":[]},"82":{"Name":"Quick-cast Overhaul","Author":"Arutema","Submitted":20071001,"Updated":20071013,"Category":"Minor UI change","Patch":"1.01","NWN2Game":"All","Description":"The quick-cast screen is a great improvement over NWN1, but is not without its flaws. The Spontaneous Conversion checkbox is small and hard to find, and the metamagic icons are too small on a high-res display.\n\nThis overhauls the quick-cast UI, with larger metamagic icons down the side, and a large Spontaneous Conversion button at the top.\n\n1.01: Fixes a bug where 8+ prepared spells wouldn't display properly. Added support for the Warlock Buddy.","Rating":9.5,"Votes":2,"Awards":[]},"83":{"Name":"Big Bag Inventory","Author":"LCountach","Submitted":20071003,"Updated":20090110,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"All","Description":"This a complete overhaul of the default inventory.\n\nWhat is New? Everything!\nLarger 3D Character Window\nRepositioning of the Armor, Weapon, and Jewelry slots.\nOne Big Bag Inventory that shows your entire inventory in a single window!\nAdditionally many quick reference Statistics:\nCharacter Attributes\nSaving Throws\nAttack Bonuses\nWeapon Damage\nSpell Resistance\nArmor Penalties\n\nAll that without the need to scroll through the character window to check your buffs & bonuses!\n\nBug Note: I am new to scripting so I just don't have the knowledge base to debug everything. I have found no other bugs and everything is working great for me. Feel free to post a comment here if you find a bug or just have an Idea. If I see the comment, can fix the bug, or like the idea I will re-release a updated version.\n\nUpdates: v1.00 SoZ\nQuick dirty fix for SoZ\n\nUpdates: v1.00\nBug Fix: Dynamic Updating is now working!\nOrganization of the statistics menu.\nMinor tweaks to the layout.\n\nUpdates: v.99a\nFixed a bug where the first four boxes in the last line of the inventory could not be used.\n\nUpdates: v.99\nOriginal Release.\n\nNews Update: 10-26-2007\nI now have MotB. I have tested my inventory in game and all seems to be working. However in regards to the \"Sexy OC\" armor you see in my screenshots. That addon breaks in MotB. I have created an Addon to fix it. Look here: Link\n\nNews Update: 10-28-2007\nSliders creator of \"SlimGUI\" has made an adaptation of my Big Bag layout for use in his UI mod. Check it out here: Link","Rating":9.02,"Votes":15,"Awards":[]},"85":{"Name":"Advanced Screen","Author":"jm","Submitted":20071013,"Updated":20071211,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"All","Description":"The idea is to cut by half all the windows of information around the game.\nOn the pic, we can see the 4 hotbars, the action queue, the chat window and the event window.\nThe menu player has been dragabled and reduced too in order to fit all horizontal bars at the bottom.\nThe party bar has been reduced by half too and the buffs now stand on 2 lines instead of 3.\nThe target object or the target character has been also reduced.\nYou can adjust the position of each bars and the minimum height of both chat windows has been reduced too.","Rating":8.5,"Votes":2,"Awards":[]},"86":{"Name":"MotB viable Companion multiclass","Author":"hahntsak","Submitted":20071022,"Updated":20071023,"Category":"Complete UI Change","Patch":"1.10","NWN2Game":"NWN2:MotB","Description":"I finally made this work for MotB. DMCain wrote it originally but apparently no longer is involved with nwn2. ","Rating":10,"Votes":3,"Awards":[]},"87":{"Name":"Square Minimap (SlimGUI)","Author":"Sliders","Submitted":20071025,"Updated":20071026,"Category":"Minor UI change","Patch":"1.10","NWN2Game":"All","Description":"Check out the screen-shots.","Rating":9.08,"Votes":5,"Awards":[]},"88":{"Name":"Larger Minimaps","Author":"fire&ice","Submitted":20071028,"Updated":20081220,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"NWN2","Description":"Compatibility: NWN2, MotB, SoZ v1.21\n\nThis UI mod provides a number of larger-sized minimaps: 120%, 150% and 200%. Each minimap comes in a version with standard sized markers (e.g. map pins) and a version where the markers are also scaled by 120%, 150% or 200%.\n\nYou can try out the different minimap sizes and choose the one you want. I recommend the 150% scale normal-sized markers minimap for play at 1280x1024.\n\nIn the normal NWN2 UI you can double click on the minimap top bar to double its size. This behaviour is retained in this mod - if you double click on the top bar the minimap will be doubled from its original (larger) size. \n\nI've also included the perl script used to generate the different files. If you know how to use perl you can use the script to generate a minimap of whatever size you like. See the readme for further details.\n\nIf you would like a different size than the ones I've provided (bigger or smaller) leave a note below and I'll see what I can do.","Rating":9.63,"Votes":2,"Awards":[]},"89":{"Name":"22 Icon Hotbar","Author":"fire&ice","Submitted":20071111,"Updated":20071212,"Category":"Minor UI change","Patch":"1.11","NWN2Game":"All","Description":"Extends the horizontal hotbar to 22 icons. This fills the bottom of the screen at 1280x1024 resolution, with the NWN2 icon and mode bar displayed.\n\nThe mod is inspired by Razio's original toolbar mod but updated for MotB v1.10. It's not tested with NWN2 v1.10 but may work - please leave a comment if you try it without the expansion.\n\nOne bug: Pressing the down arrow when on hotbar sheet 1 confuses NWN2 a bit and the icons disappear or resort. Just press up a few times to get back to the real hotbar sheet 1.\n\nPlease leave any comments below.\n\nInstallation:\n\nUnzip the zip archive to your\n\nMy Documents\\Neverwinter Nights 2\\ui\\custom\n\nfolder. This should create an\n\nhotbar_22icons\\\n\nfolder.\n\nStart the game as normal.\n\nVersion history:\n\n1.1 (12/11/07)\n\nImproved toolbar texture\n\n1.0 (11/11/07)\n\nInitial release","Rating":9,"Votes":1,"Awards":[]},"90":{"Name":"Ten Portraits","Author":"fire&ice","Submitted":20071122,"Updated":20081220,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"All","Description":"Allows ten (or twelve) character portraits to be shown in the party bar before the scrollbar appears.\n\nThis is useful when you have multiple casters in your parties with summons and familiars.\n\nNew versions for SoZ have been provided. If you don't have SoZ installed, you may have better results with the older version (but feel free to try the SoZ version if you wish).\n\nThe ten portrait bar needs 860 pixels of vertical height and the twelve portrait bar needs 1032 pixels, so you need a resolution of at least this in order to use the mods.\n\nInstallation:\n\nUnzip the zip archive to your\n\nMy Documents\\Neverwinter Nights 2\\ui\\custom\n\nfolder. This should create an\n\nten_portraits_soz\\ or twelve_portraits_soz\\\n\nfolder.\n\nStart the game as normal.","Rating":9.17,"Votes":3,"Awards":[]},"91":{"Name":"2 Row Minimalist Hotbar","Author":"Nygle","Submitted":20071126,"Updated":20081005,"Category":"Minor UI change","ShowCode":"<?xml version=\"1.0\" encoding=\"utf-8\">\n\n<UIScene name=\"SCREEN_HOTBAR\" OnAdd=UIScene_OnAdd_SetupHotbar(\"HOTBAR_GRID\") x=95 y=ALIGN_BOTTOM width=374 height=60 draggable=true priority=\"SCENE_INGAME\" idleexpiretime=0.5f />\n\n\t<UIText name=\"CurrentHotBar\" align=left valign=middle x=1 y=20 width=20 height=20 fontfamily=\"Default\"\n\tupdate=true OnUpdate=UIText_OnUpdate_UpdateHotbarPage(\"HOTBAR_GRID\")/>\n\n\t<!-- Grid Scroll Up -->\n\t<UIButton name=\"GridUp1\" x=0 y=0 width=10 height=19 OnLeftClick=UIButton_Input_HotbarIncrement(\"HOTBAR_GRID\") >\n\t\t<UIFrame state=up\t\tfill=\"b_scrlu_normal.tga\" />\n\t\t<UIFrame state=down\t\tfill=\"b_scrlu_pressed.tga\" />\n\t\t<UIFrame state=focused\tfill=\"b_scrlu_hover.tga\" />\n\t\t<UIFrame state=hilited\tfill=\"b_scrlu_hover.tga\" />\n\t\t<UIFrame state=hifocus\tfill=\"b_scrlu_hover_pressed.tga\" />\n\t\t<UIFrame state=disabled\tfill=\"b_scrlu_normal.tga\" />\n\t</UIButton>\n\t\n\t<UIButton name=\"GridDown1\" x=0 y=40 width=10 height=19 OnLeftClick=UIButton_Input_HotbarDecrement(\"HOTBAR_GRID\") >\n\t\t<UIFrame state=up\t\tfill=\"b_scrld_normal.tga\" />\n\t\t<UIFrame state=down\t\tfill=\"b_scrld_pressed.tga\" />\n\t\t<UIFrame state=focused\tfill=\"b_scrld_hover.tga\" />\n\t\t<UIFrame state=hilited\tfill=\"b_scrld_hover.tga\" />\n\t\t<UIFrame state=hifocus\tfill=\"b_scrld_hover_pressed.tga\" />\n\t\t<UIFrame state=disabled\tfill=\"b_scrld_normal.tga\" />\n\t</UIButton>\n\n\t<!-- Hotbar Grid -->\n\t<UIGrid name=\"HOTBAR_GRID\" rows=2 columns=12 x=11 y=1 xPadding=0 yPadding=0 update=true OnUpdate=UIGrid_OnUpdate_UpdateHotbarGrid() >\n\t\t<UIHotbarButton name=\"HOTBAR_BUTTON\" height=30 width=30 draggable=true prototype=true \n\t\t\thotbartype=\"HOTBAR_BUTTON\"\n\t\t\tMouseDragSFX=\"gui_drag\" MouseDropSFX=\"gui_drop\"\n\t\t\tOnRadialRequest=UIObject_OnRadial_DisplayInventoryRadial()\n\t\t\tOnLeftClick=UIButton_Input_HotbarLeftClick() \n\t\t\tOnRightClick=UIButton_Input_HotbarRightClick() \n\t\t\tOnMouseDropReceived=UIButton_OnDropReceived_SetHotbarButton() \n\t\t\tOnMouseDropFailed=UIButton_OnDropFailed_ClearHotbarButton()\n\t\t\tupdate=true OnUpdate=UIButton_OnUpdate_UpdateHotbarButton()\n\t\t\tOnToolTip=UIObject_Tooltip_DisplayHotbar(OBJECT_X,OBJECT_Y,SCREEN_TOOLTIP_2,ALIG\nN_NONE,ALIGN_NONE,0,0,ALIGN_LEFT) >\n\t\t\t<UIText name=\"HOTBAR_TEXT\" width=PARENT_WIDTH color=\"HotbarText\" height=PARENT_HEIGHT align=center valign=middle fontfamily=\"Body_Font\" style=\"1\"/>\n\t\t\t<UIFrame state=base\t\tfill=\"b_hb_normal.tga\" />\n\t\t\t<UIFrame state=up\t\tfill=\"b_empty.tga\" />\n\t\t\t<UIFrame state=down\t\tfill=\"b_overlay.tga\" />\n\t\t\t<UIFrame state=focused\tfill=\"b_empty.tga\" />\n\t\t\t<UIFrame state=hilited\tfill=\"b_overlay.tga\" />\n\t\t\t<UIFrame state=hifocus\tfill=\"b_overlay.tga\" />\n\t\t\t<UIFrame state=disabled fill=\"b_empty.tga\" />\n\t\t</UIHotbarButton>\n\t</UIGrid>\nSelect All Text | View Code in separate window","Patch":"1.13","NWN2Game":"All","Description":"Nothing Special, just Small and Compact.","Rating":9.75,"Votes":2,"Awards":[]},"92":{"Name":"quickchat(for raurin)","Author":"necrosis","Submitted":20071207,"Updated":20071208,"Category":"Complete UI Change","Patch":"1.10","NWN2Game":"NWN2:MotB","Description":"Fast chat for Raurin planes server","Rating":"N/A","Awards":[]},"93":{"Name":"Uncensored & Long Character Names","Author":"hahntsak","Submitted":20071220,"Updated":20071220,"Category":"Complete UI Change","Patch":"1.00","NWN2Game":"NWN2:MotB","Description":"This is SunryzeR's uncensored names with ChiRho84's longer names and biography improvements. I just combined the abilities for those who don't desire to edit files.","Rating":"N/A","Awards":[]},"94":{"Name":"Simple Inventory","Author":"morian_a","Submitted":20071231,"Updated":20080101,"Category":"Minor UI change","Patch":"1.11","NWN2Game":"NWN2","Description":"Highlights:\n* No 3D \"paper doll\" taking up space (your character already is on screen anyway).\n* Equipped slots loosely arranged in a right hand, torso, left hand manner.\n* Equipped items for the right hand, left hand, head, armor, and feet are emphasized (larger in size).\n* Unequipped items are given more breathing room (8 slots wide by 8 slots high) to reduce tab thrashing and ease organization.","Rating":9.21,"Votes":8,"Awards":[]},"95":{"Name":"Player's Handbook (updated version)","Author":"gaoneng (maintained by fire&ice)","Submitted":20080105,"Updated":20081220,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"All","Description":"Player's Handbook is an in-game manual add-on for Neverwinter Nights 2. It presents detailed information on all playable races, classes, skills and abilities, feats, and spells in an organized format.\n\nThe files below are updated version of gaoneng's originals. Archives for NWN2, MotB and SoZ are provided.\n\nNote: In in order to install this mod you need to make changes to a UI ini file. Read the enclosed readme.html for details. Thanks.\n\nEnjoy.","Rating":9.42,"Votes":8,"Awards":[]},"96":{"Name":"DMFI Bulletin Board","Author":"Qkrch","Submitted":20080110,"Updated":20080110,"Category":"Other","Patch":"1.11","NWN2Game":"All","Description":"Is a board where players can write their messages and others can read it :). It stores permanently all messages and displays\nthe last 15 as a real board. You can write your own topics, reply to the existent topics or delete them. Every message is included into a category that it is displayed with different scroll icons.\n\nNotes:\n\n\n- The board needs a pencil to write into it. If you don't need this pencil for your players just edit the board blueprint placeable -> Variables and change it to 0 instead of 1.\n- This uses Bioware NWN1 Database (dmfi standards, easy and simple), if you want to edit this board for nwnx would be easy but it's not on my plans, so you're free to edit it and i would love to see a nwnx version.\n- The database is stored in database folder. You can manually watch it with DBFviewer.\n- Delete topic is only available for DMs.\n- Known game issues: in the inputboxes never begin a phrase with a number and don't use ' or \"\". WIll not display the message.\n- The Board Model and texture was also done by Qk, you can adjust this model to a placeables.2da if you liked it.\n\n\n","Rating":9.71,"Votes":21,"Awards":[]},"97":{"Name":"uimod - no_paperdoll_invetory_below","Author":"mindtrick","Submitted":20080129,"Updated":20080202,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"All","Description":"took the idea and part of the bgtexture from morian_a's \"Simple Inventory\" uimod cause i liked the no paperdoll idea but not the inventory on its right - credits go to morian_a !\n\nmy \nno paperdoll ui mod\nwith inventory below and \nno stupid sortbutton that i\naccidentaly hit and go nuts\nno borderlines\nno inventory icon in the upperleft\nand a simple roundedge alpha\nhas otherwise the same features as Simple Inventory\n\n* No 3D \"paper doll\" taking up space (your character already is on screen anyway).\n* Equipped slots loosely arranged in a right hand, torso, left hand manner.\n* Equipped items for the right hand, left hand, head, armor, and feet are emphasized (larger in size).\n* Unequipped items are given more breathing room (8 slots wide by 8 slots high) to reduce tab thrashing and ease organization.\n\nUsing this for some time now thougt i should share :)\n\nHave Phun\nMindtrick\n\n-added 3 other versions with 4 bags and sortbutton ","Rating":9.5,"Votes":1,"Awards":[]},"98":{"Name":"Player's Handbook - Special Editions","Author":"Player's Handbook Team","Submitted":20080203,"Updated":20080830,"Category":"Minor UI change","Patch":"1.13","NWN2Game":"NWN2:MotB","Description":"The Special Edition Player's Handbooks include information on custom content from the community. Handbooks are available for content from Reeron and Kaedrin at present.\n\nEach Player's Handbook is an in-game UI manual. They presents detailed information on all playable races, classes, skills and abilities, feats, and spells in an organized format. All Handbooks include the base NWN2/MotB details and each Special Edition Handbook contains additional content from different community add-ons.\n\nHandbooks are available including the content from:\n\nKaedrin and Reeron's Combined PrCs, Feats, and Spells Link\n\nReeron and Trekari's Spell Fixes and Improvements Link\n\nDownload and Installation:\n\nDownload the correct zip file below and consult the readme.html for installation instructions (you need to edit ingameuix1.ini). The Handbooks require MotB.\n\nCredits:\n\nNormal Player's Handbook edition for MotB or NWN without extra hakpacks: Link\n\nThe Player's Handbook was originally by gaoneng and is now updated by the Player's Handbook Team.","Rating":9.88,"Votes":2,"Awards":[]},"99":{"Name":"Readable Books (LB)","Author":"Lance Botelle","Submitted":20080306,"Updated":20100120,"Category":"Complete UI Change","Forum Thread":"Althéa Campaign Blog","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"READABLE BOOKS\n*** Last Update 17th February 2009 ***\n\nv1.04 - Fixed iOnceOnly section of PageEvents function. Fixed some typos that could mislead.\n\nv1.03 - Made compatible with fontfamily.xml change with SoZ.\n\nv1.02 - Made code compatible with companion use of books.\n\nv1.01 - Made code more compatible for those who wish to mix books with a Table of Contents and pictures.\n\nThis module is based upon work previously done by clubok, which can also be found at the Vault: Link\n\nMODULE DETAILS:\nMy version does not use or rely upon TLK or 2da edits. All text and page events are input and controlled through one script that must be updated as required by the builder. A full ten page PDF manual supplied with the module goes into more details.\n\nMany of the features remain the same as clubok's original:\n\n- Two pages viewable at any time \n- Can turn pages forward and backward \n- Create books with or without Table of Contents \n\nI have introduced a few additions of my own:\n\n- Table of Contents stays open and works with the same book now.\n- Picture Books: View pictures within the books.\n- Read Language Scroll magic item.\n- Wizard/sorcerer spell book. (Personal requirement.)\n- Multiple events per page and not just book.\n\nReadable Books Comments On The Althéa Blog: Link","Rating":9.93,"Votes":26,"Awards":["Hall of Fame"]},"100":{"Name":"Charlie's CNR GUI","Author":"charlievale","Submitted":20080329,"Updated":20080606,"Category":"Other","Patch":"1.12","NWN2Game":"NWN2:MotB","Description":"This is a GUI for use with Craftable Natural Resources (CNR)\n\nBackground\nCNR is a scripted crafting system, originally for NWN 1. Oblach was updating CNR for NWN2 here\n\nI recieved a request to build a UI for the CNR. I downloaded Oblach's test module (vers 1.00 7/11/2007) and built a GUI for the PC interaction with the devices. I also adjusted the conversations to NWN1 style so they were easier to use for crafting.\n\nPlayers\nThis is not for use with the Official Campaign. It is a resource for PW and module builders.\n\nBuilders\nThis is for module builders who have added CNR to their NWN2 module, but would like to have GUI rather than conversation driven crafting. I will not be fixing/updating the CNR code itself as I haven't used CNR in a module, but will support the GUI code.\n\nTo Run the Test Module\n\n * Unzip the download.\n * Copy \"cnr_gui.mod\" to your module directory.\n * Copy the folder \"Charlie - cnr_ui\" to \"My Documents\\Neverwinter Nights 2\\ui\\custom\" (or your override folder).\n * Start cnr_gui as a new game.\n\n\nImporting the GUI\nTo add the GUI into an existing module that uses CNR you will need to create an erf from the module of the following scripts:\n\n * \"cnr_device_ou\"\n * \"cnr_forge_ou\"\n * \"cnr_tinker_ou\"\n * \"cnr_gui\"\n * \"cnr_gui_recipe_utils\"\n * \"gui_cnr_choose\"\n * \"gui_cnr_clear\"\n * \"gui_cnr_craft\"\n * \"gui_cnr_menu_page_next\"\n * \"gui_cnr_menu_page_previous\"\n * \"gui_cnr_recipe_up\"\n\n\nNote: The scripts : \"cnr_device_ou\", \"cnr_forge_ou\" and \"cnr_tinker_ou\" will overwrite existing CNR scripts. These scripts originally fired the crafting conversation, they now fire the GUI.\n","Rating":9.67,"Votes":5,"Awards":[]},"101":{"Name":"Captured Spell Books (LB)","Author":"Lance Botelle","Submitted":20080513,"Updated":20100120,"Category":"Complete UI Change","Forum Thread":"Althéa Campaign Blog","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"CAPTURED SPELL BOOKS\n**** Last Update 30th January 2009: ****\n\nVERSION 1.04\n=========\n\n*** UPDATED TO WORK WITH SOZ SPELLS - BOTH RANDOMLY & ABLE TO BE ADDED WITH THE DM TOOL ***\n*** NB: BUILD NOTE: USE SPELL NAMES AS IN THE TOOLSET BLUEPRINT TO ADD AS VARIABLES TO BOOKS AT BUILD TIME (MANUAL UPDATED WITH VARIABLE NAMES) ***\n\nNEW SPELLS ADDED WITH SOZ: \n\n1st: Blades of Fire/Lesser Orbs (ALL)/Reduce Person (TOTAL ADDED: 8 - From 21 > 29)\n2nd: Animalistic Power/Bladeweave/Snakes Swiftness (TOTAL ADDED: 3 - From 33 > 36)\n3rd: Mass Snake's Swiftness (TOTAL ADDED: 1 - From 28 > 29)\n4th: Orbs (ALL)/ Mass Reduce Person (TOTAL ADDED: 6 - From 26 > 32)\n5th: Arc of Lightning/Greater Reduce Person (TOTAL ADDED: 2 - From 19 > 21)\n\n1) *** MAJOR FIX *** Fixed the MakeSpellList function inside the alb_sbfunctions include file. (Not every spell was being cached.)\n2) Made reading spellbooks MODAL so PCs cannot be swapped during a read.\n3) Fixed a couple of spell entries that were not returning scrolls.\n\nThis module uses the same artwork as my Readable Books (LB), which can also be found at the Vault: Link\n\nMODULE DETAILS:\nCaptured Spell Books allows a builder to add spell books to their modules that can be found and copied by PC's.\n\nA number of global parameters can be set to ensure a good selection of books with varying spells of different levels can be made. Alternatively, a default book setting serves well.\n\nThe demo module also includes a DM Tool to allow a DM to alter spell book parameters and create random spell books on the fly.\n\nCaptured Spell Books Comments On The Althéa Blog: Link","Rating":8.92,"Votes":3,"Awards":[]},"102":{"Name":"New Container Window","Author":"wormwood811","Submitted":20080516,"Updated":20080516,"Category":"Minor UI change","Patch":"1.12","NWN2Game":"All","Description":"My first mod. Changes the container window to display more items at once. There are other mods that do this but they haven't been updated in a while and have the problem of long names not displaying. The difference in this version is that long names will be truncated, rather than not displaying at all, and the \"Loot All\" button has been changed to a bag icon in the upper right corner of the window.","Rating":10,"Votes":1,"Awards":[]},"103":{"Name":"*In Progress* NWN1 Gui Porting to NWN2","Author":"ebear - 'E Halls'","Submitted":20080519,"Updated":20080907,"Category":"Major UI Change","Patch":"1.12","NWN2Game":"All","Description":"Note: I would like it if people could start voting now as to get the project a bit of attention and possibly a couple more hands to revise and/or make derivatives.\n\nThanks!\n\n**Not Complete, still in development**\n\n\nI intend to recreate the look and feel of NWN1's gui whilst updating it to utilise any new features from NWN2.\n\nI am also accepting custom modification requests to apply to the GUI once a base build has been completed.\n\n\n***Progress Report***\n\nI have moved the progress report to a post on a blog in order to utilise custom html and javascript code in representing the progress( which will be applied shortly). \n\nFor updated status on this project's progress please link here.\n\n\n***Installation Instructions***\n\nJust extract the file contents to My Documents\\Neverwinter Nights 2\\ui\\default\\. Then start up NWN2, and to uninstall simply delete those extracted files. Make sure you don't overwrite any other custom gui files \n\nViconius's style Non-scrolling over-the-head text (NWN1 style) mod will be incorporated at some point. Thanks Viconius!\n\nHope you like this GUI conversion and Thanks in advance for your feedback.\n\n\nThanks to:\n\nCyricc: for your square map and expanded loot window mods. I hope you don't mind me incorporating it, else please email me.\n\nForbidden: for the liberation fonts you posted in the vault.\n","Rating":8.63,"Votes":6,"Awards":[]},"104":{"Name":"XP Bar","Author":"Seranne","Submitted":20080531,"Updated":20080531,"Category":"Minor UI change","Patch":"1.12","NWN2Game":"NWN2:MotB","Description":"This is a little GUI box that adds an XP bar to the player's screen. This is completely in HAK form - there's no need to import scripts or anything else. Just read the readme, try the demo and use the hak. I included the script source in the hak so feel free to play with it.\n\nIt's draggable so you can move it to whereever you like it.\n\nAny questions or issues, let me know!","Rating":10,"Votes":7,"Awards":[]},"105":{"Name":"Alzikar's Improved Examine window","Author":"Alzikar","Submitted":20080605,"Updated":20121016,"Category":"Minor UI change","Patch":"1.12","NWN2Game":"All","Description":"I've downloaded and installed quite a few of the UI mods and haven't seen one that addresses one of the most annoying aspects of the default UI.\n\nEverytime I examined an item, I'd need to scroll down in NWN2's default tiny inspection window to actualy see the item's stats. After the X hundreth tiime and an aching hand later, I decided to do something about this, so I modified the examine screen to display a larger area, which eliminates the need to scroll down when examining items for most items in the game.\n\n!NOTE: This is optimized for 1024x768 resolution.\n\n\nI also modified the Slim UI green skin examine window (for 1024x768) to do the same thing, as I was using that UI for awhile; however, I uninstalled it because the {Slim GUI} hotbar buttons did not work correctly. I included my modification to Slider's GreenUI for posterity.\n\n*Update 10/16/2012 - Provided a 1600x900 sreeen resolution optimized version of the Slim GUI Gold inspection screen.\n\nThis should work will all versions of NWN2. Tested with Storm of Zehir patch 1.23.","Rating":10,"Votes":6,"Awards":[]},"106":{"Name":"Disable MiniMap via Placeable Hak","Author":"Burton Finch","Submitted":20080725,"Updated":20080725,"Category":"Other","Forum Thread":"Link","Patch":"1.12","NWN2Game":"NWN2:MotB","Description":"This is a HakPak with a demo module showing off a placeable I created that will block the entire area it covers from being viewed by the players minimap and the players area map. ","Rating":"N/A","Awards":[]},"107":{"Name":"Lockpicking & Trap Disarming UI's","Author":"Little Baron","Submitted":20080828,"Updated":20081101,"Category":"Other","Patch":"1.13","NWN2Game":"NWN2:MotB","Description":"**New & Improved + with Trap Disarming**\n\nImprovements to Lockpicking UI:\n-Much snappier & NWN2 design friendly graphics & more immersive \"buttons\"\n-Added 2 new progress bars for more feedback\n\n*****\nMy solution to make lockpicking & trap disarming an interactive experience. Basically it pops up trap disarming or lockpicking \"minigames\" that incorporates your lockpicking/disarming/detection skills and thieve's tool bonus' into the mix. \n\nIf it adds a little fun to a few projects I'll be happy.\n\nSee the ReadMe for more info.\n****INSTALLATION to try it out:\n\nPut the LilB_LockTrap_UI.hak in the hak folder.\n\nPut the Lock_Fest_2008.mod in the mod folder.\n\nPut the lockpicker.xml & trappicker.xml file into the UI/custom folder.\n\nEnjoy!\n\n****INSTALLATION to use in your own mod:\n\nPut the LilB_LockTrap_UI.hak in the hak folder.\n\nPut the LilB_LockTrap.erf somewhere you can find it, then import it into your mod.\n\nPut the lockpicker.xml & trappicker.xml files into the UI folder under \"custom\".\n\n(The .erf contains several scripts beginning with GUI_Trap* or GUI_Lock*, several container blueprints, 1 door blueprint & 1 Trigger blueprint to get you started).\n\nPlease remember to give me props! Otherwise, you can adjust the XML or scripts to suit your needs with my full blessing.\n\n\n\nKnown Issue: For doors, rogue characters will first attempt to open the lock normally, but as soon as the \"unlocking\" progress bar\nfinishes the GUI will open as intended. \nFor triggers, if you fail to disarm the trap and then click on it your PC will keep trying to disarm it the \"old\" way forever until you click on the ground somewhere else.\nSee ReadMe for more info.","Rating":9.75,"Votes":6,"Awards":[]},"108":{"Name":"Realmspace Astrology","Author":"Boozehound Blue","Submitted":20080903,"Updated":20090605,"Category":"Other","Forum Thread":"Link","Patch":"1.22","NWN2Game":"NWN2:MotB","Description":" When I heard the learn'd astronomer, \nWhen the proofs, the figures, were ranged in columns before me, \nWhen I was shown the charts and diagrams, to add, divide, and measure them, \nWhen I sitting heard the astronomer where he lectured with much applause in the lecture-room, \nHow soon unaccountable I became tired and sick, \nTill rising and gliding out I wander'd off by myself, \nIn the mystical moist night-air, and from time to time, \nLook'd up in perfect silence at the stars. \n ~Walt Whitman\n\nRealmspace Astrology combines the true science of tracking our own solar system�s celestial bodies, the zodiac and solar system of Realmspace (per Dragon issue #340), and traditional western astrological interpretation into 3 gui: an astronomical clock for determining celestial positions, a Jyotish-style astrological chart and a synastric (relationship) chart for viewing and interpreting the many various aspects presented.\n\nHIGHLIGHTS\n�Determine planetary positions of nine major celestials, including retrograde conditions, for any date, time and location from years 0-9999 with to-the-minute accuracy.*\n�Determine moon (Selûne) age, phase, and lunar node positions.\n�Determine comet K�thoutek�s position and track its approach to the Sun (perihelion).\n�Determine positions for the 12 Houses of Heaven. (Porphyry house system.)\n�Determine 5 major planetary aspects (conjunction, opposition, trine, square and sextile).\n�Determine the essential dignity of a celestial (natural rulership, exaltation, accidental rulership, triplicity, detriment or fall).\n�Determine both elemental (fire-earth-air-water) and mode of activity (fixed-cardinal-mutable) makeup for any given chart.\n�Receive an in-depth natal or synastric reading of all charts created. Over 700 unique pieces of interpretative content!\n�Reserved custom tlk range to easily fit into your own, plus ample padding for associated feats, spells, etc.\n�Functionality to determine Moon mansion, Greek/Hermetic Lots (Arabic Parts) and more!\n\nThis system provides a compelling link between a player and their character, which I believe can lead to more immersive and dynamic game play. Essentially, a player can input his or her very own birth data (just as with any astrology website) and receive a remarkably accurate and highly unique reading. Should they create a second chart, they can likewise receive an in-depth analysis of the relationship between the two subjects.\n\nAdditional functionality pending: determining and signaling various astronomical events (full moons, solar eclipses, etc.); further tests for rare astrological configurations (Grand Cross, Trine, etc.); and added features for DMing and multiplayer.\n\nI will be updating this gui and including added functionality, so please leave feedback regarding any bugs, errors, and discrepancies, as well design suggestions and possible additions. Any insight to interpretive content geared more toward fantasy appreciated.(Comment here or pm me through the link.)\n\nI will also be adding more robust documentation to address builders' possible questions.\n\nThanks for the look!\n\n\nNotes: \n�To view the synastric gui, activate the astrology chart item and target another chart.\n�Retrograde conditions, though calculated, are yet to be displayed.\n�Check the client log for a printout of the various data.\n�Zodiac translation guide:\n Aries = Beholder\n Taurus = Harpy\n Ettin = Dryad\n Leo = Stirge\n Virgo = Wyvern\n Libra = Dragon\n Scorpio = Unicorn\n Sagittarius = Hydra\n Aquarius = Chimera\n Pisces = Basilisk\n�Celestial translation guide:\n Moon = Selûne\n Mercury = Anadia\n Venus = Coliar\n Mars = Karpri\n Jupiter = Chandos\n Saturn = Glyth\n Uranus = Garden\n Neptune = H'Catha\n\n*Accuracy may vary due to limitations of the algorithms, rounding and possible error. Please report if any egregious variations occur, that I may determine the source (but consider your �standard� as well).\n\nReference\nKumar, G. \"The Computation of Houses.\"\nMaclean, Hal. \"The Stars Are Right.\" Dragon. Issue #340, Feburary 2006. (Realmspace zodiac.)\nManwaring, Curtis. \"Signification and Philosophy of the Greek Lots.\"\nMcClain, Michael. Numerology-Astrology[dot]com (Interpretive content) \nShylter, Paul. \"How to Compute Planetary Positions.\"\n**Resource**\n Astrodienst. astro[dot]com (natal charts for comparison)\nMorton, E.W. \"Master Astrologer\", Dragon #340, February 2006.\nNASA JPL HORIZONS Web-Interface. California Institue of Technology. (online ephemerides)\nRealmspace Overview. (spelljammer[dot]org)\nWikipedia. (Julian Day/Astrology/Astronomical Events & Related)\n","Rating":10,"Votes":6,"Awards":[]},"109":{"Name":"NWN2 Style Dialog for NWN1 Dialogs","Author":"eledin","Submitted":20080924,"Updated":20080927,"Category":"Minor UI change","ShowCode":"<!-- This is the font used by the NWN1 Dialog system and various other screens as well-->\n\t<UIFontFamily name=\"NWN1_Dialog\" >\n\t\t<UIFontNormal\t\tfont=\"Arialbd.ttf\"\tpointsize=16 dropshadows=false outline=false />\n\t\t<UIFontBold\t\t\tfont=\"Arialbd.ttf\"\tpointsize=16 dropshadows=false outline=false />\n\t\t<UIFontItalic\t\tfont=\"Arialbi.ttf\"\tpointsize=16 dropshadows=false outline=false />\n\t\t<UIFontBoldItalic\tfont=\"Arialbi.ttf\"\tpointsize=16 dropshadows=false outline=false />\n\t</UIFontFamily>\n\nSelect All Text | View Code in separate window","Patch":"1.00","NWN2Game":"All","Description":"This UI changes the look of NWN1 style dialogs, also known as quick chat dialogs, to look more like NWN2 dialogs (take a look at the screenshots).\n\nI have changed the fonts of NWN1 dialogs to best fit the new UI.\n\nPlease note that this was made for the 1024x768 resolution. You are free to change quickchat.xml and ajust it to a different resolution.\n\nInstallation Instructions\n==========================\n\n* Copy the quickchat.xml file to \"My Documents/Neverwinter Nights 2/ui/custom/sliders\"\n\n* If you only want the NWN1 dialog fonts to be changed, edit the \"My Documents/Neverwinter Nights 2/ui/custom/sliders/fontfamily.xml\" file. Replace the \"NWN1_Dialog\" section with the code you see on top. \n \n* If you want all NWN fonts to be changed (to Arial font family) just copy the fontfamily.xml file to \"My Documents/Neverwinter Nights 2/ui/custom/sliders/\"","Rating":8.25,"Votes":3,"Awards":[]},"110":{"Name":"United Colors SoZ ver.","Author":"XiNAVRO","Submitted":20081119,"Updated":20081120,"Category":"Major UI Change","Patch":"1.21","NWN2Game":"NWN2:SoZ","Description":"== United Colors: Storm of Zehir compatible version ==\n\nThis is the SoZ compatible version of United Colors. Note that I have not created United Colors; I simply modified the existing version of it to support SoZ. It was no more than editing one single entry and copy-pasting a few lines, so all credit goes to the original author, gaoneng.\n\nOh, and if by any chance gaoneng feels insulted and requires me to delete this, I will, since I have not gained his permission to edit his work. Unless that happens, enjoy!\n\n\n- XiNAVRO\n\n\n\n\n*Original version of United Colors is available from the following link:\nLink","Rating":7.92,"Votes":3,"Awards":[]},"111":{"Name":"Two-Rowed Hotbar (SoZ)","Author":"JOG","Submitted":20081122,"Updated":20081214,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"NWN2:SoZ","Description":"This is a Hotbar with 2x12 slots and additional UI buttons\n\nThe UI-buttons come in two flavors:\n\nVariant 1: \nCharacter-Sheet / Inventory / Spellbook \nExploration-Mode / Strategy-Mode / Character-Mode\n\nVariant 2: \nCharacter-Sheet / Inventory-Menu / Spellbook\nJournal / Area-Map / Quickcast\n\n\nUpdate v1.1:\n- UI-buttons are now highlighted when the mouse moves over them\n- Tweaked position of UI-buttons\n","Rating":9,"Votes":5,"Awards":[]},"112":{"Name":"Companion multiclass 1.21","Author":"Granath","Submitted":20081125,"Updated":20081125,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"All","Description":"Updated version of DMcain's Companion Multi-classing. OC multiclassing should work now with SoZ installed. Thanks go to DMcain for the original work","Rating":9.13,"Votes":6,"Awards":[]},"113":{"Name":"GPS No-Ring UI Mod","Author":"Gaming Parents Studios","Submitted":20081125,"Updated":20081203,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"All","Description":"This is a simple GUI tweak that completely removes the intrusive selection rings you get around your characters and targeted enemy. It also removes that brief spark you get when clicking the ground to move, which remains even when \"Movement Target Marker\" is disabled in the settings menu.\n\nWith it, you can even get a truly clean screen when you hide the GUI: great for better immersion while playing, for filming gameplay footage and for taking screenshots.\n\nTake a look at the before and after shots to see what I mean.\n\n--------\nINSTRUCTIONS\n\n1- Installation is simple. Just extract the GPS No-Ring UI Mod folder to your My Documents/Neverwinter Nights 2/UI/Custom directory. Alternately, you can extract it to your My Documents/Neverwinter Nights 2/Override directory.\n\n2- The GPS No-Ring UI Mod folder includes the following files. If you wish to recover some of the now invisible GUI elements, just delete the corresponding file:\n\n* fx_move_ring.dds -- selected character ring and movement target marker\n* fx_selection.dds -- targeted friendly ring\n* fx_selection_enemy.dds � targeted hostile ring\n* fx_multiselect_ring.tga � multi-selected party member ring\n* fx_4_pointstar.tga � movement target �spark�\n\n3- Some custom UI packages, like Slim GUI, also modify some of these files. If you want to use the GPS No-Ring UI Mod in conjunction with one of those, you will need to manually delete your custom UI�s version of the above files from their install folder (likely located in the UI/custom or override directories).\n\n4- The GPS No-Ring UI Mod is compatible will all versions of NWN2.\n\n--------\nGPS No-Ring UI Mod was put together by E.C.Patterson and Daronas of Gaming Parents Studios.\n\nYour feedback and vote will be appreciated. Thanks.\n","Rating":9.11,"Votes":9,"Awards":[]},"114":{"Name":"Character Naming and Biography Improvements for SoZ","Author":"DM Entropy","Submitted":20081201,"Updated":20081201,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.21","NWN2Game":"NWN2:SoZ","Description":"This is an update of ChiRho84's Character Naming and Biography Improvements so it is compatible with SoZ. \n\nThis is an original UI made by Obsidian and edited by ChiRho84. \n","Rating":9.75,"Votes":2,"Awards":[]},"115":{"Name":"DM Client Extension - PC/PNC Inventory & Local Variables Manager","Author":"Caos81","Submitted":20090207,"Updated":20090226,"Category":"Complete UI Change","Forum Thread":"Link","Patch":"1.21","NWN2Game":"All","Description":"ABSTRACT\n\nThis system extends the official DM Client functionalities. \nIt provides 2 main features:\n\n- PC/PNC inventory manager\n- Object's local variables manager\n\nFEATURES\n\n1) Display/manage PC/PNC inventory (give/take/equip/unequip items).\n2) Display PC/PNC total inventory value (even equipped & carried values apart -> check tooltip).\n3) Display PC/PNC owned gold.\n4) Display PC/PNC encumbrance.\n5) Display/Edit item's property within PC/PNC inventory (identified, plot, stolen, droppable, cursed flags). \n6) Display item's value within PC/PNC inventory. \n7) Display/create/edit/delete local variabibles \n\nINSTALLATION\n\n1) Import the scripts in your module.\na) CLASSIC MODE\nImport the \"dm_client_extension.erf\" in your module \n\nb) DIRECTORY MODE\nUnzip the file \"dm_client_extension.zip\" in your module directory\n\n2) Open your module with the Neverwinter Nights 2 Toolset. Add the following line of code in your \"On Client Enter Script\":\n\nExecuteScript(\"wand_init\", oPc);\n\n\n3) Recompile all your module scripts.\n\n4) Add the UI files to your module.\na) HAK VERSION\nCopy the file \"dm_client_extension.hak\" in your \"Documents\\Neverwinter Nights 2\\hak\" folder.\nAdd the file \"dm_client_extension\" to the module's list of Hak Paks \nOpen your module with the Neverwinter Nights 2 Toolset -> View Module Properties -> Properties pane/tab -> Hak Paks\n\nb) OVERRIDE VERSION\nUnzip the file \"dm_client_extension_UI.zip\" in your override folder.\n\n\n5) Save and close your module\n\nNote\n\nThe default file \"inventoryscreen.xml\" has been slightly modified to allow \"drag & drop give\" feature.\nYou actually don't need to override this file if you don't feel safe or if you already have your own version of this file but you won't be able to drag & drop an item from the DM inventory to the PC/PNG inventory.\n\n\nCONFIGURATION\n\n\n1) Open the Neverwinter Nights 2 Toolset.\n\n2) Edit the script \"wand_inc_conf\". All the options (a few options) are explained within the script.\n\n3) Save the script and recompile all your module scripts.\n\n\nLOCALIZATION\n\n1) Open the Neverwinter Nights 2 Toolset.\n\n2) Edit the script \"wand_inc_language\" and translate all the strings within quotes.\n\n3) Save the script and recompile all your module scripts.\n\nNote\n\nYou don't have to edit any XML file!!!\n\n\nKNOWN ISSUES\n\n1) Examine action is not 100% reliable as it is a trivial workaround.\n\n2) Creature weapon's equipping action do not work with bite slot \n\n3) Bite slot and left claw slot seems to be swapped (INVENTORY_SLOT_CWEAPON_B = 16 <-> INVENTORY_SLOT_CWEAPON_L = 14). I've taken account of this.\n\n4) Equipping action follows the standard equipping action rules. i.e. You can't equip a weapon in you left hand slot if you don't have a weapon in your right slot.\n\n\n\nPlease, if you like this mod download and vote it.\n\nRegards.","Rating":9.98,"Votes":15,"Awards":[]},"116":{"Name":"KEMO Character Biography and Portrait","Author":"KEMO","Submitted":20090214,"Updated":20091030,"Category":"Major UI Change","Patch":"1.22","NWN2Game":"All","Description":"KEMO Character Biography and Portrait (hereafter KEMO Bio) is an alternate character biography panel that allows players to edit information in-game.\n\nKEMO Bio also brings back NWN1-style large portraits.\n\nTo edit your own biography, select the Edit Bio option in the context menu (right-click on your character). To view another character's biography, select Inspect from the context menu after selecting the other character. (Both of these options are right below Examine on their respective context menus.)\n\nWhen editing your bio, type as much as you want to into the box. A scrollbar will appear if you go below the bottom of the box.\n\nTo add or view a portrait, click on the checkbox in the upper right hand corner of the bio panel. The portrait panel will slide out. If you are editing, initially the portrait will show a texture missing error. There is a small text entry box near the top of the panel, and by typing in the TGA filename (without the .tga extension) of the image you wish to use, you can add your own portrait to the KEMO Bio. The panel updates once per second, so when you type in the filename of a TGA in your override folder, it will appear on screen.\n\nOther characters will show their portraits when you click the checkbox, or a texture error if the player has not yet selected a portrait.\n\nBUILDERS/PW ADMINS:\nDistribute packages of TGA portraits to your players (as overrides or in a HAK), or permit your players to share their TGA portraits among themselves. In order for a player to see her or another character's portrait, she must have the appropriate portrait TGA in her override folder (or in a HAK, if overrides have been turned off on the server). If a player does not have the necessary portrait, a texture error will appear.\n\nBecause of the way that these portraits are brought to the screen, they will not crash DM clients the way standard nwn2 player list portraits do. And, of course, these nwn1-style portraits are ginormous.\n\nA standard TGA portrait is 256 x 512, which just happens to be exactly the size of a NWN1 large portrait. So, there are already thousands of portraits available for use with KEMO Bio.\n\nNote: TGA files tend to be rather large and inefficient. My recommendation would be to convert them to 256 indexed color TGAs, which makes them considerably smaller without sacrificing too much quality. Alternatively, you can convert them to JPEG files but keep the .TGA extension. NWN2 will read them correctly even though they are JPEGs and not actually TGAs.\n\nUPDATE 2/18/09 (version 1.1):\n* I added the ability to select a random portrait from a set of portraits. It works as follows:\n\n- create a series of up to 10 portraits\n- name each file so that the word \"pack\" appears in each, somewhere\n- put a digit at the end of the filename, 0 to 9\n (example: myportrait_pack_0, myportrait_pack_1, myportrait_pack_2, etc.; but the_pack_thing0, the_pack_thing1, etc. will also work)\n- when you edit your portrait in the GUI by typing in the filename, type in the filename of the last portrait in the series (so if there are 10, type in the filename of the one with the 9 at the end)\n- your portrait panel will now cycle through your portrait pack, showing you the full set, and settle with the last in the set, confirming that it successfully sees all of the portraits in the pack\n- when someone Inspects you and opens the portrait panel, s/he will see one of the portraits in the pack, chosen at random each time s/he Inspects\n- if you do *not* have a pack, everything will work as normal, showing you and other players the one portrait TGA you entered into the portrait edit panel\n- avoid using \"pack\" in any portrait filename that is not part of an actual pack, as this will prevent it from appearing\n\nUPDATE 2/21/09 (version 1.11):\n* fixed essentially cosmetic problems in the UI XML files; if KEMO Bio is working for you, you don't need to get this version\nUPDATE 3/14/09 (version 1.12):\n* fixed a problem in the script where non-pack pictures aren't displayed properly\nUPDATE 9/22/09 (version 1.13):\n* removed the portrait toggle; now uses a blank background when no image is present\n* fixed a problem in the script where the final image in a pack set wasn't being displayed\nUPDATE 10/31/09\n* modified this description text, no script/gui changes","Rating":9.85,"Votes":16,"Awards":[]},"117":{"Name":"DarkRed UI 1.01","Author":"Wesley","Submitted":20090220,"Updated":20090302,"Category":"Major UI Change","Patch":"1.22","NWN2Game":"All","Description":"DarkRed UI is almost total recolor of the default user \ninterface. Only images files where edited, so there should \nnot be any conflicts with anything (well except other mods \nthat change this files).\nFor a long time a was tired of the default vanilla interface\nand waited for someone to make noticeable art changes, but \nso far nothing really catched my eye, so I finally decided \nto make changes myself, it took me quite awhile, but the end \nresult was most satisfying for me. I played with it for some\ntime and thought - \"this is actually not bad, maybe I should\nupload it to nwvault\". So here we are. I hope you'll like it.\n\n\nInstallation:\n\nCopy \"images\" folder from archive to:\n\nMy Documents\\Neverwinter Nights 2\\ui\\custom\n\nCopy files from \"SoZ_ui\" folder from archive to your game folder to:\n\nexample: C:\\Program Files\\Neverwinter Nights 2\\Campaigns\\Neverwinter Nights 2 Campaign_X2\\UI\n\n(this will replace those files, some make backup)\n\n\nCompatibility:\n\nNWN2, MotB, SoZ, 1.21, 1.22.\n\nTested with 1.21 and 1.22 versions of the game.\n\n\nKnown Issues:\n\nNone.\n\n\nUpdated:\n\nNow supports some Storm of Zehir ui elements, \nalso made some minor tweaks here and there.","Rating":9.25,"Votes":4,"Awards":[]},"118":{"Name":"KEMO PC Scry","Author":"KEMO","Submitted":20090224,"Updated":20090924,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"KEMO PC Scry is an adaptation of NWN1 (and NWN2-adopted) \"scry\" scripts that places the information in a GUI Panel similar to the Player List panel. The panel's contents update every few seconds.\n\nLike previous scry systems, this one provides a few different status options, selectable from the buttons at the bottom of the panel.\n\nIn the Status column:\n- set LFG (looking for group)\n- set AFK (away from keyboard)\n- set DND (do not disturb)\n\nPC's name:\n- no PVP (white name)\n- PVP OK (red name)\n- PVP negotiable (yellow name)\n- Capture OK (green name)\n- Go Anonymous (PC disappears from list)\n\nIn the DM Column:\n- [DM] (marks player as a DM)\n- * (DM client only: Anonymous players appear, but are marked with an asterisk)\n\nBUILDERS:\nTo implement, import the ERF and compile. Then either attach the HAK to your module or extract its contents (one xml file) to another HAK.\n\nDepending on how you want to distribute the scry ability, do either of the following:\n- give players the Scry Device (unlimited uses, activate to open the panel)\n- using Heed's PC Tools, create or replace a scry button in the custom buttons section of gui_hss_tools with the following two lines:\n\nDisplayGuiScreen(oPC,\"KEMO_SCRY_PANEL\",FALSE,\"kemo_scry_panel.xml\");\nExecuteScript(\"gui_kemo_scry_gather\",oPC);\n\nIn the kemo_scry_includes script, there is one constant and one function. The constant, KEMO_USE_CAPTURE, lets you toggle whether or not the \"Capture OK\" button/status is available.\n\nThe function is used to translate an area tag into an area name. Using the existing \"if\" statements as a guide, add your own area tags and the names you wish them to report back. If you don't want to go through all the trouble, replace the contents of the function with a simple return GetName(sAreaTag);\n\nupdate 3/29/09 (version 1.10):\n* fixed some display glitches\n* the refresh rate was 1 second, causing the list to bounce to the top every second unless you held down the scrollbar button while you browsed; now changed to 15 seconds, with specific refreshes at the start and each time a button is pressed\n* demo module removed, as it was rather useless as a demo without being set up as a MP server\n* 1.22-ready\n\nupdate 7/3/09 (no files changed):\n* fixed an outdated instruction in the description above\n\nupdate 9/24/09 (no files changed):\n* relisted as 1.23-compatible","Rating":9.89,"Votes":15,"Awards":[]},"119":{"Name":"Updated Size Changer for United Colors","Author":"gaoneng and saben","Submitted":20090304,"Updated":20090305,"Category":"Other","Patch":"1.22","NWN2Game":"NWN2:SoZ","Description":"Size Changer hasn't been updated in a bit, or for SoZ, and the file to combine it with United Colors was busted when I tried to download it, so I looked over Saben's changes and made them for myself. \nI wanted to share the update to Size Changer with a friend anyways, so I figured somebody else here might want it.\nHope it helps!\n\nEdit: I needed size changer without United Colors, so I uploaded just Size Changer for SoZ too.\n\nUnited Colors: Link\nSize Changer: Link","Rating":"N/A","Awards":[]},"120":{"Name":"Restore NWN2 Menu Screens","Author":"Naranek","Submitted":20090312,"Updated":20090317,"Category":"Minor UI change","Patch":"1.10","NWN2Game":"NWN2:MotB","Description":"Restores the original NWN2 launcher, main menu background, loading screens and main menu music after you have installed Mask of the Betrayer or Storm of Zehir. You may want to do this once you have finished MotB or SoZ and are playing other modules. There are seperate downloads to restore the launcher, the menus and the music so you can chose what you want to restore.\n\nPatch: 1.10 onwards\nNWN2Game: NWN2:MotB or NWN2:SoZ\n\nInstructions:\nSee below","Rating":9.75,"Votes":4,"Awards":[]},"121":{"Name":"Restore MotB Menu Screens","Author":"Naranek","Submitted":20090312,"Updated":20090317,"Category":"Minor UI change","Patch":"1.21","NWN2Game":"NWN2:SoZ","Description":"Restores the Mask of the Betrayer launcher, main menu background, loading screens and main menu music after you have installed Storm of Zehir. You may want to do this if you are currently playing MotB or just prefer them. There are seperate downloads to restore the launcher, the menus and the music so you can chose what you want to restore.\n\nPatch: 1.20 onwards\nNWN2Game: NWN2:SoZ \n\nInstructions:\nSee below","Rating":10,"Votes":5,"Awards":[]},"122":{"Name":"Background Art","Author":"Wesley","Submitted":20090316,"Updated":20100505,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"This mod changes background image in main screens such as character creation, load game, etc. , except main menu and loading screen.\n\nHere are five different background images; you choose which one you like.\n\n\nInstallation:\n\nCopy \"ui\" folder from archive to:\n\nMy Documents\\Neverwinter Nights 2\\\n\n\nCompatibility:\n\nShould work on all versions of the game.\n\nThis mod only changes background image, so will not conflict with anything.\n\nUpdated:\n\nNow works with any installation of the game - NWN2,MotB,SoZ.\n\nReplaced second and third choice with much better art.\n\nUpdated 2:\n\nAdded two more images for you to choose from.","Rating":9.18,"Votes":22,"Awards":[]},"123":{"Name":"Black UI v2","Author":"Wesley","Submitted":20090317,"Updated":20121101,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"This mod changes many elements of interface to darker, more stylish look.\n\nInstallation:\n\nCopy \"black_ui\" folder from archive to:\nMy Documents\\Neverwinter Nights 2\\UI\\Custom\n\nIf you use Storm of Zehir and/or play Storm of Zehir campaign then:\nCopy files from \"SoZ_ui\" folder from archive to your game folder to:\nexample: C:\\Program Files\\Neverwinter Nights 2\\Campaigns\\Neverwinter Nights 2 Campaign_X2\\UI\n(this will replace those files, some make backup)\n\n\nv2 Changes:\nMany tweaks and improvements.\n\nAlso added modified compilation of very useful additions to the ui:\n\nFire&Ice's Big Fonts UI (by fire&ice)\nSimple inventory (by morian_a)\nSquare minimap (by Sliders)\nNWN2 Style Dialog for NWN1 Dialogs (by eledin)\n(note don't use it for Soz campaign)\n\nInstallation:\nUnpack \"ui\" and \"override\" folders from archive to: \"my documents/neverwinter nights 2/\"\n\nAll credits goes to them for making nwn2 better.\n\n","Rating":9.63,"Votes":2,"Awards":[]},"124":{"Name":"Nwn1 dialog form xN","Author":"Daidoji","Submitted":20090328,"Updated":20090329,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"All","Description":"EDITION/MODIFICATION\n-> Comme demandé par Colt17, une version x1.5 de l'UI / as asked by Colt17, a x1.5 version of the UI modification\n-> Remise en forme description et installation / reformat of the description and the installation instruction\n-> Ajout de captures d'écran des UIs en fonction et du chemin d'installation / Added screen capture of the UI and the override folder location\n-> j'ai corrigé l'alignement de droite pour que le texte ne touche pas le bord / i've corrected the right margin so the text don't touch the edge\n\nIntroduction\nFRENCH : Je joue en 1280x1024 et ça me fatigue franchement de lire les textes dans les dialogues style Nwn1; d'ou cette modif : j'ai simplement multiplié par 2 les dimensions de la fenêtre en question, valà :).\nENGLISH : i'm playing in 1280x1024, and i really must focuse on the dialog part nwn1 style :(\nso i made this mod (only on the nwn1 style dialog) wich x2 the width, the hight and the font size.\n\n\nFeatures\n+ UI higher and wider (x1.5 & x2)\n+ UI transparent (alpha 0.6)\n\nInstallation\nSuivez juste les instructions inscrite sous le fichier que vous téléchargez ;). / Just follow the instruction below the file you want to download ;)","Rating":9.75,"Votes":1,"Awards":[]},"125":{"Name":"SoZ Party Editor Menu","Author":"Kaldor Silverwand / Brendan Bellina","Submitted":20090406,"Updated":20091120,"Category":"Minor UI change","Patch":"1.22","NWN2Game":"NWN2:SoZ","Description":"These files add a Party Editor menu option in the SoZ playermenu. This will allow management of player created characters. It will not, however, allow management of cohorts. To manage cohorts you will still need to travel to an inn or trading post.","Rating":9.75,"Votes":4,"Awards":[]},"126":{"Name":"Store Scroll Reset ","Author":"Grinning Fool","Submitted":20090422,"Updated":20090423,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.22","NWN2Game":"All","Description":"Currently, every time you purchase something from a merchant in NWN2, the merchant's list of goods resets back to the top. In order to get another item beneath the one you just purchased, you have to scroll back down to the same position manually. \n\nThis minor update is compatible with OC, MotB, SoZ. This file fixes stores, so that purchasing an item does not reset the list position back to the top.\n\nThis does not correct the secondary issue, where the selection moves up one row after purchasing an item.","Rating":"N/A","Awards":[]},"127":{"Name":"Larger Dialog Portraits","Author":"eleazzaar","Submitted":20090425,"Updated":20090429,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"NWN2","Description":"Larger Dialog Portraits\nv1.1\n\nI grew tired or squinting at the tiny portraits in the non-cinematic dialog. Almost everyone looked pretty much the same. So I poked around in the UI .xml files and created something that I like much better. \n\nWith this mod the portrait is much larger, (140 x 128 px vs 40x40 px) but there is less empty space at the top and sides, so the actual dialog window is only slightly taller.\n\nI *expect* this will work with any version and the MotB expansion. It won�t work with SoZ because of the additional dialog features.\n\n\nEnjoy.","Rating":10,"Votes":6,"Awards":[]},"128":{"Name":"Character Sheet IWD2 Portrait support","Author":"Shin-Anubis","Submitted":20090426,"Updated":20090921,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"This mod alters the Character Sheet, Creature Examine Sheet, Partybar and Overland Partybar in order to support Icewind Dale 2 Portraits (210 x 330).\n\nRequirements: A screen resolution of at least 1280 x 1024\n\nThanks a lot to Radon who fixed the 3D portrait bug for me. He created a special 3D portrait version which is also uploaded here.\n\n[edit] Don't use the ini-file. I forgot to delete before packing the files. [/edit]","Rating":10,"Votes":3,"Awards":[]},"129":{"Name":"Mysteries of Westgate Menu Screens","Author":"Naranek","Submitted":20090511,"Updated":20090511,"Category":"Complete UI Change","Patch":"1.22","NWN2Game":"All","Description":"Replaces the main menu background and loading screens with ones for Mysteries of Westgate. Unlike MotB and SoZ, installing MoW does not change the menu backgrounds. If you have MotB or SoZ you may also want to download the files that restore the original NWN2 music and launcher from my Restore NWN2 Menu Screens mod which can be found under my other submissions.\n","Rating":9,"Votes":1,"Awards":[]},"130":{"Name":"Brand new menu","Author":"Wesley [wes471]","Submitted":20090531,"Updated":20090601,"Category":"Minor UI change","Patch":"1.22","NWN2Game":"All","Description":"This mod replaces background image in the main menu to a new one,\n\nthat contains newly created logos of all expansion and adventure packs.\n\n\nCompatibility and Installation:\n-------------------------------\n\nThis mod works with all versions of the game \n\nand all displays without stretching,\n\nJust open the correct folder for your type of display in archive\n\nand extract it to: \n\nMy Documents/Neverwinter Nights 2/override","Rating":9.5,"Votes":1,"Awards":[]},"131":{"Name":"Music Player","Author":"B.B.","Submitted":20090710,"Updated":20090712,"Category":"Other","Forum Thread":"Link","Patch":"1.22","NWN2Game":"NWN2:MotB","Description":"Browse and play all available songs in game!\n\nHIGHLIGHTS\nQuery now playing\nPull-up playlist (including any custom tracks)\nSkip track forward & back\nPlay/Stop\nRandom\nLimit playlist*\nBlock player via script*\n\nSet includes 2 main gui: a mini player and playlist; another \"Now Playing\" mouse over pop-up gui; wand item and scripts.\n\nI designed this initially to sample music as I play-tested the upcoming campaign trilogy \"Tamas\", but I think it would be a nice option to give players as well. Be aware that it does actually set the current area's music (day, night, or battle, depending on the circumstance).\n\nCurrently there are no DM specific controls, but I have the notion of further design, such as allowing a DM or play-tester to set music in other areas and without current circumstance.\n\nNOTE: Due to toolset limitations, the player does not initialize music status or volume. That is, when initially opened, the play button will be in 'stop' position and volume will be set to '0', though the current area may very well be playing music. Clicking/adjusting them will resolve these issues.\n\nEnjoy! Let me know of any other issues or suggestions.\n\n*(Untested) Limit playlist by setting two global int values, corresponding to the rows in the \"ambientmusic\" 2da:\n BB_MUSIC_MAX_ROW\n BB_MUSIC_MIN_ROW\n*(Untested) Block music player control via script. See \"gui_mp_inc\"\n\nINSTALLATION INSTRUCTIONS:\nextract \"musicplayer\" folder to your MyDocs/NWN2/UI/custom folder. (Or MyDocs/NWN2/UI/ will work, I believe.)\n\nOpen test module, import erf and paint placeable wand item. (Category: Music Player.)\n\nSave and test!","Rating":9.88,"Votes":4,"Awards":[]},"132":{"Name":"2 Row Minimalist Hotbar pack","Author":"ghuru_x86","Submitted":20090717,"Updated":20090718,"Category":"Minor UI change","Patch":"1.22","NWN2Game":"All","Description":"This hotbar pack is based on the original 2 row minimalist hotbar by Nygle. Many thanks to Nygle for creating the original minimalist 2 row hotbar. \n\nThis hotbar pack replaces all 4 hotbars available in the game with matching 2 row minimalist hotbars in any horizontal/vertical configuration desired.","Rating":9.5,"Votes":2,"Awards":[]},"133":{"Name":"DSGA v1.0 DS one-click GUI away (except chat-windows)","Author":"DSenset","Submitted":20090727,"Updated":20090920,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"All","Description":"DSGA v1.0 DSenset one-click GUI away (except chat-windows)\n\nProblem: \n\nI like nature, SpeedTree, lakes and idyllic scenes and silence. I'm not particularly fond of GUIs. We all know the hotkeys in and out. The 3D engine looks awesome. On the other hand, you never know when you get\ntalked to, especially in multiplayer.\n\nSolution:\n\nDSGA v1.0 DSenset one-click GUI away (except chat-windows)! One button, one script. All your worries are gone, especially those you never had! Now cheaper, better and more immersive than ever before! The all-in-one GUI solution for GUI-haters.\n\nthe DSGA overrides the files:\ndefaultchat.xml, defaultmpchat1.xml, \ndefaultmpchat2.xml, minimap.xml, target_object.xml, target_enemy.xml\n\nand uses the alpha (opacity)-values:\nalpha=\"0.12\", \"0.55\", \"0.75\"\n\nDeveloped with NWN2 v1.23, NX1 and NX2. All inclusive.\n\nreport problems, please - but it's final, new features unlikely. (it doesn't disable the optional vertical hotbar 2 and horizontal hotbar 2 by the way. Press \"h\" (standard key binding) once or twice to hide the rest. This very transparent SCREEN_MESSAGE_1-Window may obscure other buttons, this could be mildly confusing - but I don't know what to do with it.)","Rating":10,"Votes":1,"Awards":[]},"134":{"Name":"Super 2-Row Hotbar For SOZ","Author":"Johnny Cool","Submitted":20090813,"Updated":20090813,"Category":"Major UI Change","Patch":"1.21","NWN2Game":"NWN2:SoZ","Description":"This UI modification will improve\nyour hotbar by increasing number of quick-buttons at one screen.\nArchive contains 3 variants of hotbar:\n\n1) 12 buttons in each row. This is default width but height increased twice.\n2) 15 buttons in each row. Hotbar longer...\n3) 20 buttons in each row. Great for widescreen monitor with high definition.","Rating":10,"Votes":1,"Awards":[]},"135":{"Name":"Creature Examine Fix","Author":"player1","Submitted":20090825,"Updated":20090827,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"This add-on fixes issues with feat lists for Animal Companions, Summons and other creatures that have separate character screen tab (activated when their masters do examine command)\n\nUI used for this had an error, and didn't list History, Proficiency, General, Epic, Heritage and Teamwork feats. With the fix, they should show up properly.\n\n\nHow to install?\n\nJust put creatureexamine.XML to your Override folder.","Rating":"N/A","Awards":[]},"136":{"Name":"Character Sheet NWN1 Portrait support","Author":"Shin-Anubis & Thanatos2001","Submitted":20090921,"Updated":20090922,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"This mod alters the Character Sheet, Creature Examine Sheet, Partybar and Overland Partybar in order to support Neverwinter Nights 1 Portraits (256 x 400).\n\nRequirements: A screen resolution of at least 1280 x 1024","Rating":9.67,"Votes":5,"Awards":[]},"137":{"Name":"Hi Resolution GUI","Author":"Galnospoke","Submitted":20091021,"Updated":20101220,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"NWN2:MotB","Description":"New version 2 based on great work Link AND Fire&Ice's Big Fonts UI Link.\n\nI create this version for MotB + latest 1.23 patch only.","Rating":"N/A","Awards":[]},"138":{"Name":"Small and cleaned multiplayer chat windows","Author":"Shiva1608","Submitted":20091030,"Updated":20091031,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"I always thought those chat windows are much too big (using their smallest natural size).\nEspecially if you play a multiplayer game.\n\nSo I've used the original files and changed them. Now you can change the size as you want it.\n\nI've also deleted those buttons which needed a lot of space.\n\nAt last I've minimized the space under the scrollbars. You now can use the whole window for text and don't have to make it bigger to read more than two lines.\n\nI hope you enjoy it.\n\nIf you want changes - just post it ;)\n\nTested on resolutions of 1280x800 and 1680x1050\n----------------------------------------\n\nJust put the files into \"...\\My Documents \\Neverwinter Nights 2\\ ui\\ default\" and start the game.\n","Rating":"N/A","Awards":[]},"139":{"Name":"Smaller and longer partybar","Author":"Shiva1608","Submitted":20091031,"Updated":20091101,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"I always love to have as much free space as possible on my screen- and so I've made this.\n\n\nDescription:\n\n1. All portraits are smaller now.\n2. The bar itself is longer- so you don't have to scroll anymore to see all of your party members- see picture.\n3. If you choose to let the hit points be shown on the portraits you will see the numbers correctly (I made the font size smaller than in the original file so you can still see the portraits under it)\n\nTestet on resolutions of 1280x800 and 1680x1050\n\n-----------------------------------------------------------------\nYou will need two things:\n\n1.the file \"partybar.xml\" from below\n\n2.a file from XUI called \"stylesheet.xml\". \nYou can download complete XUI from: Link\n\nNote: \nXUI is only avaivable as complete installer where you can choose which components should be installed. You will have to install it (for getting the file \"stylesheet.xml\").\n\n-----------------------------------------------------------------\nInstallation:\n\n1. Put the file (from below) \"partybar.xml\" into \"...\\My Documents\\ Neverwinter Nights 2\\ ui\\ default\"\n2. Install XUI and make sure the \"stylesheet.xml\" file lies in the \"...\\My Documents\\ Neverwinter Nights 2\\ ui\\ custom\\ XUI\" folder (all other files can be deleted if you don't want to use them)\n3. Delete \"partybar.xml\" from \"...\\My Documents\\ Neverwinter Nights 2\\ ui\\ custom\\ XUI\" folder to guarantee that the right file will be used.\n4.Start the game\n\n-----------------------------------------------------------------\n\nDifferences between partybar from XUI and mine:\n\nDimension of the portraits are the same, but XUI doesn't support showing Hitpoints on the charakters and the longer bar.Also doesn't XUI show a greyed cross when a character dies-which I think is irritating if you don't see at first sight if a character is still fighting or knocked out.\n\n\n\nI hope you enjoy it ;)\n\nIf you have problems- just post it and I'll see what can be done about it.\n\n\n\n\n","Rating":"N/A","Awards":[]},"140":{"Name":"Inventory with small item icons","Author":"Shiva1608","Submitted":20091031,"Updated":20091031,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"You now have only two pages in the inventory and smaller icons. Sort Button is also included.\n\nBoth pages have 60 slots (instead of 24) so you can better see what you're carrying without having to scrolling through.\n\nThe only (small) disadvantage is that you have 8 slots less than in the original Inventory (120 instead of 128).\n\n-------------------------------------------------------\nInstallation:\n\nput the file into \"...\\My Documents \\Neverwinter Nights 2\\ ui\\ default\" and start the game.\n\n\n","Rating":8.25,"Votes":1,"Awards":[]},"141":{"Name":"Countdown Timer","Author":"The Fred","Submitted":20091114,"Updated":20091114,"Category":"Other","Patch":"1.23","NWN2Game":"All","Description":"A simple countdown timer builders can use in a variety of ways in their modules. Includes is a .erf containing an update script and an include file allowing you to start, pause, unpause and end the timer simply and easily.\n\nUse of the timer will require some basic scripting knowledge, though the include file, \"INC_GUI_TIMER\", contains notes explaining it in more detail.\n\nAnyone with knowledge of NWN2 GUI can easily modify the timer further (for example, the font and style can easily be changed by editing the XML file), but that is left up to you.\n\nFeel free to use and/or modify this however you want, though if you do use it, some credit would be appreciated :-).","Rating":9.75,"Votes":4,"Awards":[]},"142":{"Name":"Color.2da Files","Author":"Sea of Dragons Staff","Submitted":20091231,"Updated":20100325,"Category":"Other","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"These are modified color.2da files meant for extending the usefulness of Gaoneng's excellent United Colors mod. Others like myself may have found the standard 256 color palette to be somewhat limiting so I decided to submit these files for the enjoyment of others.\n\nWhat this basically does is eliminate the majority of the garish color options and replace them with more natural shades of brown, tan, yellow and red. Different races such as drow now have unique and racial appropriate palettes.\n\nThere are still some unnatural colors remaining, but I left them in since they are useful when mixed with natural tones to create new shades.\n\nUpdated 3-25-10\n\nI have uploaded a new set of color.2da files that have revised colors to provide more options and in some cases, remove racially inappropriate colors. The following races have been updated (though the file contains all the 2das):\n\nMoon Elves\nWild Elves\nSun Elves\nHalf-Elves\nHalf-Drow\nDeep Gnome\nTieflings","Rating":"N/A","Awards":[]},"143":{"Name":"Giant Boss Health Bar","Author":"The Fred","Submitted":20100422,"Updated":20100422,"Category":"Other","Patch":"1.23","NWN2Game":"All","Description":"A giant health bar builders can use for \"boss\" foes in their modules. This consists of a simple UI object (and two textures for it), and a .erf which contains both an update script to run the timer, and a simple include file allowing you to set up and remove the healthbar easily.\n\nThe \"health bar\" can actually also be used to track the value of a floating point variable, so you can use it for a whole host of other things as well. You can also set the title text to whatever you like and even specify your own textures, if you want to improve on my sadly lacking digital art skills. All of this can be done easily by changing the inputs to the scripting command in the include file.\n\nUse of the healthbar will require some basic scripting knowledge, though the include file, \"INC_GUI_BOSSBAR\", contains notes explaining it in more detail. You can also make modifications to the XML file itself quite easily to change the font, size, etc.\n\nAs always, you can use this however you want and modify it as much as you like to suit your needs if you so wish.","Rating":10,"Votes":3,"Awards":[]},"145":{"Name":"GUI Style Improved","Author":"Wesley","Submitted":20100510,"Updated":20100511,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"This mod changes some aspects of the interface to have different style.\nI didn't like how some parts of the ui looked, so I made my own version, to be more pleasant to look at.\n\n\nInstallation:\n\nCopy \"ui\" folder from archive to:\n\nMy Documents\\Neverwinter Nights 2\\\n\n\nCompatibility:\n\nShould work on all versions of the game.\n\nThis mod only changes tga files of the ui , so will not conflict with anything.\n\n\nUninstall:\n\nDelete \"images\" folder from:\n\nMy Documents\\Neverwinter Nights 2\\ui\\custom\\","Rating":8.75,"Votes":1,"Awards":[]},"146":{"Name":"In-Game XP Slider","Author":"The Fred","Submitted":20100512,"Updated":20100512,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.23","NWN2Game":"All","Description":"Not happy with the XP rate awarded by your current module? Perhaps you want to up the challenge by lowering your XP? Or perhaps you want to wipe the floor with a high-leveled solo character?\n\nNow, all of these things (and what is, essentially, \"cheating\") are possible, with The Fred's In-Game XP Slider.\n\nPersonally, I think this makes it too tempting for people to give themselves more XP than they deserve, but there are instances where it's a nice feature to have, and anyway it was a request from Nicethugbert.\n\nThe XP Slider appears on the Game Options page (see screenshot) so if you have anything else which affects this screen, it won't work. If this is an issue for anyone, a non-options version can be made easily.\n\nNote that this only affects kill XP, not XP rewards which have been set by the module creator. Equally, modules which use custom XP systems that bypass the standard one will likely also be unaffected. This is the equivalent of changing the slider in the Toolset.","Rating":9.75,"Votes":3,"Awards":[]},"147":{"Name":"Mysteries of Westgate Party Editor files","Author":"Kaldor Silverwand / Brendan Bellina","Submitted":20100518,"Updated":20101126,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"This is the Mysteries of Westgate Campaign.cam file modified to allow the SoZ party creation feature to be used if SoZ is also installed.\n\nMoW Party Editor menu option replaces the MoW player menu with a version that includes buttons for party chat and the party editor.\n\nThis is compatible with the Deck of Trumps item found in the Silverwand Sundries collection.\n\nRequires both SoZ and MoW to be installed.","Rating":10,"Votes":1,"Awards":[]},"150":{"Name":"Updated Playermenupopup.xml","Author":"Navyosteopath","Submitted":20100620,"Updated":20100621,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"Now includes Charlie's Item and Appearance Modifiers, World and Area Maps, \"Retire\".","Rating":8,"Votes":1,"Awards":[]},"151":{"Name":"The Fred's Resting GUI","Author":"The Fred","Submitted":20100624,"Updated":20100624,"Category":"Other","Forum Thread":"Link","Patch":"1.23","NWN2Game":"All","Description":"Resting: One of my favourite activities. I often spend whole days just slobbing around. However, over at the BioWare discussion boards, some people seemed to be insinuating that this most unexerting of activities was boring. So, I decided to drag out this old project of mine, fix it up and make it fully customisable, with the aim of giving people the option of making resting more interesting.\n\nSo what does it do?\nThis is basically a GUI which pops up when resting. I believe MotB has one allowing you to chose to wait rather than resting, and it's mechanically very similar to that. However, it gives the module builder a lot of options for setting up custom options (perhaps you want people to be able to make camp, light fires, study, work, perform rituals or more through the resting button?) and lets you dis-/enable easily, based upon the player's location or (with a little scripting) pretty much whatever you want.\n\nI have included default scripts (including a default OnLoad script, \"m_load\") which will give you basic options for resting in armour (which gives you some mild penalties), resting normally (which has you remove and then re-equip armour, the idea being this would work well with wandering monsters), or simply to wait, MotB-style. All you have to do is use \"m_load\" as your module OnLoad script (or copy the few lines at the bottom of it into your own OnLoad script) and these will be available. With only a little extra work, you can also add/remove/modify options to your heart's content.\n\nThe system is explained in full in the include script \"inc_rest\", and of course I'll be more than willing to answer any questions.\n\nMy intention is to expand this system with optional sub-options and possibly wandering monsters (though I am aware that many people already use their own wandering monster systems, and it's currently not hard to link these into this system).","Rating":10,"Votes":3,"Awards":[]},"152":{"Name":"Lamu's custom UI Sound Effects","Author":"lamu","Submitted":20100814,"Updated":20100815,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"This small mod changes the way the UI sounds. I always hated the clunky feel of the NWN2 UI - especially the standard sound effect for opening and closing windows. I also changed the Volume of certain sounds of the UI and added a little reverb here and there.\nShould feel and sound much better now...\n\nInstallation: Place the entire \"sfx\" folder (extracted from the downloaded zip-archive) in ...My Documents\\Neverwinter Nights 2\\ui\\default\n\nUninstallation: Delete the \"sfx\" folder in ...My Documents\\Neverwinter Nights 2\\ui\\default","Rating":10,"Votes":1,"Awards":[]},"153":{"Name":"NumGet","Author":"Olblach","Submitted":20101018,"Updated":20101019,"Category":"Other","Patch":"1.00","NWN2Game":"All","Description":"This is my first attempt a playing with the GUI. As I was writing the banker scripts I needed something to input the amount of money you want to deposit or withdraw. Since I found nothing on the vault I decided to write my own. Here it is.\nThanks to MasterChanger on BiowareForums for helping me with the slider issue!\n\nINSTALLATION:\nImport the ERF into your module\n\nCopy the numget.xml:\ninto a hak used by your module.\nOr into override \nor into ui/custom\n\nThere is a demo module with a lever showing how to use the scripts.\n\n","Rating":"N/A","Awards":[]},"154":{"Name":"Left-Side Party Bars","Author":"Maxson","Submitted":20101111,"Updated":20101112,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"This is a \"Spiritual Sequel\" to SLATE's Left Aligned Party bar which is buggy and a bit broken in the current game builds, and appears to be designed for the minimap to still be above it onscreen.\n\nDue to the way I changed the buff bar, this took entirely too long.\n\nWhat it does:\n-Moves Party bars from right to left of the screen\n-Changes buff grids to a slightly more compact version, and makes them grow top to bottom, left to right","Rating":10,"Votes":1,"Awards":[]},"155":{"Name":"The Fred's Scriptable Party","Author":"The Fred","Submitted":20101214,"Updated":20110102,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.23","NWN2Game":"All","Description":"After reading on the BioWare forums yet more complaints about the game's AI, I decided to create this small package. It modifies the behaviour tab of the Character Screen to add a section where you may specify a custom combat script your party members will run, much like in the old Baldur's Gate game.\n\nThis means that if you have a very specific niche character who you want to do certain set things in combat, you can write a custom script for them which will override their standard actions using the HotU override AI script system. To install, simply dump the contents of the .zip file in your /override folder.\n\nThere are some caveats to this system:\n\n1) You need to write (or have written) the script; on it's own, this package does nothing. For this, I recommend using the NSSCLC to compile it, or a tool such as NWN2Packer to extract one made in the toolset from a module. You should then place the .ncs file (the compiled script) in your override folder, too.\n\n2) This system is still pretty much a prototype. It uses the HotU override AI script system, so while it will work on PCs (who are not being controlled) and standard companions, there is no guarantee it will work on companions in every module, since they may (but probably won't) use a different AI system.\n\n3) The henchman AI will make companions do certain things, like healing when critical or following the party leader, as a higher priority than whatever you tell them to do. Usually, though, this is probably a good thing.\n\n4) This system modifies the Characterscreen.xml UI file. So, it's NOT compatible with other such systems (I think TonyK's AI is one) - though it wouldn't be too hard to make a compatible version.\n\n5) It is perfectly possible to make \"illegal\" scripts, such as ones which auto-heal or make your companions invincible; however, if you want to do this sort of thing you could just console yourself up to the max level or whatever. The point of this is to allow you to use a custom AI script, though you can use it how you wish.","Rating":10,"Votes":2,"Awards":[]},"156":{"Name":"Simple Chat Improvement","Author":"Vanes","Submitted":20110127,"Updated":20110130,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"This UI change basically changes the \"telling\" to work similar to how it always worked in NWN1. You click on the player's portrait (here simply the line they spoke) in the chat, and then enter what you would like to tell them. \n\nI always thought that right-clicking through the context menu of the Player List or even the chat box was WAY too cumbersome...so here's the solution. :)\n\nThis package will also provide a small \"tweak\" to the chat box to make it take up less space. This is accomplished by putting the Talk/Party/Whisper/Shout buttons on top diagonally and fading them out for even less clutter on the screen. The scrollbars are on the right since it just feels better that way.\n\nHelpful Tip: Use the right-mouse button to \"Save As\" when downloading, otherwise your browser may try to open the files instead.\n\nInstallation Instructions:\n--------------------------\n\nFor SP/MP Players:\n------------------\n\n1. Place the XML files into your Override folder.\n2. Play!\n\nFor MP Server Hosts:\n--------------------\n\nHere you have two choices. You can:\n\nA) Package all the files in a HAK-pack associated with the module.\n\nB) Add the .NSS/.NCS files to your module from the toolset, and place the .XML files into the Override folder.\n\nGoing with B) your players just need to have the .XML files in their Override.","Rating":10,"Votes":2,"Awards":[]},"157":{"Name":"LB Map Functions - Fog of War! (LB)","Author":"Lance Botelle","Submitted":20110203,"Updated":20110330,"Category":"Complete UI Change","Forum Thread":"Link","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"Map facility to allow builders to add \"Fog of War\" (FOW) to their maps or make maps unavailable altogether without using placeable objects. Builders can also make slight code adjustments to add their own maps instead of using the exisiting map.\n\nA replacement minimap.xml is available for those who want the original size mini-map. Simply replace the current minimap.xml file in the hak with this one.\n\nUPDATE v1.02: Removed and tidied some of the debug code and feedback. Added a few checks for invalid areas. Corrected a few typos in the PDF manual.\n\nEarlier v1.01c: Fixes a bug when used in \"Passive\" mapping mode. NB: This fix also requires a line of code to be added to the Area OnExit. (v1.01c: PDF Updated.) NB: Both the areamap.xml & minimap.xml files *were changed* inside the hak with this version compared to the original separate versions, so be sure to use the new hak instead of the old version.\n\nBUILDER INFORMATION\n=================\n\n1) The update rate is currently set at 0.5 seconds, which is fast enough for most areas of medium to large in size. If, however, you intend to use FoW on even very small areas, then you will need to decrease the time between updates so there is no lag in the FoW being updated. Builders may want to experiment with this value to determine the best results to performance. Personally, I do NOT recommend using FoW maps on such small areas and advise using the \"No FoW Waypoint\" that disables it for an area in such cases. \n\n2) Strict Interior/Exterior observing: The code also makes adjustments depending on whether the area is an exterior or interior and checks this with the GetIsAreaInterior function. If you have set this differently to the tiles expected, then results will be out.\n\n3) If the FOWMAPINCOMBAT variable is left in its default state of 0, then mapping must be restarted by opening the map after combat. This includes \"Passive Mode\" mapping. To avoid this for Passive Mode, be sure to set FOWMAPINCOMBAT to 1, but recognise that this may affect performance if a combat is CPU intensive.","Rating":10,"Votes":24,"Awards":[]},"158":{"Name":"Compiled dialog.tlk","Author":"navyosteopath (compiler only)","Submitted":20110209,"Updated":20110319,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"A dialog.tlk with the necessary entries for SOZ, Cyphre's animal companions, Loki's familiars, and the latest Kaedrin update (1.41.2).","Rating":10,"Votes":1,"Awards":[]},"159":{"Name":"No more \"z\" key!","Author":"Batmanis64","Submitted":20110321,"Updated":20110322,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"Don't want players being able to highlight all usable objects and creatures with a single keystroke? Do you want a more hardcore \"searching\" element to your mods, like the original Baldur's Gate? Worry no more! Simply put the edited keymap.2da in your override folder or hakpak, and the Inspection/Highlight ability is gone for good. ","Rating":10,"Votes":2,"Awards":[]},"160":{"Name":"Henchmen Game Crash Fix (LB)","Author":"Lance Botelle","Submitted":20110327,"Updated":20110328,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"Fixes the game crash bug when a player tries to leave a NWN2 game when they have henchmen in the party.\n\nNB: Be sure to read the readme.txt file that is included in the download, as it explains an important point about ensuring you have set the maximum number of henchmen.","Rating":9.92,"Votes":3,"Awards":[]},"161":{"Name":"Bagel's Partybars and Targeting Frames","Author":"Amphibious Bagel","Submitted":20110724,"Updated":20110724,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"Purpose and Contents:\nThis package was made in order to help save screen space and help clean up the UI to make it more friendly to multiplayer environments.\n\nIncluded in this package are changes to:[/b]\n- DM Client Partybars\n- Player Client Partybars\n- Friendly Target UI\n- Enemy Target UI\n\nFor the Player Side Partybar Changes:\n- Partybar now fits about double the amount of portraits it did before.\n- Portraits and buff icons are smaller.\n- Party members' names appear next to their portrait.\n- Health is displayed as Current HP out of Max HP.\n\nFor the DM Side Partybar Changes:\n- Removed buggy HP and selection icons from the menu.\n- Shrank portraits; you can still mouseover these to get the player's name and Shift + Right Click to access your normal DM commands.\n- Shrank hp bar; you can still mouseover these to get the Current HP over Max HP for the player.\n- Personal Portrait is in the same style as the PC partybar.\n\nChanges to Targeting Frames:\n- Friendly and Enemy targets now display their name and report what % of health they currently have.\n\n\n\nTO FIT EVEN MORE PARTY PORTRAITS ON YOUR SCREEN (if your resolution allows it):\n\nFor the Player Side UI:\n1) Using Notepad++ (which you can get for free at [url]http://www.notepad-plus-plus.org)[/url] or another XML editing program, open up partybar.xml.\n2) On line 3, change the UIScene \"height\" value (which is currently at \"602\" pixels) to a higher number. Each portrait is 52 pixels tall, so you'll probably want to add on in amounts of 52.\n3) Save and close the file.\n\nFor the DM Side UI:\n1) Using Notepad++ or another XML editing program, open up dmcpartybar.xml.\n2) On line 3, change the UIScene \"height\" value (which is currently at \"602\" pixels) to a higher number. Each portrait is 38 pixels tall, so you'll probably want to add on in amounts of 38.\n3) On line 162, change the UIListBox \"height\" value (which is currently at \"495\" pixels) to a higher number. Add the same amount to this number as you did to the height on line 3.\n4) Save and close the file.\n\nCheers!\n\n","Rating":10,"Votes":3,"Awards":[]},"162":{"Name":"Character Visibility Context Menu Option","Author":"Kaldor Silverwand / Brendan Bellina","Submitted":20110724,"Updated":20120412,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"Note: The Kaldor Silverwand Context Menu Additions currently available exclusively at neverwinter.nexusmods.com contains this functionality as well as additional menu options.\n\nInstall in your NWN2 override folder and this will add an option to the player menu context menu that allows altering the visibility of the character or faction to transparent or degrees of visibility (20%, 40%, 60%, 80%). This affects only the appearance of the character(s) in the game, not functionality. When complete transparency is selected any weapons will also be hidden. Weapons can also be hidden when partially visible via the Hide Weapons and Hide Faction Weapons menu options.\n\nNote: Some, but not all visual effects are hidden when weapons are hidden.\n\nEnhancements in V2.0\n- Additional effects added for 20% visibility, 60% visibility, and 80% visibility\n- Submenu to have effects applied to entire faction\n- Options to hide weaponry (held items)\n- Complete transparency option will automatically hide weaponry","Rating":10,"Votes":5,"Awards":[]},"163":{"Name":"C_938 Custom Target Frames 0.32","Author":"Construct_938","Submitted":20110829,"Updated":20111016,"Category":"Minor UI change","Patch":"1.00","NWN2Game":"All","Description":"UI mod that adds somewhat nicer looking target frames to NWN2. It will display appropriate portraits and/or icons for NPCs, enemies, allies and objects, as well as an HP bar with the HP percentage shown (in case of NPCs and enemies/allies). The name of the NPC/object is displayed in one line or two lines depending on the length, as shown in the screenshot. The target frames are fully movable.","Rating":"N/A","Awards":[]},"164":{"Name":"The Spell Clock","Author":"Xydek","Submitted":20110917,"Updated":20110928,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"The spell clock is a new element in the NWN2 user interface. It's like a digital alarm clock intended to count spell duration (but it could also count any other time period). It could be very useful when casting long term buffing spells and want to know how much time is left before they expire.\n\nThe way the spell clock is implemented, it will work with all official or community modules / campaigns without causing, in any of them, any kind of problems or side effects or affecting anything (or be affected by anything).\n\nThe spell clock user interface is located to the right of the action queue.\n\nThe pdf file describes in detail how to use the clock. Some special issues are also answered there.\n\nNote: If you are a module builder, you might want to try a somewhat similar mod by The Fred. You can find it here.\n\nThe screenshots are from Conan Chronicles 2 - The Zamorian Chronicles.\n","Rating":10,"Votes":1,"Awards":[]},"165":{"Name":"Obvious Voice Icons","Author":"Rogon","Submitted":20111030,"Updated":20111031,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"This package replaces the generic voice over icons with custom icons that are, well.. obvious. ","Rating":10,"Votes":1,"Awards":[]},"166":{"Name":"Bluthagels 1680","Author":"Bluthagel","Submitted":20111103,"Updated":20120103,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"This mod is based on Charlie's UI, Companion and Monster AI 2.2, Smaller and longer partybar and Alzikar's Improved Examine window.\n\nIt further enhances the improvements from those mods by optimizing them for playing on a 1680 x 1050 display.\n\nFurther details and GERMAN installation instructions: Link","Rating":"N/A","Awards":[]},"167":{"Name":"Bluthagels Wallstreet Exchange (swaps bull/bear icons; intended for German version)","Author":"Bluthagel","Submitted":20111103,"Updated":20120103,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"In the German version of NWN2, the names of \"Bulls Strength\" and \"Bears Endurance\" were changed confusingly:\n\n* \"Bulls Strength\" has become \"Bärenstärke\" (meaning \"Bears Strength\")\n* \"Bears Endurance\" has become \"Ausdauer des Ochsen\" (meaning \"Bullocks Endurance\")\n\nIn essence, the bull has become a bear an vice-versa.\n\nAs a result, the according icons show the incorrect animal.\nThis mod simply swaps the original pictures in order to rectify the problem.","Rating":"N/A","Awards":[]},"168":{"Name":"NWN2 Inventory Sorter","Author":"Ratanak","Submitted":20120303,"Updated":20120304,"Category":"Major UI Change","Patch":"1.23","NWN2Game":"All","Description":"Overview\nNeverwinter Nights 2 is a great game with many interesting features, but one thing it lacks is control over inventory sorting. As it stands, the sort ordering is predefined and although it offers ordering with some frequently used items occurring first, it is not suitable for all players.\n\nThe NWN2 Inventory Sorter (NWN2IS) is an engine that attempts to address this issue by allowing players more control over sort ordering. It also features the ability to sort containers in the inventory such as magic bags.\n\nThrough an in-game interface, players are given a choice of which criteria they would like to use to sort each of their characters' inventories. Each character is given their own personal settings.\n\nIf the available criteria are not enough, with a little scripting knowledge, it is possible to add additional criteria. Customization by way of table editing is also available for those who would rather not do scripting.\n\nRequirements\nNWN2IS was developed and tested with the English version of Neverwinter Nights 2 Platinum (which includes the Mask of the Betrayer and Storm of Zehir expansions). However, theoretically, it should work with any version of Neverwinter Nights 2 updated to the latest version.\n\nIn terms of system requirements, they are the same as the requirements for Neverwinter Nights 2. If you can run NWN2, you should be able to run the NWN2IS.\n\nNWN2IS has not been tested with multiplayer.","Rating":9.5,"Votes":5,"Awards":[]},"169":{"Name":"Tchos' UI button sound replacement","Author":"Tchos","Submitted":20120311,"Updated":20120317,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.23","NWN2Game":"NWN2","Description":"Tchos' UI button sound replacement\nVersion 1.0\nCategory: UI mods\n\nA replacement sound for the \"click\" of most buttons in NWN2\nYoutube demonstration:\nLink\n\nIndex:SummaryRequirementsInstallationUsing the modKnown IssuesUse in other modsRevision historyCreditsContact info1. Summary\nNot much to say here. I just didn't like the sound of the button click, and wanted something a little more weighty and solid, that also wasn't too loud, which would fit the elegant style of the interface. I had done this before with another game's buttons, so it was a minor task to find which file to replace in here.\n\n2. Requirements\nIt works on all versions, with or without expansions.\n\n3. Installation\nThe mod is provided in a compressed folder. You can move this folder into your override folder, or if you prefer to keep your override folder empty, it will also work if you move the folder into your UI\\custom\\ folder.\nBoth override and UI folders are usually found in Documents\\Neverwinter Nights 2\\override, and Documents\\Neverwinter Nights 2\\ui respectively. See this wiki page for more information on installation directories.\n\n4. Using the mod\nYou'll know it's working when you click the first button on the main menu screen, and on any interface within the game that usually makes a click.\n\n5. Known Issues\nNone currently known.\n\n6. Use in other mods\nYou are welcome to improve upon my work.\n\n7. Revision history\n 2012-03-10: Initial release\n\n8. Credits\nThis was a solo effort, but I'm always indebted to the modders/builders who have contributed to the accumulated body of knowledge on the web, to allow me to know where to start in the first place.\n\n9. Contact & further info\nAlternate download location.\n\nI can be contacted on the Nexus Network as Tchos, or the Bioware Social Network also as Tchos, or through my gaming blog. If you would like to leave a comment, please do so on the Nexus comment thread for this file, as it is much easier for me to check for new comments there, where the comments for all my files appear all at once, rather than checking each page individually. You can comment here too, of course, but it will probably take longer for me to see it.","Rating":"N/A","Awards":[]},"170":{"Name":"Tchos' HD widescreen loading screens","Author":"Tchos","Submitted":20120317,"Updated":20120325,"Category":"Minor UI change","Forum Thread":"Link","Patch":"1.23","NWN2Game":"NWN2:SoZ","Description":"Tchos' HD Widescreen Menu & Loading Screen\nVersion 1.0\nCategory: UI mods\n\nA 1920x1080 set of menus and loading screens for NWN2 based on the pre-expansion versions.\n\nIndex:\n 1. Summary\n 2. Requirements\n 3. Installation\n 4. Using the mod\n 5. Known Issues\n 6. Use in other mods\n 7. Revision history\n 8. Credits\n 9. Contact info\n\n1. Summary\nThe menus and loading screens for NWN2 were designed for a 4:3 monitor aspect ratio, and on a modern widescreen display will appear either stretched out horizontally or have black bars on the sides.\n\nAdditionally, when you patch your game to the latest version, the vanilla menus are changed to a Storm of Zehir theme, which, while well-designed, is a little too specific for my taste -- and was especially inappropriate when I hadn't yet played the OC or Mask of the Betrayer!\n\nThis interface mod provides a menu and loading screen background based upon the original vanilla version, but edited to full HD widescreen format. I made them in such a way as to have as little distortion as possible, and none in the focal area. They should scale down to lower widescreen resolutions as well.\n\nAlso available here is a background to add a little more life to the character creation and level-up screen and other screens that use the same background. Install this by placing it in the same location as the others. You can replace this with any wallpaper of your choice if you save your chosen wallpaper as a TGA with the same name as this one. It will need to be in a 16:9 aspect ratio or it'll be distorted.\n\n2. Requirements\nNeverwinter Nights with both expansions.\n\nThis mod overrides certain graphics from Expansion 2: Storm of Zehir, and I've only tested it with Neverwinter Nights Platinum, which includes both expansions. It may also work on the vanilla game with the latest patch.\n\n3. Installation\nThe mod is provided in a compressed folder. You can move this folder into your override folder, or if you prefer to keep your override folder empty, it should also work if you move the folder into your UI\\custom\\ folder.\n\nBoth override and UI folders are usually found in Documents\\Neverwinter Nights 2\\override and Documents\\Neverwinter Nights 2\\ui respectively. See this wiki page for more information on installation directories.\n\n4. Using the mod\nYou should know if it's working or not as soon as the main menu screen appears.\n\n5. Known Issues\nNone currently known.\n\n6. Use in other mods\nYou are welcome to improve upon my work.\n\n7. Revision history\n 2012-03-09: Initial release\n\n8. Credits\nThis was a solo effort, but I'm always indebted to the modders/builders who have contributed to the accumulated body of knowledge on the web, to allow me to know where to start in the first place.\n\nImage for optional background from official Neverwinter wallpaper.\n\n9. Contact & further info\nAlternate download location.\n\nI can be contacted on the Nexus Network as Tchos, or the Bioware Social Network also as Tchos, or through my gaming blog. If you would like to leave a comment, please do so on the Nexus comment thread for this file, as it is much easier for me to check for new comments there, where the comments for all my files appear all at once, rather than checking each page individually. You can comment here too, of course, but it will probably take longer for me to see it.","Rating":9.44,"Votes":4,"Awards":[]},"171":{"Name":"Tchos' HD UI panels and dialogue compilation & expansion","Author":"Tchos","Submitted":20120404,"Updated":20120904,"Category":"Major UI Change","Forum Thread":"Link","Patch":"1.23","NWN2Game":"NWN2","Description":"Tchos' HD UI panels and dialogue compilation and expansion\nVersion 1.3\nCategory: UI mods\n\nThis mod overhauls many aspects of the user interface of NWN2 to provide larger fonts and larger panels for HD widescreen resolutions of 1920x1080, as well as support image portraits in the vertical rectangular size of 256x400 pixels.\n\nAlso works at lower resolutions, though the panels and fonts may appear too big, and at some resolutions the bottoms will be cut off.\n\nI recommend tracking this file, for alerts to any future updates.\n\nIndex:\n 1. Summary\n 2. Requirements\n 3. Installation\n 4. Using the mod\n 5. Known Issues\n 6. Revision history\n 7. Credits\n 8. Contact info\n\n1. Summary\nI play at a high resolution, so I want big panels that take advantage of the large screen size, and also large fonts so it'll be readable. This mod enlarges the font and panel sizes of nearly everything in-game, making them both easier to read, and require less scrolling to see everything, and also adds support for NWN1-style portraits, in a 1:2 ratio of 256x400 pixels. Included in the package is a file that explains every change in detail, but broadly, this affects the panels for conversations, vendors/containers, quest log, examination/descriptions, spell lists, inventory, character sheet, party portrait bar, target icon, and various menus. Many instances of ALL-CAPS TEXT have also been changed to mixed-case, for easier readability.\n\nRagnorak's Expanded Lists for Hi-Rez, Shin-Anubis/Thanatos2001's Character Sheet NWN1 Portrait support, and Fire&Ice/WhatIsSol's Big Fonts UI are excellent UI mods, though they were designed for somewhat lower resolutions than 1920x1080, and have slightly different goals which don't work together perfectly. My goal was to expand everything, redesign some UI aspects, and get everything nicely integrated.\n\nMy work on this mod started as a mod for the conversation panel (what the game files call the \"quick chat\" panel). I prefer the dialogue to be presented in this manner, rather than the \"cinematic\" style that's the default in the toolset. I prefer being able to control the pace of the conversation, and not have it fed to me in line-by-line chunks.\n\nBut I wanted the box to be much bigger, since I consider the dialogue to be an important part of the game. You can't do anything else while you're in a conversation, so why not make it the main focus of the screen while you're in it? Putting it in a little box in the corner is no good, especially at this resolution, where the font is rather squintworthy.\n\nI made the conversation portrait twice as large as it was, to put more focus on the subject of the conversation (though still only half the height I set for the character's dialogue), and with the portrait aspect ratio change I was able to just put it in a kind of \"column\" on the left, with both the NPC name and the dialogue in a second column to the right of it. One note about the altered aspect ratio, though...I couldn't find any parameters to adjust the camera placement for the default \"rendered\" portraits made out of snapshots of the character model, so it basically looks like a slightly off-centre closeup. The custom portraits at the intended aspect ratio look perfect, though.\n\nI think it's a pretty good size for both the NPC's dialogue and the list of your responses. Now you can have up to 10 response options visible at once without the scrollbars appearing, if they're all of a typical length. How much empty space you see is, of course, dependent on the amount of dialogue written for any given part of the conversation.\n\nNext, I expanded the portrait selection window to show much larger portraits, to make it easier to choose one. I tried to make it more than four columns, but I couldn't get the portraits to appear correctly in the additional columns, so I just left it at four.\n\nFinally, I expanded the column of portraits for your party members to use the full height of the screen at 1920x1080. Even in the vanilla game, there are times when you can have 5 full companions and enough animal companions/familiars/summoned creatures to make you have to scroll through the portrait column to check your companions' health or status effects. Now there's less unnecessary scrolling at 1920x1080.\n\nLong story short, I went through the rest of the interface panels and increased the panel sizes of most of them. Included is a file describing each XML file, what it does, and what's new about it, and you can pick and choose which UI elements to change based on that information. (Documenting these files was quite a chore in itself, but should help the end user.) There are a few files in there that are unchanged from the F&I Big Fonts mod, which I included for the sake of completeness and compatibility. Also see screenshots for some examples of the mod in action.\n\n2. Requirements\nThis mod might require both expansions, because the ability to change to image portraits wasn't in the original release. However, since the character panel is replaced, and since the original release includes patches and upgrades to the SoZ code base, I think it may work fine with a fully-patched vanilla game. I've only tested it with Neverwinter Nights Platinum, which includes both expansions.\n\n3. Installation\nThe mod is provided in a compressed folder. You can move this folder into your override folder, or if you prefer to keep your override folder empty, it should also work if you move the folder into your UI\\custom\\ folder.\n\nBoth override and UI folders are usually found in Documents\\Neverwinter Nights 2\\override and Documents\\Neverwinter Nights 2\\ui respectively. See this wiki page for more information on installation directories.\n\nIf you're upgrading from a previous version of this mod, I recommend completely removing the old one before replacing it with this new one. If you've made any personal modifications to things like font sizes, save those files elsewhere, and reapply your changes to the new files.\n\n4. Using the mod\nPlay the game and see if there are any panels you don't like in this style. Read the included file manifest to determine which files to delete to restore that part of the UI to normal.\n\nUsing custom portraits:\nThe portraits are chosen in the character sheets for your party members. Double-click the existing 3D character portrait, and if you've installed the portraits from the portrait packs into the correct location, you can select them from the panel that will appear.\n\nAside from the portrait packs included on this download page, also try out Deserk's NWN2 Portraits, which provides a large selection which are made to work with this aspect ratio. \n\nOr, to make your own portraits, you can take any picture, and crop/resize it to 256x400, and save it as a TGA. You can also take any portrait that was made for NWN1, crop off the blank space at the bottom, and save it as a TGA. There are hundreds, or perhaps thousands of custom NWN1 portraits available online.\n\n5. Known Issues\nMinor: The Storm of Zehir party chat icons that indicate a different party member has something special to say (the little speech bubble icons) are vertically stretched now that I've changed the aspect ratio. I'm having trouble finding that graphic to fix it.\nFixed: The list box for the merchant stores could previously cut off the last item in the list.\n\n6. Revision history\n 2012-03-17:Initial release 1.0\n 2012-04-04:Version 1.1. Changed background of quest journal to get rid of the crowding on the left margin Modified the stylesheet.xml file to make the behaviour panel items have a mixed-case font and a wider space to display the information, to prevent things getting cut off, and to make it compatible with Tony_K's AI mod. Increased the size of the SoZ party chat panel, moved the portrait down from the header into the text area and adjusted the NPC speaking area to compensate, increased the size of the speaker's name in the header, and adjusted all of the portraits to the NWN1 aspect ratio. Changed the scrollbar on the portrait picker to have a normal-sized handle instead of the tiny one. Returned the non-SoZ dialogue panel to the original colour scheme for compatibility with particular conversations that specify non-default light colours for certain text. The parchment style dialogue is still included, but renamed. If you want to use it anyway, you can delete the new quickchat.xml and rename the old one to take its place. 2012-04-05:Version 1.2 Fixed an error in text placement on the SoZ party chat that was introduced in v1.1 by me accidentally saving over some code I was working on when I had 2 files open. Since I was working on it anyway, I made some further improvements in the design of both versions of the dialogue box. Notably in the amount of text shown, the spacing between reply options, and the amount of space in the middle dividers.\n2012-04-05:Version 1.3 Added new large version of the SoZ party creation screen. Added new large version of the tutorial popup box. (I use this box for DM narration text in my own module.) Fixed gaps between object and frame in the target_object and target_enemy files. Edited store.xml \"showpartial\" attribute to fix a bug that could prevent the last item in the list from appearing. (Thanks to kevL for identifying this!) Edited the portrait picker screen to get the frames properly lined up around the portraits. Portrait picker screen now shows full \"Select a portrait for your character\" line. A minor edit to noticewindow.xml to change the all-caps yellow notices that pop up at the top of the screen to mixed case.7. Credits\nThis mod is compiled and expanded from, and based on the work and examples of Ragnorak, Shin-Anubis, Thanatos2001, Fire&Ice, and WhatIsSol.Ragnorak: Expanded Lists for Hi-Rez -- used as basis and example for some parts, with my expansions and reworks.Shin-Anubis and Thanatos2001: Character Sheet NWN1 Portrait support -- Much of the portrait work comes from this, with my expansions. Also the packaging of the original NWN1 portraits.Fire&Ice and WhatIsSol: Fire&Ice's Big Fonts UI -- The whole basis, and a great amount of work for the bigger fonts began here.8. Contact & further info\nAlternate download location.\n\nI can be contacted on the Nexus Network as Tchos, or the Bioware Social Network also as Tchos, or through my gaming blog. If you would like to leave a comment, please do so on the Nexus comment thread for this file, as it is much easier for me to check for new comments there, where the comments for all my mods appear all at once, rather than having to check each mod's page individually. You can comment here too, of course, but it will probably take longer for me to see it.","Rating":9.67,"Votes":3,"Awards":[]},"172":{"Name":"BG Style Shortcuts for SlimGui","Author":"RedRover","Submitted":20120407,"Updated":20120408,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"These TGA files will replace the shortcut images in SlimGui by Sliders. I was always confusing the shortcuts and wanted something a little more descriptive for me. ","Rating":"N/A","Awards":[]},"173":{"Name":"Expansion-style Location Previews for OC","Author":"EeeKitties","Submitted":20130315,"Updated":20130316,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"I wasn't fond of the original campaign's location previews in loading screens (in the \"donotatlas\" folder), they looked odd with my custom loading screens so I modified them to look more like the expansions.\n\nI've included a blank layered file (saved with the free editing software, Paint.NET) so that anyone can make their own edits (if you redistribute, please credit the texture creators). I couldn't decide on how it should look for a while and I'm sure someone can do better!\n\nCredits:\n\n* Frame Texture by EKDuncan/EveyD: eveyd.deviantart.com\n* Canvas Texture by Inadesign-Stock: inadesign-stock.deviantart.com\n* Layered file is for use with free editing software, Paint.NET: getpaint.net\n\nIf you modify/redistribute, please credit the texture creators.","Rating":"N/A","Awards":[]},"174":{"Name":"Concept Art Loading and Menu Screens for 1920x1080","Author":"EeeKitties","Submitted":20130315,"Updated":20130316,"Category":"Minor UI change","Patch":"1.23","NWN2Game":"All","Description":"After being inspired by two mods on the NWVault (Tchos' HD Widescreen Menu & Loading Screen and Wesley's Background Art), I decided to make my own loading screens for my monitor resolution and using only official concept art.\n\nIt was tricky to find big enough images (as they didn't show up on Google), but I managed to find two on the NWVault and then I resized and cropped them to my liking.\n\nThe campaign logo (depends on which expansions you have or have not installed) is now blank to view the art in full glory.\n\nThis only affects the main module/campaign screen, character creation screen and the loading screen.\n\n\"ls_generic_default01\" (OC only) and \"generic_default_01\" (expansions) are the campaign logos which I made transparent so you can see the loading screens in full glory.","Rating":"N/A","Awards":[]}}
